{
	"author": [
		"Bart Meyers",
		"Romuald Deshayes",
		"Levi Lúcio",
		"Eugene Syriani",
		"Hans Vangheluwe",
		"Manuel Wimmer"
	],
	"back": "SLE-2014",
	"booktitle": "Proceedings of the Seventh International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2014",
	"dblpkey": "conf/sle/MeyersDLSVW14",
	"doi": "10.1007/978-3-319-11245-9_1",
	"editor": [
		"Benoît Combemale",
		"David J. Pearce",
		"Olivier Barais",
		"Jurgen J. Vinju"
	],
	"future": [
		"For future work, we intend to use ProMoBox in a case study for gestural interaction [31]. In this case study, we plan to do more research on the performance of model checking using ProMoBox.",
		"Moreover, we plan to investigate how different property languages can be supported using different templates, and how these templates can be re-used, e.g., an existing template for structural properties could be re-used in the properties template that is presented in this paper.",
		"We are also interested in broadening the types of languages that are supported by ProMoBox, e.g., languages that explicitly include time. We expect that this would typically result in investigating associated templates for real-time properties"
	],
	"isbn": "978-3-319-11244-2",
	"pages": "1-20",
	"past": [
		"dblp:DSM-2007-GrayNTG0S",
		"dblp:FOSE-2007-FranceR",
		"phd:Risoldi2010",
		"dblp:SoSyM-2012-VisserDW",
		"Meyers, B., Deshayes, R., Lucio, L., Syriani, E., Wimmer, M., Vangheluwe, H.: The ProMoBox approach to language modelling. Technical Report SOCS-TR-2014.3, School of Computer Science, McGill University (2014)",
		"dblp:DSM-2013-MeyersWVD",
		"bibsleigh:SE/1999/ICSE-1999/ICSE-1999-DwyerAC",
		"dblp:MPM-2009-KuehneMSVW",
		"phd:Syriani2011",
		"Guerra, E., de Lara, J., Kolovos, D.S., Paige, R.F.: A Visual Specification Language for Model-to-Model Transformations. In: VL/HCC (2010)",
		"dblp:ASE-J-2013-GuerraLWKKRSS",
		"Holzmann, G.J.: The Model Checker SPIN. TSE 23, 279–295 (1997)",
		"dblp:MoDELS-Demo-2013-SyrianiVMHME",
		"Lin, Y., Gray, J., Jouault, F.: DSMDiff: A Differentiation Tool for Domain-Specific Models. European Journal of Information Systems 16 (2007)",
		"Cimatti, A., Mover, S., Tonetta, S.: Proving and Explaining the Unfeasibility of Message Sequence Charts for Hybrid Systems. In: FMCAD (2011)",
		"Li, X., Hu, J., Bu, L., Zhao, J., Zheng, G.: Consistency Checking of Concurrent Models for Scenario-Based Specifications. In: Prinz, A., Reed, R., Reed, J. (eds.) SDL 2005. LNCS, vol. 3530, pp. 298–312. Springer, Heidelberg (2005)",
		"Pelliccione, P., Inverardi, P., Muccini, H.: CHARMY: A Framework for Designing and Veri-fying Architectural Specifications. TSE 35, 325–346 (2008)",
		"bibsleigh:TEST/2012/TAP-2012/TAP-2012-BroschEGKSTWW",
		"dblp:CSDUML-2006-KnappW",
		"Schäfer, T., Knapp, A., Merz, S.: Model Checking UML State Machines and Collaborations. ENTCS 55, 357–369 (2001)",
		"bibsleigh:SLE/2008/SLE-2008/SLE-2008-RiveraGLV",
		"Gabmeyer, S.,Kaufmann, P.,Seidl,M.: A classificationof model checking-based verification approaches for software models. In: VOLT (2013)",
		"Ziemann, P., Gogolla, M.: OCL Extended with Temporal Logic. In: Broy, M., Zamulin, A.V. (eds.) PSI 2003. LNCS, vol. 2890, pp. 351–357. Springer, Heidelberg (2004)",
		"bibsleigh:SLE/2012/SLE-2012/SLE-2012-KansoT",
		"Bill, R., Gabmeyer, S., Kaufmann, P., Seidl, M.: OCL meets CTL: Towards CTL-Extended OCL Model Checking. In: OCL Workshop (2013)",
		"Zalila, F., Crégut, X., Pantel, M.: Leveraging Formal Verification Tools for DSML Users: A Process Modeling Case Study. In: Margaria, T., Steffen, B. (eds.) ISoLA 2012, Part II. LNCS, vol. 7610, pp. 329–343. Springer, Heidelberg (2012)",
		"Combemale, B., Crégut, X., Pantel, M.: A Design Pattern to Build Executable DSMLs and Associated V&V Tools. In: APSEC (2012)",
		"bibsleigh:ETAPS/2007/FASE-2007/FASE-2007-KleinG",
		"Fischer, T., Niere, J., Torunski, L., Zündorf, A.: Story Diagrams: A New Graph Rewrite Language Based on the Unified Modeling Language and Java. In: Ehrig, H., Engels, G., Kreowski, H.-J., Rozenberg, G. (eds.) TAGT 1998. LNCS, vol. 1764, pp. 296–309. Springer, Heidelberg (2000)",
		"da Costa Cavalheiro, S.A., Foss, L., Ribeiro, L.: Specification Patterns for Properties over Reachable States of Graph Grammars. In: Gheyi, R., Naumann, D. (eds.) SBMF 2012. LNCS, vol. 7498, pp. 83–98. Springer, Heidelberg (2012)",
		"Deshayes, R., Palanque, P.A., Mens, T.: A generic framework for executable gestural inter- action models. In: VL/HCC (2013)"
	],
	"present": [
		"Fixed: [2] was stated as ICSE, actually FOSE.",
		"Fixed: [8] was stated as MoDELS, actually MPM.",
		"Fixed: [19] was stated as MoDELS, actually CSDUML."
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": [
		"pro",
		"mo",
		"box",
		"a",
		"framework",
		"for",
		"generat",
		"domain",
		"specif",
		"properti",
		"languag"
	],
	"tag": [
		"framework",
		"generative",
		"named"
	],
	"title": "ProMoBox: A Framework for Generating Domain-Specific Property Languages",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 8706,
	"year": 2014
}