{
	"author": ["Mathieu Acher", "Philippe Collet", "Philippe Lahire", "Robert B. France"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/AcherCLF09",
	"doi": "10.1007/978-3-642-12107-4_6",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_6",
	"isbn": "978-3-642-12106-7",
	"pages": "62-81",
	"past": [
		"1. Clements, P., Northrop, L.M.: Software Product Lines: Practices and Patterns. Addison-Wesley Professional, Reading (2001)",
		"2. Pohl, K., Böckle, G., van der Linden, F.J.: Software Product Line Engineering: Foundations, Principles and Techniques. Springer, Heidelberg (2005)",
		"3. Kang, K., Cohen, S., Hess, J., Novak, W., Peterson, S.: Feature-Oriented Domain Analysis (FODA) Feasibility Study. Technical Report CMU/SEI-90-TR-21, Soft- ware Engineering Institute (November 1990)",
		"4. Czarnecki, K., Eisenecker, U.: Generative Programming: Methods, Tools, and Ap- plications. Addison-Wesley Professional, Reading (2000)",
		"5. Czarnecki, K., Antkiewicz, M.: Mapping features to models: A template approach based on superimposed variants. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 422–437. Springer, Heidelberg (2005)",
		"6. Sanchez, P., Loughran, N., Fuentes, L., Garcia, A.: Engineering languages for spec- ifying Product-Derivation processes in software product lines. In: Software Lan- guage Engineering (SLE), pp. 188–207 (2008)",
		"7. Voelter, M., Groher, I.: Product line implementation using aspect-oriented and model-driven software development. In: SPLC 2007: Proceedings of the 11th In- ternational Software Product Line Conference, pp. 233–242. IEEE, Los Alamitos (2007)",
		"8. Batory, D., Benavides, D., Ruiz-Cortés, A.: Automated analysis of feature models: Challenges ahead. Communications of the ACM (December 2006)",
		"9. Mendonca, M., Wasowski, A., Czarnecki, K., Cowan, D.: Efficient compilation tech- niques for large scale feature models. In: GPCE 2008: Proceedings of the 7th inter- national conference on Generative programming and component engineering, pp. 13–22. ACM, New York (2008)",
		"10. Reiser, M.O., Weber, M.: Multi-level feature trees: A pragmatic approach to man- aging highly complex product families. Requir. Eng. 12(2), 57–75 (2007)",
		"11. Czarnecki, K., Helsen, S., Eisenecker, U.: Staged Configuration through Specializa- tion and Multilevel Configuration of Feature Models. Software Process: Improve- ment and Practice 10(2), 143–169 (2005)",
		"12. Hartmann, H., Trew, T.: Using feature diagrams with context variability to model multiple product lines for software supply chains. In: SPLC 2008: Proceedings of the 2008 12th International Software Product Line Conference, pp. 12–21. IEEE, Los Alamitos (2008)",
		"13. Alves, V., Gheyi, R., Massoni, T., Kulesza, U., Borba, P., Lucena, C.: Refactoring product lines. In: GPCE 2006: Proceedings of the 5th international conference on Generative programming and component engineering, pp. 201–210. ACM, New York (2006)",
		"14. Thüm, T., Batory, D., Kästner, C.: Reasoning about edits to feature models. In: Proceedings of the 31th International Conference on Software Engineering (ICSE 2009). IEEE Computer Society, Los Alamitos (2009) Composing Feature Models 81",
		"15. Segura, S., Benavides, D., Ruiz-Cortés, A., Trinidad, P.: Automated merging of feature models using graph transformations. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) Generative and Transformational Techniques in Software Engineering II. LNCS, vol. 5235, pp. 489–505. Springer, Heidelberg (2008)",
		"16. Lahire, P., Morin, B., Vanwormhoudt, G., Gaignard, A., Barais, O., Jézéquel, J.M.: Introducing Variability into Aspect-Oriented Modeling Approaches. In: Engels, G., Opdyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 498–513. Springer, Heidelberg (2007)",
		"17. Classen, A., Heymans, P., Schobbens, P.: What’s in a Feature: A Requirements Engineering Perspective. In: Fiadeiro, J.L., Inverardi, P. (eds.) FASE 2008. LNCS, vol. 4961, pp. 16–30. Springer, Heidelberg (2008)",
		"18. Czarnecki, K., Kim, C.H.P., Kalleberg, K.T.: Feature models are views on ontolo- gies. In: SPLC 2006: Proceedings of the 10th International on Software Product Line Conference, pp. 41–51. IEEE Computer Society, Los Alamitos (2006)",
		"19. Schobbens, P.Y., Heymans, P., Trigaux, J.C., Bontemps, Y.: Generic semantics of feature diagrams. Comput. Netw. 51(2), 456–479 (2007)",
		"20. Aspect-Oriented Modeling Workshop Series, http://www.aspect-modeling.org/",
		"21. Gheyi, R., Massoni, T., Borba, P.: A theory for feature models in alloy. In: Pro- ceedings of First Alloy Workshop, pp. 71–80 (2006)",
		"22. Czarnecki, K., Wasowski, A.: Feature diagrams and logics: There and back again. In: SPLC 2007: Proceedings of the 11th International Software Product Line Con- ference, pp. 23–34 (2007)",
		"23. Apel, S., Lengauer, C., Möller, B., Kästner, C.: An algebra for features and feature composition. In: Meseguer, J., Roşu, G. (eds.) AMAST 2008. LNCS, vol. 5140, pp. 36–50. Springer, Heidelberg (2008)",
		"24. Perrouin, G., Klein, J., Guelfi, N., Jézéquel, J.M.: Reconciling automation and flexibility in product derivation. In: SPLC 2008: Proceedings of the 2008 12th International Software Product Line Conference, pp. 339–348. IEEE, Los Alamitos (2008)",
		"25. Jayaraman, P.K., Whittle, J., Elkhodary, A.M., Gomaa, H.: Model composition in product lines and feature interaction detection using critical pair analysis. In: Engels, G., Opdyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 151–165. Springer, Heidelberg (2007)",
		"26. Reddy, Y.R., Ghosh, S., France, R.B., Straw, G., Bieman, J.M., McEachen, N., Song, E., Georg, G.: Directives for composing aspect-oriented design class models. In: Rashid, A., Aksit, M. (eds.) Transactions on Aspect-Oriented Software Devel- opment I. LNCS, vol. 3880, pp. 75–105. Springer, Heidelberg (2006)",
		"27. Kienzle, J., Al Abed, W., Jacques, K.: Aspect-oriented multi-view modeling. In: AOSD 2009: Proceedings of the 8th ACM international conference on Aspectori- ented software development, pp. 87–98. ACM, New York (2009)",
		"28. Acher, M., Collet, P., Lahire, P.: Issues in Managing Variability of Medical Imaging Grid Services. In: Olabarriaga, S., Lingrand, D., Montagnat, J. (eds.) MICCAI- Grid Workshop (MICCAI-Grid), New York, NY, USA (September 2008)",
		"29. Acher, M., Collet, P., Lahire, P., Montagnat, J.: Imaging Services on the Grid as a Product Line: Requirements and Architecture. In: Service-Oriented Architectures and Software Product Lines - Putting Both Together (SOAPL 2008), associated workshop issue of SPLC 2008. IEEE, Los Alamitos (2008)",
		"30. Acher, M., Lahire, P., Moisan, S., Rigault, J.P.: Tackling High Variability in Video Surveillance Systems through a Model Transformation Approach. In: MiSE 2009: Proceedings of the International Workshop on Modeling in Software Engineering at ICSE 2009, Vancouver, Canada. IEEE Computer Society, Los Alamitos (2009)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["compos", "featur", "model"],
	"tag": ["feature model", "modelling"],
	"title": "Composing Feature Models",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}