{
	"author": ["Steffen Zschaler", "Pablo Sánchez", "João Pedro Santos", "Mauricio Alférez", "Awais Rashid", "Lidia Fuentes", "Ana M. D. Moreira", "João Araújo", "Uirá Kulesza"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/ZschalerSSARFMAK09",
	"doi": "10.1007/978-3-642-12107-4_7",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_7",
	"isbn": "978-3-642-12106-7",
	"pages": "82-102",
	"past": [
		"[1] Pohl, K., et al.: Software Product Line Engineering: Foundations, Principles and Tech- niques. Springer, Berlin (2005)",
		"[2] Clements, P., Northrop, L.M.: Software Product Lines: Practices and Patterns. Addison- Wesley, Boston (2002)",
		"[3] Czarnecki, K., Eisenecker, U.W.: Generative Programming: Methods, Tools, and Appli- cations. ACM Press/Addison-Wesley Publishing Co. (2000)",
		"[4] Kang, K., et al.: Feature-Oriented Domain Analysis (FODA) Feasibility Study. Software Engineering Institute, Technical report, CMU/SEI-90-TR-0211990",
		"[5] Alférez, M., et al.: A Model-Driven Approach for Software Product Lines Requirements Engineering. In: Proceedings of the 20th International Conference on Software Engineer- ing and Knowledge Engineering, San Francisco Bay, USA, July 2008, pp. 779–784 (2008)",
		"[6] Czarnecki, K., Antkiewicz, M.: Mapping Features to Models: A Template Approach Based on Superimposed Variants. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 422–437. Springer, Heidelberg (2005)",
		"[7] Heidenreich, F., et al.: FeatureMapper: mapping features to models. Presented at the Companion of the 30th international conference on Software engineering, Leipzig, Ger- many (2008)",
		"[8] Batory, D., Azanza, M., Saraiva, J.: The Objects and Arrows of Computational Design. In: Czarnecki, K., Ober, I., Bruel, J.-M., Uhl, A., Völter, M. (eds.) MODELS 2008. LNCS, vol. 5301, pp. 1–20. Springer, Heidelberg (2008)",
		"[9] Soares, S., et al.: Supporting software product lines development: FLiP - product line derivation tool. Presented at the Companion to the 23rd ACM SIGPLAN conference on Object-oriented programming systems languages and applications, Nashville, TN, USA (2008)",
		"[10] Ziadi, T., Jézéquel, J.M.: Software Product Line Engineering with the UML: Deriving Products. In: Software Product Lines 2006, pp. 557–588 (2006)",
		"[11] Botterweck, G., et al.: Model-Driven Derivation of Product Architectures. In: Proceed- ings of the 22nd International Conference on Automated Software Engineering (ASE), Atlanta, Georgia, USA, November 2007, pp. 469–472 (2007)",
		"[12] Sánchez, P., et al.: Engineering Languages for Specifying Product-Derivation Processes in Software Product Lines. Presented at the Software Language Engineering 2008, Tou- louse, France (2008)",
		"[13] Loughran, N., Sánchez, P., Garcia, A., Fuentes, L.: Language Support for Managing Variability in Architectural Models. In: Pautasso, C., Tanter, É. (eds.) SC 2008. LNCS, vol. 4954, pp. 36–51. Springer, Heidelberg (2008)",
		"[14] Voelter, M., Groher, I.: Product Line Implementation using Aspect-Oriented and Model- Driven Software Development. In: Procceedings of the 11th International Software Prod- uct Line Conference (SPLC), Kyoto, Japan, September 2007, pp. 233–242 (2007)",
		"[15] Czarnecki, K., Eisenecker, U.W.: Generative Programming: Methods, Tools, and Appli- cations. Addison-Wesley, Reading (2000) VML* – A Family of Languages for Variability Management in Software Product Lines  101",
		"[16] Jayaraman, P., Whittle, J., Elkhodary, A.M., Gomaa, H.: Model Composition in Product Lines and Feature Interaction Detection Using Critical Pair Analysis. In: Engels, G., Op- dyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 151–165. Springer, Heidelberg (2007)",
		"[17] Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"[18] OpenArchitectureWare, http://www.openarchitectureware.org/",
		"[19] Taentzer, G.: AGG: A Graph Transformation Environment for Modeling and Validation of Software. In: Pfaltz, J.L., Nagl, M., Böhlen, B. (eds.) AGTIVE 2003. LNCS, vol. 3062, pp. 446–453. Springer, Heidelberg (2004)",
		"[20] Czarnecki, K., Helsen, S., Eisenecker, U.W.: Staged Configuration Using Feature Mod- els. In: Nord, R.L. (ed.) SPLC 2004. LNCS, vol. 3154, pp. 266–283. Springer, Heidelberg (2004)",
		"[21] Volter, M., Stahl, T.: Model-Driven Software Development. Wiley, Glasgow (2006)",
		"[22] VML* Download, http://www.steffen-zschaler.de/publications/vmlstar/",
		"[23] Alférez, M., et al.: A Metamodel for Aspectual Requirements Modelling and Composi- tion, AMPLE D1.3 (2007), http://ample.holos.pt/gest_cnt_upload/editor/File/public/ AMPLE_WP1_D13.pdf",
		"[24] Alférez, M., et al.: Multi-View Composition Language for Software Product Line Re- quirements. In: Proceedings of the 2nd Int. Conference on Software Language Engineer- ing (SLE), Denver, USA (2009)",
		"[25] Sousa, A.: AMPLE Traceability Framework Frontend Manual (2008), http://ample.di.fct.unl.pt/Front-End_Framework/ ATF%20Front-end%20Manual.pdf",
		"[26] Generative Software Development Group, U. Waterloo, Feature Modelling Plugin (FMP) for Eclipse, http://gsd.uwaterloo.ca/projects/fmp-plugin/",
		"[27] VML* Download (2009)",
		"[28] Kotonya, G., Sommerville, I.: Requirements Engineering: Processes and Techniques. John Wiley, Chichester (1998)",
		"[29] Ian, S., Pete, S.: Requirements Engineering: A Good Practice Guide. John Wiley and Sons, Chichester (1997)",
		"[30] Young, T.: Using AspectJ to Build a Software Product Line for Mobile Devices. Univer- sity of Waterloo (2005), http://www.cs.ubc.ca/grads/resources/thesis/Nov05/ Trevor_Young.pdf",
		"[31] Voelter, M.: A Family of Languages for Architecture Description. Presented at the Con- ference on Object-Oriented Programming, Systems, Languages, Orlando, Florida (2008)",
		"[32] Akehurst, D.H., et al.: Supporting OCL as part of a Family of Languages. In: Proceedings of the MoDELS 2005 Conference Workshop on Tool Support for OCL and Related For- malisms - Needs and Trends (2005)",
		"[33] Visser, E.: WebDSL: A Case Study in Domain-Specific Language Engineering. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) Generative and Transformational Techniques in Software Engineering II. LNCS, vol. 5235, pp. 291–373. Springer, Heidelberg (2008)",
		"[34] Haugen, Ø., et al.: Adding Standardized Variability to Domain Specific Languages. In: Proceedings of the Conference on Software Product Lines (SPLC 2008), pp. 139–148 (2008) 102  S. Zschaler et al.",
		"[35] Batory, D., et al.: Scaling Step-Wise Refinement. IEEE Transactions on Software Engi- neering, 355–371 (2003)",
		"[36] Fuentes, L., et al.: Feature-Oriented Model-Driven Software Product Lines: The TENTE approach. In: Proceedings of the Forum of the 21st International Conference on Ad- vanced Information Systems (CAiSE), Amsterdam, The Netherlands (2009)",
		"[37] Thaker, S., et al.: Safe Composition of Product Lines. In: Proceedings of the 6th Interna- tional Conference on Generative Programming and Component Engineering (GPCE), Salzburg, Austria, pp. 95–104 (2007)",
		"[38] Janota, M., Botterweck, G.: Formal Approach to Integrating Feature and Architecture Models. In: Fiadeiro, J.L., Inverardi, P. (eds.) FASE 2008. LNCS, vol. 4961, pp. 31–45. Springer, Heidelberg (2008)",
		"[39] MOFScript, http://www.eclipse.org/gmt/mofscript/"
	],
	"present": [
		"keyword:Software Product Lines",
		"keyword:Family of Languages",
		"keyword:Domain-specific Languages",
		"keyword:Variability Management"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["vml", "a", "famili", "of", "languag", "for", "variabl", "manag", "in", "softwar", "product", "line"],
	"tag": ["product line", "variability"],
	"title": "VML* — A Family of Languages for Variability Management in Software Product Lines",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}