{
	"author": ["Thiago Tonelli Bartolomei", "Krzysztof Czarnecki", "Ralf Lämmel", "Tijs van der Storm"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/BartolomeiCLS09",
	"doi": "10.1007/978-3-642-12107-4_5",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_5",
	"isbn": "978-3-642-12106-7",
	"pages": "42-61",
	"past": [
		"[Amb06] Ambler, S.W.: The Object-Relational Impedance Mismatch (2006), http://www.agiledata.org/essays/impedanceMismatch.html",
		"[BCPS05] Bruno, M., Canfora, G., Di Penta, M., Scognamiglio, R.: An Approach to support Web Service Classification and Annotation. In: 2005 IEEE International Confer- ence on e-Technology, e-Commerce, and e-Services (EEE 2005), Proceedings, pp. 138–143. IEEE Computer Society, Los Alamitos (2005)",
		"[BDH + 09] Brunel, J., Doligez, D., Hansen, R.R., Lawall, J.L., Muller, G.: A foundation for flow-based program matching: using temporal logic and model checking. In: Pro- ceedings of the 36th ACM SIGPLAN-SIGACT Symposium on Principles of Pro- gramming Languages, POPL 2009, pp. 114–126. ACM, New York (2009)",
		"[BGGN08] Brühlmann, A., Gˆ ırba, T., Greevy, O., Nierstrasz, O.: Enriching Reverse Engineer- ing with Annotations. In: Czarnecki, K., Ober, I., Bruel, J.-M., Uhl, A., Völter, M. (eds.) MODELS2008. LNCS,vol. 5301, pp. 660–674. Springer, Heidelberg (2008) Study of an API Migration for Two XML APIs 61",
		"[BTF05] Balaban, I., Tip, F., Fuhrer, R.: Refactoring support for class library migration. In: OOPSLA 2005: Proceedings of the 20th annual ACM SIGPLAN conference on Object oriented programming, systems, languages, and applications, pp. 265–279. ACM, New York (2005)",
		"[CFFT08] Canfora, G., Fasolino, A.R., Frattolillo, G., Tramontana, P.: A wrapping approach for migrating legacy system interactive functionalities to Service Oriented Archi- tectures. Journal of Systems and Software 81(4), 463–480 (2008)",
		"[CN96] Chow, K., Notkin, D.: Semi-automatic update of applications in response to library changes. In: ICSM 1996: Proceedings of the 1996 International Conference on Software Maintenance, p. 359. IEEE Computer Society, Los Alamitos (1996)",
		"[DNMJ08] Dig, D., Negara, S., Mohindra, V., Johnson, R.: Reba: refactoring-aware binary adaptation of evolving libraries. In: ICSE 2008: Proceedings of the 30th Interna- tional Conference on Software Engineering, pp. 441–450. ACM, New York (2008)",
		"[HD05] Henkel, J., Diwan, A.: CatchUp!: capturing and replaying refactorings to support API evolution. In: ICSE 2005: Proceedings of the 27th International Conference on Software Engineering, pp. 274–283. ACM, New York (2005)",
		"[KH98] Keller, R., Hölzle, U.: Binary component adaptation. In: Jul, E. (ed.) ECOOP 1998. LNCS, vol. 1445, pp. 307–329. Springer, Heidelberg (1998)",
		"[KLV05] Klusener, A.S., Lämmel, R., Verhoef, C.: Architectural modifications to deployed software. Science of Computer Programming 54(2-3), 143–211 (2005)",
		"[LM07] Lämmel, R., Meijer, E.: Revealing the X/O impedance mismatch (Changing lead into gold). In: Backhouse, R., Gibbons, J., Hinze, R., Jeuring, J. (eds.) SSDGP 2006. LNCS, vol. 4719, pp. 285–367. Springer, Heidelberg (2007)",
		"[Per05] Perkins, J.H.: Automatically generating refactorings to support API evolution. In: PASTE2005: Proceedings of the6thACMSIGPLAN-SIGSOFTworkshop onPro- gram Analysis for Software Tools and Engineering, pp. 111–114. ACM, New York (2005)",
		"[PLHM08] Padioleau, Y.,Lawall,J.L.,Hansen, R.R.,Muller, G.:Documenting and automating collateral evolutions in linux device drivers. In: Proceedings of the 2008 EuroSys Conference, pp. 247–260. ACM, New York (2008)",
		"[RJ08] Ratiu, D., Juerjens, J.: Evaluating the Reference and Representation of Domain Concepts in APIs. In: 16th International Conference on Program Comprehension (ICPC 2008), pp. 242–247. IEEE Computer Society, Los Alamitos (2008)",
		"[SM98] Sneed, H.M., Majnar, R.: A case study in software wrapping. In: International Con- ference on Software Maintenance (ICSM 1998), Proceedings, pp. 86–93. IEEE Computer Society, Los Alamitos (1998)",
		"[S¸RGA08] S¸avga, I., Rudolf, M., Götz, S., Aßmann, U.: Practical refactoring-based frame- work upgrade. In: GPCE 2008: Proceedings of the 7th international conference on Generative Programming and Component Engineering, pp. 171–180. ACM, New York (2008)",
		"[TDX07] Taneja, K., Dig, D., Xie, T.: Automated detection of API refactorings in libraries. In: ASE 2007: Proceedings of the twenty-second IEEE/ACM international confer- ence on Automated Software Engineering, pp. 377–380. ACM, New York (2007)",
		"[Tho03] Thomas, D.: The Impedance Imperative: Tuples + Objects + Infosets = Too Much Stuff! Journal of Object Technology 2(5), 7–12 (2003)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["studi", "of", "an", "api", "migrat", "for", "two", "xml", "api"],
	"tag": ["api", "migration", "xml"],
	"title": "Study of an API Migration for Two XML APIs",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}