{
	"author": ["Maartje de Jonge", "Emma Nilsson-Nyman", "Lennart C. L. Kats", "Eelco Visser"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/JongeNKV09",
	"doi": "10.1007/978-3-642-12107-4_16",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_16",
	"isbn": "978-3-642-12106-7",
	"pages": "204-223",
	"past": [
		"1. The permissive grammars project, http://strategoxt.org/Stratego/PermissiveGrammars",
		"2. Aho, A., Peterson, T.G.: A minimum distance error-correcting parser for context-free lan- guages. SIAM Journal on Computing 1, 305 (1972)",
		"3. Bravenboer, M., Tanter, E., Visser, E.: Declarative, formal, and extensible syntax definition for AspectJ. A case for scannerless generalized-LR parsing. In: Cook, W.R. (ed.) OOPSLA 2006, pp. 209–228. ACM Press, New York (2006)",
		"4. Burke, M.G., Fisher, G.A.: A practical method for LR and LL syntactic error diagnosis and recovery. ACM Trans. Program. Lang. Syst. 9(2), 164–197 (1987)",
		"5. Charles, P.: A practical method for constructing efficient LALR(K) parsers with automatic error recovery. PhD thesis, New York University (1991)",
		"6. Charles, P., Fuhrer, R.M., Sutton Jr., S.M.: IMP: a meta-tooling platform for creating language-specific IDEs in Eclipse. In: Stirewalt, R.E.K., Egyed, A., Fischer, B. (eds.) Au- tomated Software Engineering (ASE 2007), pp. 485–488. ACM, New York (2007)",
		"7. Degano, P., Priami, C.: Comparison of syntactic error handling in LR parsers. Software – Practice and Experience 25(6), 657–679 (1995)",
		"8. Efftinge, S., et al.: openArchitectureWare User Guide. Version 4.3 (2008), http://openarchitectureware.org/pub/documentation/",
		"9. Ford,B.:Packrat parsing: Simple,powerful, lazy, linear time.In: International Conference on Functional Programming (ICFP 2002). SIGPLAN Notices, vol. 37, pp. 36–47. ACM, New York (2002)",
		"10. Graham, S.L.,Haley, C.B., Joy, W.N.: Practical LR error recovery. In: SIGPLAN1979: Sym- posium on Compiler Construction, pp. 168–175. ACM, New York (1979)",
		"11. Kalleberg, K.T., et al.: JSGLR, http://www.spoofax.org/ Natural and Flexible Error Recovery for Generated Parsers 223",
		"12. Kats, L.C.L., de Jonge, M., Nilsson-Nyman, E., Visser, E.: Providing rapid feedback in gen- erated modular language environments. Adding error recovery to scannerless generalized- LR parsing. In: Leavens, G.T. (ed.) Proceedings of the 24th ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA 2009). ACM SIGPLAN Notices, vol. 44, pp. 445–464. ACM Press, New York (2009)",
		"13. Kats, L.C.L., Kalleberg, K.T., Visser, E.: Domain-specific languages for composable edi- tor plugins. In: Ekman, T., Vinju, J. (eds.) Language Descriptions, Tools, and Applications (LDTA 2009). ENTCS. Elsevier Science Publishers, Amsterdam (2009)",
		"14. Krahn, H., Rumpe, B., Völkel, S.: MontiCore: Modular development of textual domain spe- cific languages. In: Paige, R., Meyer, B. (eds.) TOOLS EUROPE 2008. LNBIP, vol. 11, pp. 297–315. Springer, Heidelberg (2008)",
		"15. Kuhn, T., Thomann, O.: Eclipse corner: Abstract syntax tree (2006), http://eclipse.org/articles/ article.php?file ¯ Article-JavaCodeManipulationAST/index.html",
		"16. Lévy, J.-P.: Automatic Correction of Syntax Errors in Programming Languages. PhD thesis, Ithaca, NY, USA (1971)",
		"17. Lyon, G.: Syntax-directed least-errors analysis for context-free languages: a practical ap- proach. Commun. ACM 17(1), 3–14 (1974)",
		"18. Mauney, J., Fischer, C.: Determining the extent of lookahead in syntactic error repair. ACM Trans. Program. Lang. Syst. (TOPLAS) 10(3), 456–469 (1988)",
		"19. Moonen, L.: Generating robust parsers using island grammars. In: Working Conference on Reverse Engineering (WCRE 2001), pp. 13–22. IEEE, Los Alamitos (2001)",
		"20. Nilsson-Nyman, E., Ekman, T., Hedin, G.: Practical scope recovery using bridge parsing. In: Gaˇ sevi´ c, D., Lämmel, R., Van Wyk, E. (eds.) SLE 2008. LNCS, vol. 5452, pp. 95–113. Springer, Heidelberg (2009)",
		"21. Pai,A.,Kieburtz,R.:Global Context Recovery: A NewStrategyforSyntacticErrorRecovery by Table-Drive Parsers. ACM Trans. Program. Lang. Syst. (TOPLAS) 2(1), 18–41 (1980)",
		"22. Pennello, T.J., DeRemer, F.: A forward move algorithm for LR error recovery. In: Principles of programming languages (POPL 1978), pp. 241–254. ACM, New York (1978)",
		"23. Rekers, J., Koorn, W.: Substring parsing for arbitrary context-free grammars. SIGPLAN Not. 26(5), 59–66 (1991)",
		"24. Salomon, D., Cormack, G.: The disambiguation and scannerless parsing of complete character-level grammars for programming languages. Technical report, TR 95/06, Dept. of Comp. Sci., University of Manitoba, Winnipeg, Canada (1995)",
		"25. Swierstra, S.D., Duponcheel, L.: Deterministic, error-correcting combinator parsers. In: Launchbury, J., Sheard, T., Meijer, E. (eds.) AFP 1996. LNCS, vol. 1129, pp. 184–207. Springer, Heidelberg (1996)",
		"26. Valkering, R.: Syntax error handling in scannerless generalized LR parsers. Master’s thesis, University of Amsterdam (August 2007)",
		"27. van den Brand, M.G.J., Bruntink, M., Economopoulos, G.R., de Jong, H.A., Klint, P., Kooiker, T., van der Storm, T., Vinju, J.J.: Using the Meta-Environment for maintenance and renovation. In: European Conference on Software Maintenance and Reengineering (CSMR 2007), pp. 331–332. IEEE, Los Alamitos (2007)",
		"28. van Deursen, A., Kuipers, T.: Building documentation generators. In: IEEE International Conference on Software Maintenance (ICSM 1999), p. 40. IEEE Computer Society, Los Alamitos (1999)",
		"29. Visser, E.: Syntax Definition for Language Prototyping. PhD thesis, University of Amster- dam (September 1997)",
		"30. Visser, E.: Meta-programming with concrete object syntax. In: Batory, D., Consel, C., Taha, W. (eds.) GPCE 2002. LNCS, vol. 2487, pp. 299–315. Springer, Heidelberg (2002)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["natur", "and", "flexibl", "error", "recoveri", "for", "generat", "parser"],
	"tag": ["fault", "flexibility", "parsing"],
	"title": "Natural and Flexible Error Recovery for Generated Parsers",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}