{
	"author": ["Danny M. Groenewegen", "Eelco Visser"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/GroenewegenV09",
	"doi": "10.1007/978-3-642-12107-4_13",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_13",
	"isbn": "978-3-642-12106-7",
	"pages": "164-173",
	"past": [
		"1. Boyer, J.M. (ed.): XForms 1.0, 3rd edn. W3C Recommendation (2007)",
		"2. Brambilla, M., Comai, S., Fraternali, P., Matera, M.: Designing web applications with WebML and WebRatio. In: Web Engineering: Modelling and Implementing Web Applica- tions, pp. 221–260 (2007)",
		"3. Brown, D., Davis, C., Stanlick, S. (eds.): Struts 2 in Action. Manning Publ. Co. (2008)",
		"4. Ceri, S., Fraternali,P., Bongio, A.: Web Modeling Language (WebML): a modeling language for designing Web sites. Computer Networks 33(1-6), 137–157 (2000)",
		"5. Frasincar, F., Houben, G., Barna, P.: HPG: the Hera Presentation Generator. Journal of Web Engineering 5(2), 175 (2006)",
		"6. Groenewegen, D.M., Visser, E.: Declarative access control for WebDSL: Combining lan- guage integration and separation of concerns. In: Schwabe, D., Curbera, F. (eds.) Interna- tional Conference on Web Engineering (ICWE 2008), July 2008, pp. 175–188 (2008)",
		"7. Hemel, Z., Verhaaf, R., Visser, E.: WebWorkFlow: An object-oriented workflow modeling language for web applications. In: Czarnecki, K., Ober, I., Bruel, J.-M., Uhl, A., Völter, M. (eds.) MODELS 2008. LNCS, vol. 5301, pp. 113–127. Springer, Heidelberg (2008)",
		"8. Järvi, J., Marcus, M., Parent, S., Freeman, J., Smith, J.N.: Property models: from incidental algorithms to reusable components. In: GPCE, pp. 89–98 (2008)",
		"9. Kittoli, S. (ed.): Seam - Contextual Components. A Framework for Enterprise Java. Red Hat Middleware, LLC (2008)",
		"10. Koch, N., Kraus, A., Hennicker, R.: The authoring process of the UML-based web engineer- ing approach. In: Web-Oriented Software Technology (2001)",
		"11. Kraus, A., Knapp, A., Koch, N.: Model-driven generation of web applications in UWE. In: Model-Driven Web Engineering (MDWE 2007), Como, Italy (July 2007)",
		"12. Lima, F., Schwabe, D.: Application modeling for the semantic web. In: Latin American- Web Congress (LA-WEB 2003), Washington, DC, USA, p. 93. IEEE Computer Society, Los Alamitos (2003)",
		"13. MacDonald, M., Szpuszta, M.: Pro ASP. NET 3.5 in C# 2008. Apress (2007)",
		"14. Nunes, D., Schwabe, D.: Rapid prototyping of web applications combining domain spe- cific languages and model driven design. In: International Conference on Web Engineering (ICWE 2006), pp. 153–160 (2006)",
		"15. Pastor, O., Fons, J., Pelechano, V.: OOWS: A method to develop web applications from web- oriented conceptual models. In: Web Oriented Software Technology (IWWOST 2003), pp. 65–70 (2003)",
		"16. Ruby, S., Thomas, D., Heinemeier Hansson, D.: Agile Web Development with Rails, 3rd edn. Pragmatic Programmers (2009)",
		"17. Scaffidi, C., Myers, B.A., Shaw, M.: Topes: reusable abstractions for validating data. In: ICSE 2008, pp. 1–10 (2008)",
		"18. Schwabe, D., Rossi, G., Barbosa, S.: Systematic hypermedia application design with OOHDM. In: Proceedings of the the seventh ACM conference on Hypertext, pp. 116–128. ACM, New York (1996)",
		"19. vander Sluijs,K.,Houben, G.,Broekstra, J.,Casteleyn, S.:Hera-S:webdesign usingsesame. In: International Conference on Web Engineering (ICWE 2006), pp. 337–344 (2006)",
		"20. Vdovjak, R., Frasincar, F., Houben, G., Barna, P.: Engineering semantic web information systems in Hera. Journal of Web Engineering 2, 3–26 (2003)",
		"21. Visser, E.: WebDSL: A case study in domain-specific language engineering. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) Generative and Transformational Techniques in Software Engineering II. LNCS, vol. 5235, pp. 291–373. Springer, Heidelberg (2008)",
		"22. Visser, E., et al.: WebDSL, 2007–2009, http://webdsl.org"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["integr", "of", "data", "valid", "and", "user", "interfac", "concern", "in", "a", "dsl", "for", "web", "applic"],
	"tag": ["domain-specific language", "integration", "user interface", "validation", "web"],
	"title": "Integration of Data Validation and User Interface Concerns in a DSL for Web Applications",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}