{
	"author": ["Paul Laird", "Stephen Barrett"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/LairdB09",
	"doi": "10.1007/978-3-642-12107-4_11",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_11",
	"isbn": "978-3-642-12106-7",
	"pages": "144-153",
	"past": [
		"1. Allen, P.: Service orientation: winning strategies and best practices. Cambridge University Press, Cambridge (2006)",
		"2. Arnold, B., van Deursen, A., Res, M.: An algebraic specification of a language describing financial products. In: IEEE Workshop on Formal Methods Application in Software Engineering, pp. 6–13 (1995)",
		"3. Barrett, S.: A software development process. U.S. Patent (2006)",
		"4. Cleenewerck, T.: Component-based DSL development. In: Pfenning, F., Smarag- dakis, Y. (eds.) GPCE 2003. LNCS, vol. 2830, pp. 245–264. Springer, Heidelberg (2003)",
		"5. Irmert, F., Fisher, T., Meyer-Wegener, K.: Runtime adaptation in a service- oriented component model. In: Proceedings of the 2008 international workshop on Software engineering for adaptive and self-managing systems (2008)",
		"6. Kosar, T., L´ opez, P.E.M., Barrientos, P.A., Mernik, M.: A preliminary study on various implementation approaches of domain-specific language. Information and Software Technology 50(5), 390–405 (2008)",
		"7. Laird, P., Dondio, P., Barrett, S.: Dynamic domain specific languages for trust models. In: Proceedings of the 1st IARIA Workshop on Computational Trust for Self-Adaptive Systems (to appear, 2009)",
		"8. Ledeczi, A., Maroti, M., Bakay, A., Karsai, G., Garrett, J., Thomason, C., Nord- strom, G., Sprinkle, J., Volgyesi, P. (eds.): The Generic Modeling Environment, Workshop on Intelligent Signal Processing, Budapest, Hungary (2001)",
		"9. Marinescu, D., Kroger, R.: State of the art in autonomic computing and virtualiza- tion. Technical report, Distributed Systems Lab, Wiesbaden University of Applied Sciences (2007)",
		"10. Markus, M.L., Tanis, C.: The enterprise systems experience–from adoption to suc- cess. Framing the domains of IT research: Glimpsing the future through the past, 173–207 (2000) Towards Dynamic Evolution of Domain Specific Languages 153",
		"11. Mernik, M., Sloane, T., Heering, J.: When and how to develop domain-specific languages. ACM Computing Surveys 37(4), 316–344 (2005)",
		"12. Nakatani, L.H., Ardis, M.A., Olsen, R.G., Pontrelli, P.M.: Jargons for domain engineering. SIGPLAN Not. 35(1), 15–24 (2000)",
		"13. Nakatani, L.H., Jones, M.A.: Jargons and infocentrism. In: First ACM SIGPLAN Workshop on Domain-Specific Languages, pp. 59–74. ACM Press, New York (1997)",
		"14. Papadopoulos, G.A., Arbab, F.: Configuration and dynamic reconfiguration of components using the coordination paradigm. Future Generation Computer Sys- tems 17(8), 1023–1038 (2001)",
		"15. Safa, L.: The practice of deploying dsm report from a japanese appliance maker trenches. In: Gray, J., Tolvanen, J.-P., Sprinkle, J. (eds.) 6th OOPSLA Workshop on Domain-Specific Modeling (2006)",
		"16. SIIA. Software as a service: Strategic backgrounder. Technical report, Software and Information Industry Association (2001)",
		"17. Simonyi, C.: The death of computer languages. Technical report, Microsoft (1995)",
		"18. Simonyi, C., Christerson, M., Clifford, S.: Intentional software. In: Proceedings of the 21st OOPSLA conference. ACM, ACM, New York (2006)",
		"19. Vaquero, L.M., Rodero-Merino, L., Caceres, J., Lindner, M.: A break in the clouds: towards a cloud definition. SIGCOMM Comput. Commun. Rev. 39(1), 50–55 (2009)",
		"20. Voona, S., Venkataratna, R., Hoshing, D.N.: Cloud computing for banks. In: Fina- cle Connect (2009)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["toward", "dynam", "evolut", "of", "domain", "specif", "languag"],
	"tag": ["domain-specific language", "evolution", "towards"],
	"title": "Towards Dynamic Evolution of Domain Specific Languages",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}