{
	"author": ["August Schwerdfeger", "Eric Van Wyk"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/SchwerdfegerW09",
	"doi": "10.1007/978-3-642-12107-4_15",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_15",
	"isbn": "978-3-642-12106-7",
	"pages": "184-203",
	"past": [
		"1. Knuth, D.E.: On the translation of languages from left to right. Information and Control 8(6), 607–639 (1965)",
		"2. Bravenboer, M., Visser, E.: Concrete syntax for objects: domain-specific language embedding and assimilation without restrictions. In: Proc. of OOPSLA 2004 Conf., pp. 365–383 (2004)",
		"3. Van Wyk, E., Bodin, D., Krishnan, L., Gao, J.: Silver: an extensible attribute gram- mar system. Electronic Notes in Theoretical Computer Science (ENTCS) 203(2), 103–116 (2008); Originally in LDTA 2007",
		"4. Van Wyk, E., Krishnan, L., Schwerdfeger, A., Bodin, D.: Attribute grammar-based language extensions for Java. In: Ernst, E. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 575–599. Springer, Heidelberg (2007)",
		"5. Ekman, T., Hedin, G.: The JastAdd extensible Java compiler. In: Proc. of OOP- SLA, pp. 1–18. ACM, New York (2007)",
		"6. Thompson, J.M., Heimdahl, M.P., Miller, S.P.: Specification based prototyping for embedded systems. In: Nierstrasz, O., Lemoine, M. (eds.) ESEC 1999 and ESEC- FSE 1999. LNCS, vol. 1687, p. 163. Springer, Heidelberg (1999)",
		"7. Schwerdfeger, A., Van Wyk, E.: Verifiable composition of deterministic grammars. In: Proc. of ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI). ACM, New York (2009)",
		"8. Van Wyk, E., Schwerdfeger, A.: Context-aware scanning for parsing extensible languages. In: Intl. Conf. on Generative Programming and Component Engineering (GPCE). ACM Press, New York (2007)",
		"9. Bravenboer, M., Visser, E.: Parse table composition - separate compilation and binary extensibility of grammars. In: Gaˇ sevi´ c, D., L¨ ammel, R., Van Wyk, E. (eds.) Software Language Engineering. LNCS, vol. 5452, pp. 74–94. Springer, Heidelberg (2009)",
		"10. Cervelle, J., Forax, R., Roussel, G.: Tatoo: an innovative parser generator. In: Proc. Principles and practice of programming in Java (PPPJ), pp. 13–20. ACM, New York (2006)",
		"11. Wu, X., Bryant, B.R., Gray, J., Mernik, M.: Component-based LR parsing. Com- puter Languages, Systems & Structures 36(1), 16–33 (2010)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["verifi", "pars", "tabl", "composit", "for", "determinist", "pars"],
	"tag": ["composition", "parsing"],
	"title": "Verifiable Parse Table Composition for Deterministic Parsing",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}