{
	"author": ["Frédéric Mallet", "François Lagarde", "Charles André", "Sébastien Gérard", "François Terrier"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/MalletLAGT09",
	"doi": "10.1007/978-3-642-12107-4_22",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_22",
	"isbn": "978-3-642-12106-7",
	"pages": "314-333",
	"past": [
		"1. OMG: Unified Modeling Language, superstructure. OMG document formal/2007- 02-03, Object Management Group (February 2007)",
		"2. Weilkiens, T.: Systems Engineering with SysML/UML: Modeling, Analysis, Design. The MK/OMG Press, Burlington (2008)",
		"3. INCOSE: Systems Modeling Language (SysML) Specification 1.1. Object Manage- ment Group. OMG document number: ptc/08-05-17 (May 2008) 4 http://www.papyrusuml.org/ An Automated Process for Implementing Multilevel Domain Models 333",
		"4. Atkinson, C., Kühne, T.: The Essence of Multilevel Metamodeling. In: Gogolla, M., Kobryn, C. (eds.) UML 2001. LNCS, vol. 2185, pp. 19–33. Springer, Heidelberg (2001)",
		"5. Atkinson, C., Kühne, T.: Reducing accidental complexity in domain models. Soft- ware and System Modeling 7(3), 345–359 (2008)",
		"6. Borning, A.: Classes versus prototypes in object-oriented languages. In: Proc. Of the Fall Joint Computer Conference, pp. 36–40. IEEE Computer Society, Los Alamitos (1986)",
		"7. Lieberman, H.: Using prototypical objects to implement shared behavior in objec- toriented systems. In: OOPLSA 1986: Conference proceedings on Object-oriented programming systems, languages and applications, pp. 214–223. ACM, New York (1986)",
		"8. LaLonde, W.R., Thomas, D.A., Pugh, J.R.: An exemplar based smalltalk. In: OOP- SLA, pp. 322–330 (1986)",
		"9. Kühne, T., Schreiber, D.: Can programming be liberated from the two-level style? _ Multi-level programming with DeepJava. In: OOPSLA 2007: Proc. of the 22nd annual ACM SIGPLAN conf. on Object oriented programming systems and appli- cations, pp. 229–244. ACM, New York (2007)",
		"10. Asikainen, T., Männistö, T.: Nivel: a metamodelling language with a formal se- mantics. Software and System Modeling 8(4), 521–549 (2009)",
		"11. OMG: UML Profile for MARTE, v1.0. Object Management Group. Document number: formal/2009-11-02 (November 2009)",
		"12. Henderson-Sellers, B., Gonzalez-Perez, C.: Connecting powertypes and stereotypes. Journal of Object Technology 4(7), 83–96 (2005)",
		"13. André, C., Mallet, F., de Simone, R.: Modeling time(s). In: Engels, G., Opdyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 559–573. Springer, Heidelberg (2007)",
		"14. Thomas, F., Delatour, J., Terrier, F., Gérard, S.: Towards a framework for explicit platform-based transformations. In: 11th IEEE Int. Symp. on Object-Oriented Real-Time Distributed Computing (ISORC 2008), pp. 211–218. IEEE Computer Society, Los Alamitos (2008)",
		"15. Johnson, R., Woolf, B.: Type Object, vol. 3, pp. 47–65. Addison-Wesley, Reading (1997)",
		"16. Coad, P.: Object-oriented patterns. Communications of the ACM 35(9), 152–159 (1992)",
		"17. Odell, J.: Power Types. SIGS Reference Library, ch. 3, vol. 12. Cambridge Univer- sity Press, Cambridge (1998)",
		"18. Brooks, F.P.: No silver bullet essence and accidents of software engineering. Com- puter 20(4), 10–19 (1987)",
		"19. Lagarde, F., Mallet, F., André, C., Gérard, S., Terrier, F.: Multilevel modeling paradigm in profile definition. Research Report RR-6525, INRIA (April 2008)",
		"20. Fuentes-Fernández, L., Vallecillo-Moreno, A.: An Introduction to UML Profiles. UML and Model Engineering V(2) (April 2004)",
		"21. Selic, B.: A systematic approach to domain-specific language design using UML. In: 10th IEEE Int. Symp. on Object-Oriented Real-Time Distributed Computing (ISORC 2007), pp. 2–9. IEEE Computer Society, Los Alamitos (2007)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["an", "autom", "process", "for", "implement", "multilevel", "domain", "model"],
	"tag": ["automation", "domain model", "implementation", "modelling", "multi", "process"],
	"title": "An Automated Process for Implementing Multilevel Domain Models",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}