{
	"author": ["Markus Herrmannsdörfer", "Daniel Ratiu", "Guido Wachsmuth"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/HerrmannsdoerferRW09",
	"doi": "10.1007/978-3-642-12107-4_3",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_3",
	"isbn": "978-3-642-12106-7",
	"pages": "3-22",
	"past": [
		"1. Favre, J.M.: Languages evolve too! changing the software time scale. In: IWPSE 2005: 8th Int. Workshop on Principles of Software Evolution, pp. 33–44. IEEE, Los Alamitos (2005)",
		"2. Favre, J.M.: Meta-model and model co-evolution within the 3D software space. In: ELISA: Workshop on Evolution of Large-scale Industrial Software Applications, pp. 98–109 (2003)",
		"3. Klint, P., L¨ ammel, R., Verhoef, C.: Toward an engineering discipline for grammar- ware. ACM Trans. Softw. Eng. Methodol. 14(3), 331–380 (2005)",
		"4. B´ ezivin, J., Heckel, R.: Guest editorial to the special issue on language engineering for model-driven software development. Software and Systems Modeling 5(3), 231– 232 (2006)",
		"5. Kurtev, I., B´ ezivin, J., Aksit, M.: Technological spaces: An initial appraisal. In: CoopIS, DOA 2002 Federated Conferences, Industrial track (2002)",
		"6. L¨ ammel, R., Zaytsev, V.: Recovering Grammar Relationships for the Java Lan- guage Specification. In: 9th Int. Working Conference on Source Code Analysis and Manipulation. IEEE, Los Alamitos (2009)",
		"7. L¨ ammel, R., Lohmann, W.: Format Evolution. In: RETIS 2001: 7th Int. Conference on Reverse Engineering for Information Systems. books@ocg.at, OCG, vol. 155, pp. 113–134 (2001)",
		"8. Meyer, B.: Schema evolution: Concepts, terminology, and solutions. IEEE Com- puter 29(10), 119–121 (1996)",
		"9. Flouris, G., Manakanatas, D., Kondylakis, H., Plexousakis, D., Antoniou, G.: On- tology change: Classification and survey. Knowl. Eng. Rev. 23(2), 117–152 (2008)",
		"10. Dig, D., Johnson, R.: How do apis evolve? a story of refactoring: Research articles. J. Softw. Maint. Evol. 18(2), 83–107 (2006)",
		"11. Kleppe, A.G., Warmer, J., Bast, W.: MDA Explained: The Model Driven Archi- tecture: Practice and Promise. Addison-Wesley, Reading (2003)",
		"12. Object Management Group: Meta Object Facility, Core Spec., v2.0 (2006)",
		"13. Object Management Group: Object Constraint Language, Spec., v2.0 (2006)",
		"14. Wachsmuth, G.: Metamodel adaptation and model co-adaptation. In: Ernst, E. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 600–624. Springer, Heidelberg (2007)",
		"15. Herrmannsdoerfer, M., Benz, S., Juergens, E.: COPE - automating coupled evolu- tion of metamodels and models. In: Drossopoulou, S. (ed.) ECOOP 2009. LNCS, vol. 5653, pp. 52–76. Springer, Heidelberg (2009) 22 M. Herrmannsdoerfer, D. Ratiu, and G. Wachsmuth",
		"16. L¨ ammel, R.: Grammar adaptation. In: Oliveira, J.N., Zave, P. (eds.) FME 2001. LNCS, vol. 2021, pp. 550–570. Springer, Heidelberg (2001)",
		"17. Herrmannsdoerfer, M., Benz, S., Juergens, E.: Automatability of coupled evolution of metamodels and models in practice. In: Czarnecki, K., Ober, I., Bruel, J.-M., Uhl, A., V¨ olter, M. (eds.) MODELS 2008. LNCS, vol. 5301, pp. 645–659. Springer, Heidelberg (2008)",
		"18. Lientz, B.P., Swanson, E.B.: Software Maintenance Management. Addison-Wesley, Reading (1980)",
		"19. Herrmannsdoerfer, M.: Operation-based versioning of metamodels with COPE. In: CVSM 2009: Int. Workshop on Comparison and Versioning of Software Models, pp. 49–54. IEEE, Los Alamitos (2009)",
		"20. Fowler, M.: Refactoring: improving the design of existing code. Addison-Wesley, Reading (1999)",
		"21. L¨ ammel, R., Verhoef, C.: Semi-automatic grammar recovery. Softw. Pract. Ex- per. 31(15), 1395–1448 (2001)",
		"22. L¨ ammel, R., Zaytsev, V.: An introduction to grammar convergence. In: Leuschel, M., Wehrheim, H. (eds.) IFM 2009. LNCS, vol. 5423, pp. 246–260. Springer, Hei- delberg (2009)",
		"23. Sprinkle, J.M.: Metamodel driven model migration. PhD thesis, Vanderbilt Uni- versity, Nashville, TN, USA (2003)",
		"24. Sprinkle, J., Karsai, G.: A domain-specific visual language for domain model evo- lution. J. Vis. Lang. Comput. 15(3-4), 291–307 (2004)",
		"25. Becker, S., Goldschmidt, T., Gruschko, B., Koziolek, H.: A process model and classification scheme for semi-automatic meta-model evolution. In: MSI 2007: 1st Workshop MDD, SOA und IT-Management, pp. 35–46. GiTO-Verlag (2007)",
		"26. Gruschko, B., Kolovos, D., Paige, R.: Towards synchronizing models with evolving metamodels. In: Int. Workshop on Model-Driven Software Evolution (2007)",
		"27. Cicchetti, A., Ruscio, D.D., Eramo, R., Pierantonio, A.: Automating co-evolution in model-driven engineering. In: EDOC 2008: 12th Int. IEEE Enterprise Distributed Object Computing Conference, pp. 222–231. IEEE, Los Alamitos (2008)",
		"28. Sprinkle, J., Gray, J., Mernik, M.: Fundamental limitations in domain-specific language evolution (2009), http://www.ece.arizona.edu/∼sprinkjm/wiki/uploads/Publications/ sprinkle-tse2009-domainevolution-submitted.pdf",
		"29. Li, X.: A survey of schema evolution in object-oriented databases. In: TOOLS 1999: 31st Int. Conference on Technology of Object-Oriented Language and Systems, p. 362. IEEE, Los Alamitos (1999)",
		"30. Rahm, E., Bernstein, P.A.: An online bibliography on schema evolution. SIGMOD Rec. 35(4), 30–31 (2006)",
		"31. Banerjee, J., Kim, W., Kim, H.J., Korth, H.F.: Semantics and implementation of schema evolution in object-oriented databases. In: SIGMOD 1987: ACM SIGMOD Int. conference on Management of data, pp. 311–322. ACM, New York (1987)",
		"32. Ferrandina, F., Meyer, T., Zicari, R., Ferran, G., Madec, J.: Schema and database evolution in the O2 object database system. In: VLDB 1995: 21th Int. Conference on Very Large Data Bases, pp. 170–181. Morgan Kaufmann, San Francisco (1995)",
		"33. Claypool, K.T., Jin, J., Rundensteiner, E.A.: SERF: schema evolution through an extensible, re-usable and flexible framework. In: CIKM 1998: 7th Int. Conference on Information and knowledge management, pp. 314–321. ACM, New York (1998)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["languag", "evolut", "in", "practic", "the", "histori", "of", "gmf"],
	"tag": ["evolution"],
	"title": "Language Evolution in Practice: The History of GMF",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}