{
	"author": ["Zef Hemel", "Eelco Visser"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/HemelV09",
	"doi": "10.1007/978-3-642-12107-4_17",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_17",
	"isbn": "978-3-642-12106-7",
	"pages": "224-243",
	"past": [
		"1. IronPython website (2009), http://www.ironpython.com",
		"2. IronRuby website (2009), http://www.ironruby.net",
		"3. JRuby website (2009), http://jruby.codehaus.org",
		"4. Jython website (2009), http://www.jython.org",
		"5. PIL website (2009), http://www.pil-lang.org",
		"6. Benitez, M.E., Davidson, J.W.:A portable global optimizer and linker. SIGPLANNot. 23(7), 329–338 (1988)",
		"7. Bezivin, J., Hammoudi, S., Lopes, D., Jouault, J.: Applying MDA approach for web ser- vice platform. In: EDOC 2004: Proceedings of the Enterprise Distributed Object Computing Conference, Eighth IEEE International, Washington, DC, USA, pp. 58–70. IEEE Computer Society, Los Alamitos (2004)",
		"8. Bravenboer, M., de Groot, R., Visser, E.: MetaBorg in action: Examples of domain-specific language embedding and assimilation using Stratego/XT. In: Lämmel, R., Saraiva, J., Visser, J. (eds.) GTTSE 2005. LNCS, vol. 4143, pp. 297–311. Springer, Heidelberg (2006)",
		"9. Bravenboer, M., Visser, E.: Concrete syntax for objects. Domain-specific language embed- ding and assimilation without restrictions. In: Schmidt, D.C. (ed.) Object-Oriented Program- ing, Systems, Languages, and Applications (OOPSLA 2004), Vancouver, Canada, pp. 365– 383. ACM Press, New York (2004)",
		"10. Chang, F., Dean, J., Ghemawat, S., Hsieh, W.C., Wallach, D.A., Burrows, M., Chandra, T., Fikes, A., Gruber, R.E.: Bigtable: A distributed storage system for structured data. ACM Trans. Comput. Syst. 26(2) (2008)",
		"11. Davidson, J.W., Fraser, C.W.: Code selection through object code optimization. ACM Trans- actions on Programming Languages and Systems 6(4), 505–526 (1984)",
		"12. George, L.: MLRISC: Customizable and reusable code generators. Technical report, AT&T Bell Laboratories, Murray Hill, NJ (1997)",
		"13. Groenewegen, D.M., Hemel, Z., Kats, L.C.L., Visser, E.: When frameworks let you down. platform-imposed constraints on the design and evolution of domain-specific languages. In: Gray, J., et al. (eds.) Domain Specific Modelling (DSM 2008), October 2008, pp. 64–66 (2008)",
		"14. Groenewegen, D.M., Visser, E.: Declarative access control for WebDSL: Combining lan- guage integration and separation of concerns. In: Schwabe, D., Curbera, F. (eds.) Eighth International Conference on Web Engineering (ICWE 2008), pp. 175–188. IEEE CS Press, Los Alamitos (2008) PIL: A Platform Independent Language for Retargetable DSLs 243",
		"15. Hemel, Z., Kats, L.C.L., Visser, E.: Code generation by model transformation. A case study in transformation modularity. In: Vallecillo, A., Gray, J., Pierantonio, A. (eds.) ICMT 2008. LNCS, vol. 5063, pp. 183–198. Springer, Heidelberg (2008)",
		"16. Hemel, Z., Verhaaf, R., Visser, E.: WebWorkFlow: An object-oriented workflow modeling language for web applications. In: Czarnecki, K., Ober, I., Bruel, J.-M., Uhl, A., Völter, M. (eds.) MODELS 2008. LNCS, vol. 5301, pp. 113–127. Springer, Heidelberg (2008)",
		"17. Miller, J., Mukerji, J.: MDA guide version 1.0.1 (2003)",
		"18. Muller, P.-A., Studer, P., Bézivin, J.: Platform independent web application modeling. In: Stevens, P., Whittle, J., Booch, G. (eds.) UML 2003. LNCS, vol. 2863, pp. 220–233. Springer, Heidelberg (2003)",
		"19. Parr, T.J., Quong, R.W.: ANTLR: A predicated-LL(k) parser generator. Software Practice and Experience 25, 789–810 (1994)",
		"20. Peyton Jones, S., Ramsey, N., Reig, F.: C–: A portable assembly language that supports garbage collection. In: Nadathur, G. (ed.) PPDP 1999. LNCS, vol. 1702, pp. 1–28. Springer, Heidelberg (1999)",
		"21. Richards, M.: The portability of the BCPL compiler. Software - Practice and Experience (1971)",
		"22. Semenzato, L.: The high-level intermediate language l. Technical Report UCB/CSD-93-760, EECS Department, University of California, Berkeley (July 1993)",
		"23. Stahl, T., Voelter, M., Czarnecki, K.: Model-Driven Software Development: Technology, En- gineering, Management. John Wiley & Sons, Chichester (2006)",
		"24. Steel Jr., T.B.: A first version of UNCOL. In: IRE-AIEE-ACM 1961 (Western): Papers pre- sented at the May 9-11, 1961, western joint IRE-AIEE-ACM computer conference, pp. 371– 378. ACM, New York (1961)",
		"25. UCSD. UCSD p-System and UCSD PASCAL Users Manual. SofTech Microsystems (1981)",
		"26. van den Brand, M., Cornelissen, B., Olivier, P.A., Vinju, J.J.: Tide: A generic debugging framework - tool demonstration. Electr. Notes Theor. Comput. Sci. 141(4), 161–165 (2005)",
		"27. vanDeursen, A.,Klint,P.,Tip, F.:Origintracking. Journal of SymbolicComputation 15(5/6), 523–545 (1993)",
		"28. van Deursen, A., Klint, P., Visser, J.: Domain-specific languages: an annotated bibliography. ACM SIGPLAN Notices 35(6), 26–36 (2000)",
		"29. Visser, E.: Scannerless generalized-LR parsing. Technical Report P9707, Programming Re- search Group, University of Amsterdam (July 1997)",
		"30. Visser, E.: WebDSL: A case study in domain-specific language engineering. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) Generative and Transformational Techniques in Software Engineering II. LNCS, vol. 5235, pp. 291–373. Springer, Heidelberg (2008)",
		"31. Wu, H., Gray, J., Mernik, M.: Grammar-driven generation of domain-specific language de- buggers. Softw. Pract. Exper. 38(10), 1073–1103 (2008)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["pil", "a", "platform", "independ", "languag", "for", "retarget", "dsls"],
	"tag": ["domain-specific language", "framework", "independence", "named"],
	"title": "PIL: A Platform Independent Language for Retargetable DSLs",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}