{
	"author": ["Alfons Laarman", "Ivan Kurtev"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/LaarmanK09",
	"doi": "10.1007/978-3-642-12107-4_14",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_14",
	"isbn": "978-3-642-12106-7",
	"pages": "174-183",
	"past": [
		"1. Atkinson, C., Kühne, T.: The Essence of Multilevel Metamodeling. In: Gogolla, M., Ko- bryn, C. (eds.) UML 2001. LNCS, vol. 2185, pp. 19–33. Springer, Heidelberg (2001)",
		"2. Atkinson, C., Kühne, T.: Model-driven development: a metamodeling foundation. IEEE Software 20(5), 36–41 (2003)",
		"3. Atzeni, P., Cappellari, P., Torlone, R., Bernstein, P.A., Gianforme, G.: Model-independent schema translation. VLDB J. 17(6), 1347–1370 (2008)",
		"4. Degen, W., Heller, B., Herre, H., Smith, B.: GOL: toward an axiomatized upper-level on- tology. In: FOIS 2001, pp. 34–46 (2001)",
		"5. Gangemi, A., Guarino, N., Masolo, C., Oltramari, A.: Sweetening WORDNET with DOLCE. AI Magazine 24(3), 13–24 (2003)",
		"6. Gasevic, D., Kaviani, N., Hatala, M.: On Metamodeling in Megamodels. In: Engels, G., Opdyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 91–105. Springer, Heidelberg (2007)",
		"7. Guarino, N., Welty, C.A.: A Formal Ontology of Properties. In: Dieng, R., Corby, O. (eds.) EKAW 2000. LNCS (LNAI), vol. 1937, pp. 97–112. Springer, Heidelberg (2000)",
		"8. Guizzardi, G.: Ontological Foundations for Structural Conceptual Models. PhD thesis. University of Twente (2005) ISBN 90-75176-81-3",
		"9. Guizzardi, G., Ferreira Pires, L., van Sinderen, M.: An Ontology-Based Approach for Evaluating the Domain Appropriateness and Comprehensibility Appropriateness of Mod- eling Languages. In: Briand, L.C., Williams, C. (eds.) MoDELS 2005. LNCS, vol. 3713, pp. 691–705. Springer, Heidelberg (2005)",
		"10. Guizzardi, G.: On Ontology, ontologies, Conceptualizations, Modeling Languages, and (Meta)Models. In: DB&IS 2006, pp. 18–39 (2006)",
		"11. Heller, B., Herre, H.: Ontological Categories in GOL. Axiomathes 14, 71–90 (2004)",
		"12. Hesse, W.: More matters on (meta-)modelling: remarks on Thomas Kühne’s matters. Software and System Modeling 5(4), 387–394 (2006)",
		"13. Jouault, F., Bézivin, J.: KM3: a DSL for Metamodel Specification. In: Gorrieri, R., Wehrheim, H. (eds.) FMOODS 2006. LNCS, vol. 4037, pp. 171–185. Springer, Heidel- berg (2006)",
		"14. Kühne, T.: Matters of (Meta-)Modeling. Software and System Modeling 5(4), 369–385 (2006)",
		"15. Kühne, T.: Clarifying matters of (meta-) modeling: an author’s reply. Software and System Modeling 5(4), 395–401 (2006)",
		"16. Kurtev, I., van den Berg, K.: MISTRAL: A Language for Model Transformations in the MOF Meta-modeling Architecture. In: MDAFA 2004, pp. 139–158 (2004)",
		"17. Laarman, A.W.: An Ontology Based Metalanguage with Explicit Instantiation. Master’s thesis, University of Twente (2009)",
		"18. OGML website, http://wwwhome.cs.utwente.nl/~laarman/ogml/ (retrieved at 15-9-09)",
		"19. Quine, W.V.O.: Ontological relativity’ and other essays. Columbia University Press, New York (1969)",
		"20. Wand, Y., Storey, V., Weber, R.: An Ontological Analysis of the Relationship Construct in Conceptual Modeling. ACM Trans. DB Syst. 24(4), 494–528 (1999)"
	],
	"present": [
		"keyword:Metamodeling",
		"keyword:ontologies",
		"keyword:instantiation semantics"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["ontolog", "metamodel", "with", "explicit", "instanti"],
	"tag": ["metamodelling", "ontology"],
	"title": "Ontological Metamodeling with Explicit Instantiation",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}