{
	"author": ["Lukas Renggli", "Marcus Denker", "Oscar Nierstrasz"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/RenggliDN09",
	"doi": "10.1007/978-3-642-12107-4_20",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_20",
	"isbn": "978-3-642-12106-7",
	"pages": "274-293",
	"past": [
		"1. Fowler, M.: Domain specific languages. Work In Progress (June 2008) http://martinfowler.com/dslwip/",
		"2. Bracha, G.: Executable grammars in Newspeak. Electron. Notes Theor. Comput. Sci. 193, 3–18 (2007)",
		"3. Goldberg, A., Robson, D.: Smalltalk 80: the Language and its Implementation. Addison Wesley, Reading (1983)",
		"4. Black, A., Ducasse, S., Nierstrasz, O., Pollet, D., Cassou, D., Denker, M.: Pharo by Example. Square Bracket Associates (2009)",
		"5. Denker, M., Ducasse, S., Lienhard, A., Marschall, P.: Sub-method reection. In: Journal of Object Technology, Special Issue. Proceedings of TOOLS Europe 2007, ETH, vol. 6/9, pp. 231–251 (2007)",
		"6. Renggli, L., Gˆırba, T.: Why Smalltalk wins the host languages shootout. In: Pro- ceedings of International Workshop on Smalltalk Technologies (IWST 2009). ACM Digital Library, New York (to appear, 2009)",
		"7. Visser, E.: Scannerless generalized-LR parsing. Technical Report P9707, Program- ming Research Group, University of Amsterdam (July 1997)",
		"8. Hutton, G., Meijer, E.: Monadic parser combinators. Technical Report NOTTCSTR- 96-4, Department of Computer Science, University of Nottingham (1996)",
		"9. Ford, B.: Parsing expression grammars: a recognition-based syntactic foundation. In: POPL 2004: Proceedings of the 31st ACM SIGPLAN-SIGACT symposium on Principles of programming languages, pp. 111–122. ACM, New York (2004) Language Boxes 293",
		"10. Ford, B.: Packrat parsing: simple, powerful, lazy, linear time, functional pearl. In: ICFP 2002: Proceedings of the seventh ACM SIGPLAN international conference on Functional programming, vol. 37/9, pp. 36–47. ACM, New York (2002)",
		"11. Foote, B., Johnson, R.E.: Reective facilities in Smalltalk-80. In: Proceedings OOP- SLA 1989, October 1989. ACM SIGPLAN Notices, vol. 24, pp. 327–336 (1989)",
		"12. Bawden, A.: Quasiquotation in Lisp. In: Partial Evaluation and Semantic-Based Program Manipulation, pp. 4–12 (1999)",
		"13. Taha, W.: A gentle introduction to multi-stage programming. In: Domain-Specific Program Generation, pp. 30–50 (2003)",
		"14. Tratt, L.: The Converge programming language. Technical Report TR-05-01, De- partment of Computer Science, King’s College London (February 2005)",
		"15. Clark, T., Sammut, P., Willans, J.: Superlanguages, Developing Languages and Applications with XMF, vol. 1st edn. Ceteva (2008)",
		"16. Seaton, C.: A programming language where the syntax and semantics are mutable at runtime. Technical Report CSTR-07-005, University of Bristol (June 2007)",
		"17. Klint, P.: A meta-environment for generating programming environments. ACM Transactions on Software Engineering and Methodology (TOSEM) 2(2), 176–201 (1993)",
		"18. Fowler, M.: Language workbenches: The killer-app for domain-specific languages (June 2005), http://www.martinfowler.com/articles/languageWorkbench.html",
		"19. Cordy, J.R.: The TXL source transformation language. Sci. Comput. Pro- gram. 61(3), 190–210 (2006)",
		"20. Bravenboer, M., Visser, E.: Concrete syntax for objects. Domain-specific language embedding and assimilation without restrictions. In: Schmidt, D.C. (ed.) Proceed- ings of the 19th ACM SIGPLAN Conference on Object-Oriented Programing, Systems, Languages, and Applications (OOPSLA 2004), Vancouver, Canada, pp. 365–383. ACM Press, New York (2004)",
		"21. Visser, E.: Program transformation with Stratego/XT: Rules, strategies, tools, and systems in StrategoXT-0.9. In: Lengauer, C., Batory, D., Consel, C., Odersky, M. (eds.) Domain-Specific Program Generation. LNCS, vol. 3016, pp. 216–238. Springer, Heidelberg (2004)",
		"22. Krahn, H., Rumpe, B., Völkel, S.: MontiCore: Modular development of textual do- main specific languages. In: Paige, R., Meyer, B. (eds.) Proceedings of the 46th In- ternational Conference Objects, Models, Components, Patterns (TOOLS-Europe), pp. 297–315. Springer, Heidelberg (2008)",
		"23. Spinellis, D.: Notable design patterns for domain specific languages. Journal of Systems and Software 56(1), 91–99 (2001)",
		"24. Cleenewerck, T.: Component-based DSL development. In: Proceedings of the 2nd international conference on Generative programming and component engineering, pp. 245–264. Springer, New York (2003)",
		"25. Van Wyk, E., de Moor, O., Backhouse, K., Kwiatkowski, P.: Forwarding in At- tribute Grammars for Modular Language Design. In: Horspool, R.N. (ed.) CC 2002. LNCS, vol. 2304, pp. 128–142. Springer, Heidelberg (2002)",
		"26. Van Wyk, E., Krishnan, L., Bodin, D., Schwerdfeger, A.: Attribute Grammar- Based Language Extensions for Java. In: Ernst, E. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 575–599. Springer, Heidelberg (2007)",
		"27. Hudak, P.: Building domain specific embedded languages. ACM Computing Sur- veys 28(4es) (December 1996)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["languag", "box"],
	"title": "Language Boxes",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}