{
	"author": ["Florian Heidenreich", "Jendrik Johannes", "Mirko Seifert", "Christian Wende"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/HeidenreichJSW09",
	"doi": "10.1007/978-3-642-12107-4_25",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_25",
	"isbn": "978-3-642-12106-7",
	"pages": "374-383",
	"past": [
		"1. Ritsko, J.J., Seidman, D.I.: Preface. IBM Systems Journal – Special Issue on Model- Driven Software Development 45(3) (2006)",
		"2. Völter, M., Stahl, T.: Model-Driven Software Development. Wiley & Sons, Chich- ester (2006)",
		"3. Steinberg, D., Budinsky, F., Paternostro, M., Merks, E.: Eclipse Modeling Frame- work, 2nd edn. Pearson Education, London (2008)",
		"4. Heidenreich, F., Johannes, J., Seifert, M., Wende, C.: JaMoPP: The Java Model Parser and Printer. Technical Report TUD-FI09-10 August 2009, Technische Uni- versität Dresden (2009)",
		"5. Heidenreich, F., Johannes, J., Karol, S., Seifert, M., Wende, C.: Derivation and Re- finement of Textual Syntax for Models. In: Paige, R.F., Hartman, A., Rensink, A. (eds.) ECMDA-FA 2009. LNCS, vol. 5562, pp. 114–129. Springer, Heidelberg (2009)",
		"6. Gosling, J., Joy, B., Steele, G., Bracha, G.: Java(TM) Language Specification, 3rd edn. Java Series. Addison-Wesley Professional, Reading (2005)",
		"7. Bravenboer, M., Kalleberg, K.T., Vermaas, R., Visser, E.: Stratego/XT 0.17. A language and toolset for program transformation. Science of Computer Program- ming 72(1-2), 52–70 (2008); Special issue on experimental software and toolkits",
		"8. Object Management Group: Metamodel and UML Profile for Java and EJB Spec- ification Version 1.0. formal/2004-02-02 (2004)",
		"9. Pawlak, R.: Spoon: Compile-time Annotation Processing for Middleware. IEEE Distributed Systems Online 7(11) (2006)",
		"10. Mernik, M., Heering, J., Sloane, A.M.: When and How to Develop Domain-Specific Languages. ACM Computing Surveys (CSUR) 37(4), 316–344 (2005)",
		"11. Heidenreich, F., Johannes, J., Seifert, M., Wende, C., Böhme, M.: Generating Safe Template Languages. In: Proc. of the 8th Int’l Conf. on Generative Programming and Component Engineering (GPCE 2009). ACM, New York (2009)",
		"12. Seifert, M., Samlaus, R.: Static Source Code Analysis using OCL. In: Cabot, J., Van Gorp, P. (eds.) Proc. of the MoDELS 2008 Workshop on OCL Tools: From Implementation to Evaluation and Comparison, OCL 2008 (2008)",
		"13. Pohl, K., Böckle, G., van der Linden, F.: Software Product Line Engineering. Foun- dations, Principles, and Techniques. Springer, Heidelberg (2005)",
		"14. Heidenreich, F., Kopcsek, J., Wende, C.: FeatureMapper: Mapping Features to Models. In: Comp. Proc. of the 30th Int’l Conf. on Software Engineering (ICSE 2008), pp. 943–944. ACM, New York (2008)",
		"15. Diehl, S.: Software Visualization. Springer, Heidelberg (2007)",
		"16. Ehrig, K., Ermel, C., Hänsgen, S., Taentzer, G.: Towards Graph Transformation based Generation of Visual Editors using Eclipse. In: Proc. of the Workshop: Visual Languages and Formal Methods, VLFM (2004)",
		"17. GMF Team: Graphical Modeling Framework, http://www.eclipse.org/gmf/",
		"18. Bravenboer, M.: Exercises in Free Syntax. Syntax Definition, Parsing, and Assim- ilation of Language Conglomerates. PhD thesis, Utrecht University, Utrecht, The Netherlands (2008)",
		"19. Goldschmidt, T., Becker, S., Uhl, A.: Classification of Concrete Textual Syntax Mapping Approaches. In: Schieferdecker, I., Hartman, A. (eds.) ECMDA-FA 2008. LNCS, vol. 5095, pp. 169–184. Springer, Heidelberg (2008)",
		"20. Angyal, L., Lengyel, L., Charaf, H.: A Synchronizing Technique for Syntactic Model-Code Round-Trip Engineering. In: 15th IEEE Int’l Conf. on Engineering of Computer Based Systems (ECBS 2008), pp. 463–472. IEEE Computer Society, Los Alamitos (2008)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["close", "the", "gap", "between", "model", "and", "java"],
	"tag": ["java", "modelling"],
	"title": "Closing the Gap between Modelling and Java",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}