{
	"author": ["Tihamer Levendovszky", "Daniel Balasubramanian", "Anantha Narayanan", "Gabor Karsai"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/LevendovszkyBNK09",
	"doi": "10.1007/978-3-642-12107-4_4",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_4",
	"isbn": "978-3-642-12106-7",
	"pages": "23-41",
	"past": [
		"[AALK + 09] Angyal, L., Asztalos, M., Lengyel, L., Levendovszky, T., Madari, I., Mezei, G., M´ eszáros, T., Siroki, L., Vajk, T.: Towards a fast, efficient and customizable domain-specific modeling framework. In: Proceedings of the IASTED International Conference, Innsbruck, Austria, February 2009, vol. 31, pp. 11–16 (2009)",
		"[AKNK + 06] Agrawal, A., Karsai, G., Neema, S., Shi, F., Vizhanyo, A.: The design of a language for model transformations. Software and Systems Model- ing 5(3), 261–288 (2006)",
		"[BV06] Balogh, A., Varró, D.: Advanced model transformation language con- structs in the VIATRA2 framework. In: ACM Symposium on Applied Computing — Model Transformation Track (SAC 2006), pp. 1280–1287. ACM Press, New York (2006)",
		"[BvKK + 08] Balasubramanian, D., van Buskirk, C., Karsai, G., Narayanan, A., Neema, S., Ness, B., Shi, F.: Evolving paradigms and models in multi- paradigm modeling. Technical Report ISIS-08-912, Institute for Soft- ware Integrated Systems (December 2008)",
		"[EE08] Ehrig, H., Ermel, C.: Semantical correctness and completeness of model transformations using graph and rule transformation. In: Ehrig, H., Heckel, R., Rozenberg, G., Taentzer, G. (eds.) ICGT 2008. LNCS, vol. 5214, pp. 194–210. Springer, Heidelberg (2008)",
		"[EEPT06] Ehrig, H., Ehrig, K., Prange, U., Taentzer, G.: Fundamentals of Al- gebraic Graph Transformation. Monographs in Theoretical Computer Science. An EATCS Series. Springer, Heidelberg (2006)",
		"[Kar00] Karsai, G.: Why is XML not suitable for semantic translation. Research Note, Nashville, TN (April 2000)",
		"[MBL+03] Magyari, E., Bakay, A., Lang, A., Paka, T., Vizhanyo, A., Agrawal, A., Karsai, G.: Udm: An infrastructure for implementing domain-specific modeling languages. In: The 3rd OOPSLA Workshop on Domain- Specific Modeling, OOPSLA 2003, Anahiem, California (October 2003)",
		"[MV04] Mosterman, P.J., Vangheluwe, H.: Computer automated multi- paradigm modeling: An introduction. Simulation: Transactions of the Society for Modeling and Simulation International 80(9), 433–450 (2004); Special Issue: Grand Challenges for Modeling and Simulation A Novel Approach to Semi-automated Evolution 41",
		"[NLBK09] Narayanan, A., Levendovszky, T., Balasubramanian, D., Karsai, G.: Au- tomatic domain model migration to manage metamodel evolution. In: Schürr, A., Selic, B. (eds.) MODELS 2009. LNCS, vol. 5795, pp. 706– 711. Springer, Heidelberg (2009)",
		"[NNZ00] Nickel, U., Niere, J., Zündorf, A.: The fujaba environment. In: ICSE 2000: Proceedings of the 22nd international conference on Software en- gineering, pp. 742–745. ACM, New York (2000)",
		"[PP96] Parisi-Presicce, F.: Transformation of graph grammars. In: 5th Int. Workshop on Graph Grammars and their Application to Computer Sci- ence, pp. 428–492 (1996)",
		"[Roz97] Rozenberg, G. (ed.): Handbook of graph grammars and computing by graph transformation. Foundations, vol. I. World Scientific Publishing Co., Inc., River Edge (1997)",
		"[Spr03] Sprinkle, J.: Metamodel Driven Model Migration. PhD thesis, Vander- bilt University, Nashville, TN 37203 (August 2003)",
		"[Tae04] Taentzer, G.: AGG: A graph transformation environment for model- ing and validation of software. In: Pfaltz, J.L., Nagl, M., B¨ ohlen, B. (eds.) AGTIVE 2003. LNCS, vol. 3062, pp. 446–453. Springer, Heidel- berg (2004)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["a", "novel", "approach", "to", "semi", "autom", "evolut", "of", "dsml", "model", "transform"],
	"tag": ["approach", "automation", "domain-specific language", "evolution", "model transformation", "novel"],
	"title": "A Novel Approach to Semi-automated Evolution of DSML Model Transformation",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}