{
	"author": ["Uwe Jugel"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/Jugel09",
	"doi": "10.1007/978-3-642-12107-4_24",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_24",
	"isbn": "978-3-642-12106-7",
	"pages": "354-373",
	"past": [
		"1. Stroustrup, B.: A rationale for semantically enhanced library languages. In: LCSD 2005 (OOPSLA workshop), Rensselaer Polytechnic Institute, Computer Science Department, pp. 44–52 (2005)",
		"2. Visser, E.: WebDSL: A case study in domain-specific language engineering. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) GTTSE 2007. LNCS, vol. 5235, pp. 291– 373. Springer, Heidelberg (2008)",
		"3. Deursen, A.v., Klint, P., Visser, J.: Domain-specific languages: An annotated bib- liography. ACM Sigplan Notices 35, 26–36 (2000)",
		"4. Fowler, M.: DSL Book WIP: Expression Builder (2008), http://martinfowler.com/dslwip/ExpressionBuilder.html",
		"5. Mernik, M., Heering, J., Sloane, A.: When and How to Develop Domain-Specific Languages. ACM Computing Surveys (CSUR) 37(4), 316–344 (2005)",
		"6. Consel, C., Marlet, R.: Architecturing Software Using A Methodology for Language Development. In: Palamidessi, C., Meinke, K., Glaser, H. (eds.) ALP 1998 and PLILP 1998. LNCS, vol. 1490, pp. 170–194. Springer, Heidelberg (1998) Generating Smart Wrapper Libraries for Arbitrary APIs 373",
		"7. Clarke, S.: Dr. Dobb’s Journal: Measuring API Usability (2004), http://www.ddj.com/windows/184405654",
		"8. Ellis, B., Stylos, J., Myers, B.: The Factory Pattern in API Design: A Usability Evaluation. In: ICSE 2007, pp. 302–312. IEEE Computer Society, Los Alamitos (2007)",
		"9. CocoaDev: ClassClusters, http://www.cocoadev.com/index.pl?ClassClusters",
		"10. Amyot, D., Farah, H., Roy, J.F.: Evaluation of Development Tools for Domain- Specific Modeling Languages. In: Gotzhein, R., Reed, R. (eds.) SAM 2006. LNCS, vol. 4320, pp. 183–197. Springer, Heidelberg (2006)",
		"11. Gamma, E., Helm, R., Johnson, R., Vlissides, J.: Design Patterns: Elements of Reusable Object-Oriented Software. Addison-Wesley, Reading (1995)",
		"12. Evans, E.: Domain-driven Design: Tackling Complexity in the Heart of Software. Addison-Wesley, Reading (2004)",
		"13. Ruby on Rails, http://rubyonrails.org",
		"14. Hudak, P.: Modular Domain Specific Languages and Tools. In: ICSR 1998, pp. 134–142. IEEE Computer Society, Los Alamitos (1998)",
		"15. Fowler, M.: DSL Book WIP: Implementing an Internal DSL (2007), http://martinfowler.com/dslwip/InternalOverview.html",
		"16. Tulach, J.: Practical API Design: Confessions of a Java TM Framework Architect. Apress (2008)",
		"17. Harrison, W., Barton, C., Raghavachari, M.: Mapping UML Designs to Java. In: OOPSLA 2000, pp. 178–187. ACM, New York (2000)",
		"18. Génova, G., Del Castillo, C., Llorens, J.: Mapping UML associations into Java code. Journal of Object Technology 2, 135–162 (2003)",
		"19. Eclipse Modeling - MDT - UML2, http://www.eclipse.org/modeling/mdt/?project=uml2",
		"20. Keschenau, M.: Reverse engineering of UML specifications from java programs. In: OOPSLA 2004, pp. 326–327. ACM, New York (2004)",
		"21. Sutton, A., Maletic, J.I.: Recovering UML class models from C++: A detailed ex- planation. In: WCRE 2005. Inf. Softw. Technol., vol. 49, pp. 212–229. Butterworth- Heinemann (2005)",
		"22. Cwalina, K., Abrams, B.: Framework Design Guidelines: Conventions, Idioms, and Patterns for Reusable.NET Libraries. Addison-Wesley Professional, Reading (2005)",
		"23. Host, E.W., Ostvold, B.M.: The Programmer’s Lexicon, Volume I: The Verbs. In: SCAM 2007, pp. 193–202. IEEE Computer Society, Los Alamitos (2007)",
		"24. Google Web Toolkit, http://code.google.com/webtoolkit",
		"25. openArchitectureWare, http://www.openarchitectureware.org"
	],
	"present": [
		"keyword:API-usability",
		"keyword:language integration",
		"keyword:code generation",
		"keyword:domain specific languages",
		"keyword:model-driven"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["generat", "smart", "wrapper", "librari", "for", "arbitrari", "api"],
	"tag": ["api", "generative", "library"],
	"title": "Generating Smart Wrapper Libraries for Arbitrary APIs",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}