{
	"author": ["Mauricio Alférez", "João Pedro Santos", "Ana M. D. Moreira", "Alessandro Garcia", "Uirá Kulesza", "João Araújo", "Vasco Amaral"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/AlferezSMGKAA09",
	"doi": "10.1007/978-3-642-12107-4_8",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_8",
	"isbn": "978-3-642-12106-7",
	"pages": "103-122",
	"past": [
		"1. Clements, P., Northrop, L.M.: Software Product Lines: Practices and Patterns. Addison- Wesley, Boston (2002)",
		"2. Pohl, K., Böckle, G., van der Linden, F.: Software Product Line Engineering: Foundations, Principles and Techniques. Springer, Berlin (2005)",
		"3. Czarnecki, K., Eisenecker, U.W.: Generative Programming: Methods, Tools, and Applica- tions. ACM Press/Addison-Wesley Publishing Co. (2000)",
		"4. Kang, K., Cohen, S., Hess, J., Novak, W., Peterson, A.: Feature-Oriented Domain Analysis (FODA) Feasibility Study. Technical Report CMU/SEI-90-TR-021, Software Engineering Institute, Carnegie Mellon University (1990)",
		"5. Gomaa, H.: Designing Software Product Lines with UML: From Use Cases to Pattern- Based Software Architectures. Addison-Wesley, Reading (2004)",
		"6. Czarnecki, K., Antkiewicz, M.: Mapping Features to Models: A Template Approach Based on Superimposed Variants. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 422–437. Springer, Heidelberg (2005)",
		"7. Alexander, I., Maiden, N.: Scenarios, Stories, Use Cases. Wiley, Chichester (2004)",
		"8. Unified Modeling Language (UML) Superstructure, Version 2.1.2: 2007-11-02",
		"9. Chung, L., Nixon, B., Yu, E., Mylopoulos, J.: Non-Functional Requirements in Software Engineering. Kluwer Academic Publishers, Dordrecht (1999)",
		"10. i* an Agent-oriented Modelling Framework, http://www.cs.toronto.edu/km/istar/",
		"11. Apel, S., Janda, F., Trujillo, S., Kästner, C.: Model Superimposition in Software Product Lines. In: Paige, R.F. (ed.) ICMT 2009. LNCS, vol. 5563, pp. 4–19. Springer, Heidelberg (2009)",
		"12. openArchitectureWare, http://www.openarchitectureware.org/",
		"13. Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"14. Taentzer, G.: AGG: A graph transformation environment for modeling and validation of software. In: Pfaltz, J.L., Nagl, M., Böhlen, B. (eds.) AGTIVE 2003. LNCS, vol. 3062, pp. 446–453. Springer, Heidelberg (2004)",
		"15. Sánchez, P., Loughran, N., Fuentes, L., Garcia, A.: Engineering Languages for Specifying Product-derivation Processes in Software Product Lines. In: Gašević, D., Lämmel, R., Van Wyk, E. (eds.) SLE 2008. LNCS, vol. 5452, pp. 188–207. Springer, Heidelberg (2009)",
		"16. Jayaraman, P., Whittle, J., Elkhodary, A., Gomaa, H.: Model Composition in Product Lines and Feature Interaction Detection Using Critical Pair Analysis. In: Engels, G., Op- dyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 151–165. Springer, Heidelberg (2007)",
		"17. Ample Project, http://www.ample-project.net/",
		"18. Groher, I., Volter, M.: XWeave: Models and Aspects in Concert. In: 10th International Workshop on Aspect-oriented Modeling. ACM, Vancouver (2007)",
		"19. pure: variants, http://www.pure-systems.com/Variant_Management.49.0.html",
		"20. Gears, http://www.biglever.com/",
		"21. Morganho, H., Gomes, C., Pimentão, J.P., Ribeiro, R., Grammel, B., Pohl, C., Rummler, A., Schwanninger, C., Fiege, L., Jaeger, M.: Requirement Specifications for Industrial Case Studies. Technical Report, D5.2, AMPLE Project (2008) 122  M. Alférez et al.",
		"22. Antkiewicz, M., Czarnecki, K.: FeaturePlugin: Feature Modeling Plug-in for Eclipse. In: 2004 OOPSLA workshop on eclipse technology eXchange, pp. 67–72. ACM Press, Van- couver (2004)",
		"23. Kruchten, P.: The Rational Unified Process: An Introduction. Addison-Wesley Longman Publishing Co., Inc., Amsterdam (2003)",
		"24. González-Baixauli, B., Laguna, M.A., Leite, J.C.S.d.P.: Using Goal-Models to Analyze Variability. Variability Modelling of Software-intensive Systems, Limerick, Ireland (2007)",
		"25. Variability Modeling Language for Requirements, http://ample.di.fct.unl.pt/VML_4_RE/",
		"26. Grzegorz, R. (ed.): Handbook of Graph Grammars and Computing by Graph Transforma- tion. Foundations, vol. I. Foundations. World Scientific Publishing Co., Inc., River Edge (1997)",
		"27. Markovic, S., Baar, T.: Refactoring OCL Annotated UML Class Diagram. In: Briand, L.C., Williams, C. (eds.) MoDELS 2005. LNCS, vol. 3713, pp. 280–294. Springer, Hei- delberg (2005)",
		"28. Whittle, J., Moreira, A., Araújo, J., Jayaraman, P., Elkhodary, A., Rabbi, R.: An Expres- sive Aspect Composition Language for UML State Diagrams. In: Engels, G., Opdyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 514–528. Springer, Heidelberg (2007)",
		"29. MDT-UML2Tools, http://www.eclipse.org/uml2/",
		"30. Xtext Reference Documentation, http://www.eclipse.org/gmt/oaw/doc/4.1/r80_xtextReference.pdf",
		"31. Eclipse Modeling Framework, http://www.eclipse.org/modeling/emf/?project=emf",
		"32. Goal-Driven Requirements Engineering: the KAOS Approach, http://www.info.ucl.ac.be/~avl/ReqEng.html",
		"33. Sousa, A., Kulesza, U., Rummler, A., Anquetil, N., Mitschke, R., Moreira, A., Amaral, V., Araújo, J.: A Model-Driven Traceability Framework to Software Product Line Develop- ment. In: 4th Traceability Workshop held in conjunction with ECMDA, Berlin, Germany (2008)",
		"34. Siemens AG - Research & Development, http://www.w1.siemens.com/innovation/en/index.php",
		"35. SAP A.G, http://www.sap.com/about/company/research/centers/ dresden.epx",
		"36. Figueiredo, E., Cacho, N., Sant’Anna, C., Monteiro, M., Kulesza, U., Garcia, A., Soares, S., Ferrari, F.C., Khan, S., Filho, F.C., Dantas, F.: Evolving software product lines with aspects: an empirical study on design stability. In: ICSE 2008. ACM, Leipzig (2008)",
		"37. AHEAD Tool Suite, http://www.cs.utexas.edu/users/schwartz/ATS.html",
		"38. Loughran, N., Sánchez, P., Garcia, A., Fuentes, L.: Language Support for Managing Vari- ability in Architectural Models. In: Pautasso, C., Tanter, É. (eds.) SC 2008. LNCS, vol. 4954, pp. 36–51. Springer, Heidelberg (2008)",
		"39. Rob van, O., Frank van der, L., Jeff, K., Jeff, M.: The Koala Component Model for Con- sumer Electronics Software. Computer 33(3), 78–85 (2000)",
		"40. Bragança, A., Machado, R.J.: Automating Mappings between Use Case Diagrams and Fea- ture Models for Software Product Lines. In: SPLC, pp. 3–12. IEEE Computer Society, Kyoto (2007)"
	],
	"present": [
		"keyword:Requirements Engineering",
		"keyword:Software Product Lines",
		"keyword:Variability Management",
		"keyword:Composition Languages",
		"keyword:Requirements Reuse"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["multi", "view", "composit", "languag", "for", "softwar", "product", "line", "requir"],
	"tag": ["composition", "multi", "product line", "requirements"],
	"title": "Multi-view Composition Language for Software Product Line Requirements",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}