{
	"author": ["Elina Kalnina", "Audris Kalnins", "Edgars Celms", "Agris Sostaks"],
	"back": "SLE-2009",
	"booktitle": "Revised Selected Papers of the Second International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2009",
	"dblpkey": "conf/sle/KalninaKCS09",
	"doi": "10.1007/978-3-642-12107-4_18",
	"editor": ["Mark van den Brand", "Dragan Gašević", "Jeff Gray"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-12107-4_18",
	"isbn": "978-3-642-12106-7",
	"pages": "244-253",
	"past": [
		"1. Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"2. Tisi, M., Jouault, F., Fraternali, P., Ceri, S., Bezivin, J.: On the use of higher-order model transformations. In: Paige, R.F., Hartman, A., Rensink, A. (eds.) ECMDA-FA 2009. LNCS, vol. 5562, pp. 18–33. Springer, Heidelberg (2009)",
		"3. Didonet Del Fabro, M., Bezivin, J., Jouault, F., Breton, E., Gueltas, G.: AMW: a generic model weaver. In: Proceedings of the 1ère Journée sur l’Ingénierie Dirigée par les Modèles (2005)",
		"4. Kalnins, A., Barzdins, J., Celms, E.: Model Transformation Language MOLA. In: Aßmann, U., Aksit, M., Rensink, A. (eds.) MDAFA 2003. LNCS, vol. 3599, pp. 62–76. Springer, Heidelberg (2005)",
		"5. Eclipse, JET, http://www.eclipse.org/modeling/m2t/?project=jet",
		"6. OMG, MOF Model to Text Transformation Language, v1.0. OMG Document Number: formal/2008-01-16, http://www.omg.org/docs/formal/08-01-16.pdf",
		"7. UL IMCS, MOLA pages, http://mola.mii.lu.lv/",
		"8. Kalnina, E., Kalnins, A.: DSL tool development with transformations and static mappings. In: Chaudron, M.R.V. (ed.) Models in Software Engineering, Workshops and Symposia at MODELS 2008. LNCS, vol. 5421, pp. 356–370. Springer, Heidelberg (2009)",
		"9. Cuadrado, J.S., Molina, J.G.: Approaches for Model Transformation Reuse: Factorization and Composition. In: Vallecillo, A., Gray, J., Pierantonio, A. (eds.) ICMT 2008. LNCS, vol. 5063, pp. 168–182. Springer, Heidelberg (2008)",
		"10. Kalnins, A., Vilitis, O., Celms, E., Kalnina, E., Sostaks, A., Barzdins, J.: Building Tools by Model Transformations in Eclipse. In: Proceedings of DSM 2007 workshop of OOPSLA 2007, Montreal, Canada, Jyvaskyla University Printing House, pp. 194–207 (2007)",
		"11. Visual Automated Model Transformations (VIATRA2), GMT subproject, Budapest BME, http://dev.eclipse.org/viewcvs/indextech.cgi/ gmt-home/subprojects/VIATRA2/index.html",
		"12. Czarnecki, K., Helsen, S.: Feature-based survey of model transformation approaches. IBM Systems Journal 45(3), 621–645 (2006)",
		"13. Czarnecki, K., Antkiewicz, M.: Mapping Features to Models: A Template Approach Based on Superimposed Variants. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 422–437. Springer, Heidelberg (2005)",
		"14. Gronmo, R., Moller-Pedersen, B., Olsen, G.K.: Comparison of Three Model Transforma- tion Languages. In: Paige, R.F., Hartman, A., Rensink, A. (eds.) ECMDA-FA 2009. LNCS, vol. 5562, pp. 2–17. Springer, Heidelberg (2009)",
		"15. de Lara, J., Vangheluwe, H.: AToM: A Tool for Multi-formalism and Meta-modelling. In: Kutsche, R.-D., Weber, H. (eds.) FASE 2002. LNCS, vol. 2306, pp. 174–188. Springer, Heidelberg (2002)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["graphic", "templat", "languag", "for", "transform", "synthesi"],
	"tag": ["synthesis", "visual notation"],
	"title": "Graphical Template Language for Transformation Synthesis",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5969,
	"year": 2009
}