{
	"author": ["Nicolas Genon", "Patrick Heymans", "Daniel Amyot"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/GenonHA10",
	"doi": "10.1007/978-3-642-19440-5_25",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_25",
	"isbn": "978-3-642-19439-9",
	"pages": "377-396",
	"past": [
		"1. OMG: Business Process Model and Notation (BPMN) Specification 2.0 V0.9.15. Object Management Group Inc. (2009)",
		"2. Moody, D.L.: The“Physics”of Notations: Towards a Scientific Basis for Construct- ing Visual Notations in Software Engineering. IEEE Transactions on Software En- gineering 35, 756–779 (2009)",
		"3. Larkin, J., Simon, H.: Why a Diagram Is (Sometimes) Worth Ten Thousand Words. Cognitive Science 11, 65–99 (1987)",
		"4. Britton, C., Jones, S.: The Untrained Eye: How Languages for Software Specifica- tion Support Understanding by Untrained Users. Human Computer Interaction 14, 191–244 (1999) 394 N. Genon, P. Heymans, and D. Amyot",
		"5. Kosslyn, S.M.: Graphics and Human Information Processing: A Review of Five Books. Journal of the American Statistical Association 80(391), 499–512 (1985)",
		"6. Hitchman, S.: The Details of Conceptual Modelling Notations are Important - A Comparison of Relationship Normative Language. Communications of the AIS 9(10) (2002)",
		"7. Recker, J., Rosemann, M., Indulska, M., Green, P.: Business Process Modeling - a Comparative Analysis. Journal of the Association for Information Systems (JAIS) 10(4), 333–363 (2009)",
		"8. van der Aalst, W., ter Hofstede, A.: YAWL: Yet Another Workflow Language. Information Systems Journal 30(4), 245–275 (2005)",
		"9. Green, T., Blandford, A., Church, L., Roast, C., Clarke, S.: Cognitive Dimensions: Achievements, New Directions, and Open Questions. Journal of Visual Languages and Computing 17, 328–365 (2006)",
		"10. Moody, D.L.: Theory Development in Visual Language Research: Beyond the Cog- nitive Dimensions of Notations. In: Proc. of the IEEE Symposium on Visual Lan- guages and Human-Centric Computing (VLHCC 2009), pp. 151–154 (2009)",
		"11. Krogstie, J., Sindre, G., Jorgensen, H.: Process Models Representing Knowledge for Action: a Revised Quality Framework. European Journal of Information Sys- tems 15, 91–102 (2006)",
		"12. Krogstie, J., Solvberg, A.: Information systems engineering - conceptual modeling in a quality perspective. In: Kompendiumforlaget, Trondheim, Norway (2003)",
		"13. Popper, K.R.: Science as Falsification. In: Routledge, Keagan, P. (eds.) Conjectures and Refutations, London, pp. 30–39 (1963)",
		"14. Moody, D.L.: Review of archimate: The road to international standardisation. Tech- nical report, Report commissioned by the ArchiMate Foundation and BiZZDesign B.V, Enschede, The Netherlands (2007)",
		"15. Moody, D., van Hillegersberg, J.: Evaluating the visual syntax of UML: An analysis of the cognitive effectiveness of the UML family of diagrams. In: Gaˇ sevi´ c, D., Lämmel, R., Van Wyk, E. (eds.) SLE 2008. LNCS, vol. 5452, pp. 16–34. Springer, Heidelberg (2009)",
		"16. Moody, D.L., Heymans, P., Matuleviˇ cius, R.: Improving the Effectiveness of Visual Representations in Requirements Engineering: An Evaluation of i* Visual Syn- tax (Best Paper Award). In: Proc. of the 17th IEEE International Requirements Engineering Conference (RE 2009), Washington, DC, USA, pp. 171–180. IEEE Computer Society, Los Alamitos (2009)",
		"17. Genon, N., Amyot, D., Heymans, P.: Analysing the Cognitive Effectiveness of the UCM Visual Notation (to appear, 2010)",
		"18. Bertin, J.: S´ emiologie graphique: Les diagrammes - Les r´ eseaux - Les cartes. Gauthier-VillarsMouton & Cie (1983)",
		"19. Mendling, J., Reijers, H., van der Aalst, W.: Seven Process Modelling Guidelines (7PMG). Information and Software Technology 52(2), 127–136 (2010)",
		"20. Mendling, J., Reijers, H., Cardoso, J.: What Makes Process Models Understand- able? In: Alonso, G., Dadam, P., Rosemann, M. (eds.) BPM 2007. LNCS, vol. 4714, pp. 48–63. Springer, Heidelberg (2007)",
		"21. Schrepfer, M., Wolf, J., Mendling, J., Reijers, H.: The Impact of Secondary Nota- tion on Process Model Understanding. In: Persson, A., Stirna, J. (eds.) PoEM 2009. Lecture Notes in Business Information Processing, vol. 39, pp. 161–175. Springer, Heidelberg (2009) Analysing the Cognitive Effectiveness of the BPMN 2.0 Visual Notation 395",
		"22. Figl, K., Mendling, J., Strembeck, M., Recker, J.: On the Cognitive Effectiveness of Routing Symbols in Process Modeling Languages. In: Abramowicz, W., Tolksdorf, R. (eds.) BIS 2010. Lecture Notes in Business Information Processing, vol. 47, pp. 230–241. Springer, Heidelberg (2010)",
		"23. Mendling, J., Recker, J., Reijers, H.A.: On the Usage of Labels and Icons in Business Process Modeling. Computer, 40–58 (2010)",
		"24. Figl, K., Mendling, J., Strembeck, M.: Towards a Usability Assessment of Process Modeling Languages. In: Proc. of the 8th Workshop Geschäftsprozessmanagement mit Ereignisgesteuerten Prozessketten (EPK 2009), Berlin, Germany. CEUR Work- shop Proceedings, vol. 554, pp. 118–136 (2009)",
		"25. Reijers, H.A., Mendling, J.: Modularity in Process Models: Review and Effects. In: Dumas, M., Reichert, M., Shan, M.-C. (eds.) BPM 2008. LNCS, vol. 5240, pp. 20–35. Springer, Heidelberg (2008)",
		"26. Muehlen, M.z., Recker, J.: How Much Language Is Enough? Theoretical and Prac- tical Use of the Business Process Modeling Notation. In: Bellahs` ene, Z., L´ eonard, M. (eds.) CAiSE 2008. LNCS, vol. 5074, pp. 465–479. Springer, Heidelberg (2008)",
		"27. Genon, N., Heymans, P., Moody, D.L.: BPMN 2.0 Process Models: Analysis ac- cording to the“Physics”of Notations Principles. Technical report, PReCISE - Uni- versity of Namur (2010), http://www.info.fundp.ac.be/~nge/BPMN/BPMN2_PoN_Analysis.pdf",
		"28. Vessey, I.: Cognitive Fit: A Theory-based Analysis of the Graphs versus Tables Literature. Decision Sciences 22, 219–240 (1991)",
		"29. Koedinger, K., Anderson, J.: Abstract planning and conceptual chunks: Elements of expertise in geometry. Cognitive Science 14, 511–550 (1990)",
		"30. Winn, W.: An Account of How Readers Search for Information in Diagrams. Con- temporary Educational Psychology 18, 162–185 (1993)",
		"31. Blankenship, J., Danseraeau, D.F.: The effect of animated node-link displays on information recall. The Journal of Experimental Education 68(4), 293–308 (2000)",
		"32. Persson, A.: Enterprise Modelling in Practice: Situational Factors and their Influ- ence on Adopting a Participative Approach. PhD thesis, Department of Computer and Systems Sciences, Stockholm University (2001)",
		"33. Goodman, N.: Languages of Art: An Approach to a Theory of Symbols. Bobbs- Merrill Co., Indianapolis (1968)",
		"34. Winn, W.: Encoding and Retrieval of Information in Maps and Diagrams. IEEE Transactions on Professional Communication 33(3), 103–107 (1990)",
		"35. Biederman, I.: Recognition-by-Components: A Theory of Human Image Under- standing. Psychological Review 94(2), 115–147 (1987)",
		"36. Green, D.M., Swets, J.A.: Signal Detection Theory and Psychophysics. Wiley, Chichester (1966)",
		"37. Petre, M.: Why Looking Isn’t Always Seeing: Readership Skills and Graphical Programming. Communications of ACM 38(6), 33–44 (1995)",
		"38. Masri, K., Parker, D., Gemino, A.: Using Iconic Graphics in Entity Relationship Diagrams: The Impact on Understanding. Journal of Database Management 19(3), 22–41 (2008)",
		"39. Pierce, C.: The Essential Writings. Prometheus Books (1998)",
		"40. Bar, M., Neta, M.: Humans Prefer Curved Visual Object. Psychological Science 17(8), 645–648 (2006)",
		"41. Citrin, W.: Strategic Directions in Visual Languages Research. ACM Computing Surveys 24(4) (1996)",
		"42. Flood, R., Carson, E.: Dealing with Complexity: an Introduction to the Theory and Application of Systems Science. Plenum Press, New York (1993) 396 N. Genon, P. Heymans, and D. Amyot",
		"43. Silver, B.: BPMN Method and Style. Cody-Cassidy Press (June 2009)",
		"44. Lynch, K.: The Image of the City. MIT Press, Cambridge (1960)",
		"45. Lamping, J., Rao, R.: The Hyperbolic Browser: a Focus + Context Technique for Visualizing Large Hierarchies. Journal of Visual Languages and Computing 7, 33–55 (1999)",
		"46. Turetken, O., Schuff, D., Sharda, R., Ow, T.: Supporting Systems Analysis and Design Through Fisheye Views. Communications of ACM 47(9), 72–77 (2004)",
		"47. Kim, J., Hahn, J., Hahn, H.: How Do We Understand a Systeme with (So) Many Diagrams? Cognitive Integration Processes in Diagrammatic Reasoning. Informa- tion Systems Research 11(3), 284–303 (2000)",
		"48. Paivio, A.: Mental Representations: A Dual Coding Approach. Oxford University Press, Oxford (1986)",
		"49. Mendling, J., Recker, J., Reijers, H.: On the Usage of Labels and Icons in Busi- ness Process Modeling. International Journal of Information System Modeling and Design, IJISMD (2009)",
		"50. Nordbotten, J., Crosby, M.: The Effect of Graphic Style on Data Model Interpre- tation. Information Systems Journal 9(2), 139–156 (1999)",
		"51. Miller, G.A.: The Magical Number Seven, Plus or Minus Two: Some Limits on Our Capacity for Processing Information. Psycological Review, 81–97 (1956)",
		"52. Davies, I., Green, P., Rosemann, M., Indulska, M., Gallo, S.: How Do Practitioners Use Conceptual Modelling in Practice? Data and Knowledge Engineering 58, 358– 380 (2006)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["analys", "the", "cognit", "effect", "of", "the", "bpmn", "visual", "notat"],
	"tag": ["effectiveness"],
	"title": "Analysing the Cognitive Effectiveness of the BPMN 2.0 Visual Notation",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}