{
	"author": ["Jean-Marie Favre", "Dragan Gašević", "Ralf Lämmel", "Ekaterina Pek"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/FavreGLP10",
	"doi": "10.1007/978-3-642-19440-5_21",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_21",
	"isbn": "978-3-642-19439-9",
	"pages": "316-326",
	"past": [
		"1. Barbara, M.B., Ryder, G., Soffa, M.L.: The impact of software engineering research on modern progamming languages. ACM Transactions on Software Engineering and Method- ology 14(4), 431–477 (2005)",
		"2. Baron, N.S.: How to Make Your Way through the New Language Maze - Computer Lan- guages: a Guide For The Perplexed. Doubleday (1986)",
		"3. Bertil Ekdahl, L.J.: The difficulty in communicating with computers. In: Interactive Conver- gence: Critical Issues in Multimedia, ch. 2. Inter-Disciplinary Press (2005)",
		"4. Cooper, H.M.: The integrative research review: A systematic approach. Applied social re- search methods series, vol. 2. Sage, Thousand Oaks (1984)",
		"5. Crystal, D.: The Cambridge Encyclopedia of Language, 2nd edn. Cambridge University Press, Cambridge (2005)",
		"6. Cunningham, H.: A definition and short history of language engineering. Journal of Natural Language Engineering 5, 1–16 (1999)",
		"7. David Gelernter, S.J.: Programming Linguistics. MIT Press, Cambridge (1990)",
		"8. Dijkstra, E.W.: On the foolishness of ”natural language programming”. In: Program Con- struction, International Summer Schoo, London, UK, pp. 51–53. Springer, Heidelberg (1979)",
		"9. Favre, J.-M.: Languages evolve too! changing the software time scale. In: IEEE (ed.) 8th Interntational Workshop on Principles of Software Evolution, IWPSE (September 2005)",
		"10. Georgiev, H.: Language Engineering. Continuum (2007)",
		"11. Glass, G.V., McGaw, B., Smith, M.L.: Meta-analysis in social research. Sage, Beverly Hills (1981)",
		"12. Goodenough, J.: The comparison of programming languages: A linguistic approach. In: ACM/CSC-ER (1968)",
		"13. Kitchenham, B., Al-Khilidar, H., Babar, M.A., Berry, M., Cox, K., Keung, J., Kurniawati, F., Staples, M., Zhang, H., Zhu, L.: Evaluating guidelines for reporting empirical software engineering studies. Empirical Software Engineering 13(1), 97–121 (2008)",
		"14. Kleppe, A.: Software Language Engineering: Creating Domain-Specific Languages Using Metamodels. Addison-Wesley Professional, Reading (2008) 326 J.-M. Favre et al.",
		"15. Krippendorff, K.: Content Analysis: an Introduction to Its Methodology, 2nd edn. Sage, Thousand Oaks (2004)",
		"16. Leech, N.L.,Onwuegbuzie, A.J.: Qualitative data analysis: A compendium of techniques and a framework for selection for school psychology research and beyond. School Psychology Quarterly 23(4), 587–604 (2008)",
		"17. Mahoney, M.: HOPL II - closing panel: The history of programming: Does our present past have a future? ACM SIGPLAN Notices 31(11), 15–37 (1996)",
		"18. Misek-Falkoff, L.D.: The new field of ”software linguistics”: An early-bird view. In: ACM (ed.) ACM SIGMETRICS Workshop on Software Metrics (1982)",
		"19. Steele Jr., G.L., Gabriel, R.P.: The evolution of Lisp. ACM SIGPLAN Notices, 231–270 (1993)",
		"20. Taylor-Powell, E., Renner, M.: Analyzing qualitative data. In: Evaluation in Social Work: The Art and Science of Practice, ch. 13, University of Wisconsin Extension Program, Devel- opment and Evaluation Unit (2003)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["empir", "languag", "analysi", "in", "softwar", "linguist"],
	"tag": ["analysis", "empirical"],
	"title": "Empirical Language Analysis in Software Linguistics",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}