{
	"author": ["Raphael Mannadiar", "Hans Vangheluwe"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/MannadiarV10",
	"doi": "10.1007/978-3-642-19440-5_17",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_17",
	"isbn": "978-3-642-19439-9",
	"pages": "276-285",
	"past": [
		"1. Brown, A.W.: Model driven architecture: Principles and practice. Software and Systems Modeling (SoSym) 3, 314–327 (2004)",
		"2. Czarnecki, K., Helsen, S.: Feature-based survey of model transformation ap- proaches. IBM Systems Journal (IBMS) 45, 621–645 (2006) 12 Once again, traceability links between DSms and artifacts may be key. Debugging in Domain-Specific Modelling 285",
		"3. de Lara, J., Vangheluwe, H., Alfonseca, M.: Meta-modelling and graph gram- mars for multi-paradigm modelling in AToM 3 . Software and Systems Modeling (SoSym) 3, 194–209 (2004)",
		"4. Eisenstadt, M.: “My Hairiest Bug” war stories. Communications of the ACM (CACM) 40, 30–37 (1997)",
		"5. Kelly, S., Tolvanen, J.-P.: Domain-Specific Modeling: Enabling Full Code Genera- tion. Wiley-Interscience, Hoboken (2008)",
		"6. Lengyel, L., Levendovszky, T., Mezei, G., Charaf, H.: Model transformation with a visual control flow language. International Journal of Computer Science (IJCS) 1, 45–53 (2006)",
		"7. Mannadiar, R., Vangheluwe, H.: Modular synthesis of mobile device applications from domain-specific models. In: The 7th International Workshop on Model-Based Methodologies for Pervasive and Embedded Software, MOMPES (2010)",
		"8. Mannadiar, R., Vangheluwe, H.: Modular synthesis of mobile device applications from domain-specific models. Technical Report SOCS-TR-2010.5, McGill Univer- sity (2010)",
		"9. Safa, L.: The making of user-interface designer a proprietary DSM tool. In: 7th OOPSLA Workshop on Domain-Specific Modeling (DSM), p. 14 (2007), http://www.dsmforum.org/events/DSM07/papers.html",
		"10. Schürr, A.: Specification of graph translators with triple graph grammars. In: Pro- ceedings of the 20th International Workshop on Graph-Theoretic Concepts in Com- puter Science (1995)",
		"11. Syriani, E., Kienzle, J., Vangheluwe, H.: Exceptional transformations. In: Tratt, L., Gogolla, M. (eds.) ICMT 2010. LNCS, vol. 6142, pp. 199–214. Springer, Heidelberg (2010)",
		"12. Syriani, E., Vangheluwe, H.: De-/re-constructing model transformation languages. In: 9th International Workshop on Graph Transformation and Visual Modeling Techniques, GT-VMT (2010)",
		"13. Wu, H., Gray, J., Mernik, M.: Grammar-driven generation of domain-specific lan- guage debuggers. Software: Practice and Experience 38, 1073–1103 (2008)",
		"14. Zeller, A.: Why Programs Fail: A Guide to Systematic Debugging, 2nd edn. Morgan Kaufmann, San Francisco (2009)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["debug", "in", "domain", "specif", "model"],
	"tag": ["debugging", "modelling"],
	"title": "Debugging in Domain-Specific Modelling",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}