{
	"author": ["Emma Söderberg", "Görel Hedin"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/SoderbergH10",
	"doi": "10.1007/978-3-642-19440-5_2",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_2",
	"isbn": "978-3-642-19439-9",
	"pages": "2-21",
	"past": [
		"1. Acar, U.A., Blelloch, G.E., Harper, R.: Selective memoization. In: POPL, pp. 14–25. ACM, New York (2003)",
		"2. Åkesson, J., Ekman, T., Hedin, G.: Implementation of a Modelica compiler using JastAdd attribute grammars. Science of Computer Programming 75(1-2), 21–38 (2010) 20 E. Söderberg and G. Hedin",
		"3. Bellman, R.: Dynamic Programming. Princeton University Press, Princeton (1957)",
		"4. Blackburn, S.M., Garner, R., Hoffmann, C., Khang, A.M., McKinley, K.S., Bentzur, R., Diwan, A., Feinberg, D., Frampton, D., Guyer, S.Z., Hirzel, M., Hosking, A., Jump, M., Lee, H., Moss, J.E.B., Moss, B., Phansalkar, A., Stefanovi´ c, D., VanDrunen, T., von Dincklage, D., Wiedermann, B.: The DaCapo benchmarks: java benchmarking development and anal- ysis. In: OOPSLA 2006: Proceedings of the 21st Annual ACM SIGPLAN Conference on Object-Oriented Programming Systems, Languages, and Applications, pp. 169–190. ACM, New York (2006)",
		"5. Blackburn, S.M., McKinley, K.S., Garner, R., Hoffmann, C., Khan, A.M., Bentzur, R., Diwan, A., Feinberg, D., Frampton, D., Guyer, S.Z., Hirzel, M., Hosking, A.L., Jump, M., Lee, H., Moss, J.E.B., Phansalkar, A., Stefanovic, D., VanDrunen, T., von Dincklage, D., Wiedermann, B.: Wake up and smell the coffee: evaluation methodology for the 21st cen- tury. Communications of the ACM 51(8), 83–89 (2008)",
		"6. Boyland, J.T.: Remote attribute grammars. Journal of the ACM 52(4), 627–687 (2005)",
		"7. Bürger, C., Karol, S., Wende, C.: Applying attribute grammars for metamodel semantics. In: Proceedings of the International Workshop on Formalization of Modeling Languages. ACM Digital Library (2010)",
		"8. Ekman, T., Hedin, G.: Modular Name Analysis for Java Using JastAdd. In: Lämmel, R., Saraiva, J., Visser, J. (eds.) GTTSE 2005. LNCS, vol. 4143, pp. 422–436. Springer, Heidelberg (2006)",
		"9. Ekman, T., Hedin, G.: The Jastadd Extensible Java Compiler. In: 22nd Annual ACM SIG- PLANConference on Object-OrientedProgramming, Systems, Languages, and Applications (OOPSLA 2007), pp. 1–18. ACM, New York (2007)",
		"10. Farrow, R.: Automatic generation of fixed-point-finding evaluators for circular, but well- defined, attribute grammars. In: SIGPLAN 1986: Proceedings of the 1986 SIGPLAN Sym- posium on Compiler Construction, pp. 85–98. ACM, New York (1986)",
		"11. Hedin, G.: Reference Attributed Grammars. Informatica (Slovenia) 24(3), 301–317 (2000)",
		"12. Hedin, G., Magnusson, E.: JastAdd: an aspect-oriented compiler construction system. Sci- ence of Computer Programming 47(1), 37–58 (2003)",
		"13. Huang, S.S., Hormati, A., Bacon, D.F., Rabbah, R.M.: Liquid metal: Object-oriented pro- gramming across the hardware/Software boundary. In: Ryan, M. (ed.) ECOOP 2008. LNCS, vol. 5142, pp. 76–103. Springer, Heidelberg (2008)",
		"14. Ibrahim, A., Jiao, Y., Tilevich, E., Cook, W.R.: Remote batch invocation for compositional object services. In: Drossopoulou, S. (ed.) ECOOP 2009. LNCS, vol. 5653, pp. 595–617. Springer, Heidelberg (2009)",
		"15. Jourdan, M.: An optimal-time recursive evaluator for attribute grammars. In: Paul, M., Robi- net, B. (eds.) Programming 1984. LNCS, vol. 167, pp. 167–178. Springer, Heidelberg (1984)",
		"16. Jouve, W., Palix, N., Consel, C., Kadionik, P.: A SIP-based programming framework for ad- vanced telephony applications. In: Schulzrinne, H., State, R., Niccolini, S. (eds.) IPTComm 2008. LNCS, vol. 5310, pp. 1–20. Springer, Heidelberg (2008)",
		"17. Kastens, U.: Lifetime analysis for attributes. Acta Informatica 24(6), 633–651 (1987)",
		"18. Kats, L.C.L., Sloane, A.M., Visser, E.: Decorated Attribute Grammars: Attribute Evaluation Meets Strategic Programming. In: de Moor, O., Schwartzbach, M.I. (eds.) CC 2009. LNCS, vol. 5501, pp. 142–157. Springer, Heidelberg (2009)",
		"19. Knuth, D.E.: Semantics of Context-free Languages. Mathematical Systems Theory 2(2), 127–145 (1968); Correction: Mathematical Systems Theory 5(1), 95–96 (1971)",
		"20. Nilsson-Nyman, E., Ekman, T., Hedin, G., Magnusson, E.: Declarative intraprocedural flow analysis of Java source code. In: Proceedings of the Eight Workshop on Language Descrip- tion, Tools and Applications (LDTA 2008). Electronic Notes in Theoretical Computer Sci- ence, Elsevier B.V., Amsterdam (2008) Automated Selective Caching for Reference Attribute Grammars 21",
		"21. Poetzsch-Heffter, A.: Prototyping realistic programming languages based on formal specifi- cations. Acta Informatica 34(10), 737–772 (1997)",
		"22. Rajan, H.: Ptolemy: A language with quantified, typed events (2010), http://www.cs.iastate.edu/~ptolemy/",
		"23. Saarinen, M.: On constructing efficient evaluators for attribute grammars. In: Ausiello, G., Böhm, C. (eds.) ICALP 1978. LNCS, vol. 62, pp. 382–397. Springer, Heidelberg (1978)",
		"24. Schäfer, M., Ekman, T., de Moor, O.: Sound and Extensible Renaming for Java. In: Kicza- les, G. (ed.) 23rd Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA 2008). ACM Press, New York (2008)",
		"25. Sloane, A.M., Kats, L.C.L., Visser, E.: A Pure Object-Oriented Embedding of Attribute Grammars. In: Proceedings of the 9th Workshop on Language Descriptions, Tools and Ap- plications, LDTA 2009 (2009)",
		"26. The DaCapo Project. The DaCapo Benchmarks (2009), http://dacapobench.org",
		"27. The JastAdd Caching Trac. Performance results for JastAddJ (2010), http://svn.cs.lth.se/trac/jastadd-caching",
		"28. The Mauve Project. Jacks (Jacks is an Automated Compiler Killing Suite) (2009), http://sources.redhat.com/mauve",
		"29. Vogt, H., Doaitse Swierstra, S., Kuiper, M.F.: Higher-order attribute grammars. In: PLDI, pp. 131–145 (1989)",
		"30. Van Wyk, E., Bodin, D., Gao, J., Krishnan, L.: Silver: An extensible attribute grammar sys- tem. Science of Computer Programming 75(1-2), 39–54 (2010)",
		"31. Van Wyk, E., Krishnan, L., Bodin, D., Schwerdfeger, A.: Attribute grammar-based language extensions for java. In: Bateni, M. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 575–599. Springer, Heidelberg (2007)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["autom", "select", "cach", "for", "refer", "attribut", "grammar"],
	"tag": ["attribute grammar", "automation"],
	"title": "Automated Selective Caching for Reference Attribute Grammars",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}