{
	"author": ["Davide Di Ruscio", "Ralf Lämmel", "Alfonso Pierantonio"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/RuscioLP10",
	"doi": "10.1007/978-3-642-19440-5_9",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_9",
	"isbn": "978-3-642-19439-9",
	"pages": "143-162",
	"past": [
		"1. Amyot, D., Farah, H., Roy, J.-F.: Evaluation of Development Tools for Domain-Specific Modeling Languages. In: Gotzhein, R., Reed, R. (eds.) SAM 2006. LNCS, vol. 4320, pp. 183–197. Springer, Heidelberg (2006)",
		"2. Bézivin, J.: On the Unification Power of Models. Jour. on Software and Systems Modeling (SoSyM) 4(2), 171–188 (2005)",
		"3. Budinsky, F.,Steinberg,D.,Merks, E.,Ellersick,R.,Grose,T.:EclipseModeling Framework. Addison-Wesley, Reading (2003)",
		"4. Cicchetti, A., Di Ruscio, D., Eramo, R., Pierantonio, A.: Automating Co-evolution in Model- Driven Engineering. In: Proceedings of the 12th International IEEE Enterprise Distributed Object Computing Conference, ECOC 2008, pp. 222–231. IEEE Computer Society, Los Alamitos (2008)",
		"5. Cicchetti, A., Di Ruscio, D., Pierantonio, A.: A Metamodel Independent Approach to Differ- ence Representation. Journal of Object Technology 6(9), 165–185 (2007)",
		"6. Cicchetti, A., Di Ruscio, D., Pierantonio, A.: Model Patches in Model-Driven Engineering. In: Ghosh, S. (ed.) MODELS 2009. LNCS, vol. 6002, pp. 190–204. Springer, Heidelberg (2010)",
		"7. Eclipse Foundation. EMF Compare (2010), http://www.eclipse.org/modeling/emft/?project=compare",
		"8. Egyed,A.,Letier,E.,Finkelstein,A.:GeneratingandEvaluatingChoicesforFixingInconsis- tenciesinUML DesignModels. In:23rd IEEE/ACMInternational Conference on Automated Software Engineering (ASE 2008), pp. 99–108. IEEE, Los Alamitos (2008)",
		"9. Eclipse project: Eclipse Modeling Framework Project (EMF), http://www.eclipse.org/modeling/emf/",
		"10. Favre, J.-M.: Meta-Model and Model Co-evolution within the 3D Software Space. In: Pro- ceedings of International Workshop on Evolution of Large-scale Industrial Software Ap- plications (ELISA 2003), Co-located with the IEEE International Conference on Software Maintenance, ICSM 2003 (2003)",
		"11. Favre, J.-M.: Languages Evolve Too! Changing the Software Time Scale. In: IEEE (ed.) 8th Interntational Workshop on Principles of Software Evolution, IWPSE (2005)",
		"12. Eclipse project: GEF - Graphical Editing Framework, http://www.eclipse.org/gef/",
		"13. Giese, H., Wagner, R.: Incremental Model Synchronization with Triple Graph Grammars. In: Wang, J., Whittle, J., Harel, D., Reggio, G. (eds.) MoDELS 2006. LNCS, vol. 4199, pp. 543–557. Springer, Heidelberg (2006)",
		"14. Eclipse project: GMF - Graphical Modeling Framework, http://www.eclipse.org/gmf/",
		"15. Herrmannsdoerfer, M., Benz, S., Jürgens, E.: COPE - Automating Coupled Evolution of Metamodels and Models. In: Drossopoulou, S. (ed.) ECOOP 2009. LNCS, vol. 5653, pp. 52–76. Springer, Heidelberg (2009) 162 D. Di Ruscio, R. Lämmel, and A. Pierantonio",
		"16. Jouault, F., Bézivin, J., Kurtev, I.: TCS: a DSL for the specification of textual concrete syn- taxes in model engineering. In: Proceedings of Generative Programming and Component Engineering (GPCE 2006), pp. 249–254. ACM, New York (2006)",
		"17. Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"18. Kadhim, B., Waite, W.: Maptool—supporting modular syntax development. In: Gyimóthy, T. (ed.) CC 1996. LNCS, vol. 1060, pp. 268–280. Springer, Heidelberg (1996)",
		"19. Kolovos, D.S., Rose, L.M., Abid, S.B., Paige, R.F., Botterweck, G.: Taming EMF and GMF Using Model Transformation. In: 13th ACM/IEEE International Conference on Model Driven Engineering, Languages and Systems, MoDELS (to appear, 2010)",
		"20. Kolovos, D.S., Rose, L.M., Paige, R.F., Polack, F.A.C.: Raising the level of abstraction in the development of GMF-based graphical model editors. In: MISE 2009: Proceedings of the 2009 ICSE Workshop on Modeling in Software Engineering, pp. 13–19. IEEE, Los Alamitos (2009)",
		"21. Lämmel, R., Riedewald, G.: Reconstruction of paradigm shifts. In: Proceedings of the Sec- ond Workshop on Attribute Grammars and their Applications (WAGA 1999), pp. 37–56 (March 1999); INRIA Technical Report ISBN 2-7261-1138-6",
		"22. Lohmann, W., Riedewald, G., Stoy, M.: Semantics-preserving migration of semantic rules after left recursion removal in attribute grammars. In: Proceedings of 4th Workshop on Lan- guage Descriptions, Tools and Applications (LDTA 2004). ENTCS, vol. 110, pp. 133–148. Elsevier Science, Amsterdam (2004)",
		"23. Modica, T., Biermann, E.,Ermel,C.:AnEclipseFramework for RapidDevelopment of Rich- featured GEF Editors based on EMF Models. In: Proceedings of Informatik 2009: Im Focus das Leben, Beiträge der 39. Jahrestagung der Gesellschaft füur Informatik e.V (GI). LNI, vol. 154, pp. 2972–2985. GI (2009)",
		"24. Object Management Group (OMG). MOF QVT Final Adopted Specification, OMG Adopted Specification ptc/05-11-01 (2005)",
		"25. Object Management Group (OMG). OCL 2.0 Specification, OMG Document formal/2006- 05-01 (2006)",
		"26. Overbey, J.L., Johnson, R.E.: Generating Rewritable Abstract Syntax Trees. In: Gaˇ sevi´ c, D., Lämmel, R., Van Wyk, E. (eds.) SLE 2008. LNCS, vol. 5452, pp. 114–133. Springer, Heidelberg (2009)",
		"27. Ráth, I., ¨ Okrös, A., Varró, D.: Synchronization of abstract and concrete syntax in domain- specific modeling languages—By mapping models and live transformations. Journal of Soft- ware and Systems Modeling (2009)",
		"28. Vermolen, S., Visser, E.: Heterogeneous Coupled Evolution of Software Languages. In: Busch, C.,Ober, I.,Bruel,J.-M., Uhl,A.,Völter, M. (eds.) MODELS2008. LNCS,vol. 5301, pp. 630–644. Springer, Heidelberg (2008)",
		"29. Wachsmuth, G.: Metamodel Adaptation and Model Co-adaptation. In: Bateni, M. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 600–624. Springer, Heidelberg (2007)",
		"30. Wile, D.: Abstract syntax from concrete syntax. In: Proceedings, International Conference on Software Engineering (ICSE 1997), pp. 472–480. ACM Press, New York (1997)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["autom", "co", "evolut", "of", "gmf", "editor", "model"],
	"tag": ["automation", "co-evolution", "editing", "modelling"],
	"title": "Automated Co-evolution of GMF Editor Models",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}