{
	"author": ["Sebastián González", "Nicolás Cardozo", "Kim Mens", "Alfredo Cádiz", "Jean-Christophe Libbrecht", "Julien Goffaux"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/GonzalezCMCLG10",
	"doi": "10.1007/978-3-642-19440-5_15",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_15",
	"isbn": "978-3-642-19439-9",
	"pages": "246-265",
	"past": [
		"1. Appeltauer, M., Hirschfeld, R., Haupt, M., Masuhara, H.: ContextJ: Context- oriented programming for Java. Computer Software of The Japan Society for Soft- ware Science and Technology (June 2010)",
		"2. Bobrow, D., DeMichiel, L., Gabriel, R., Keene, S., Kiczales, G., Moon, D.: Common Lisp Object System specification. Lisp and Symbolic Computation 1(3/4), 245–394 (1989)",
		"3. Cetina, C., Haugen, O., Zhang, X., Fleurey, F., Pelechano, V.: Strategies for vari- ability transformation at run time. In: Proceedings of the International Software Product Line Conference, pp. 61–70. Carnegie Mellon University, Pittsburgh (2009)",
		"4. Costanza, P., Hirschfeld, R.: Language constructs for context-oriented program- ming: an overview of ContextL. In: Proceedings of the Dynamic Languages Sym- posium, pp. 1–10. ACM Press, New York (2005); co-located with OOPSLA 2005",
		"5. Desmet, B., Vallejos, J., Costanza, P., Kantarcioglu, M., D’Hondt, T.: Context- oriented domain analysis. In: Kokinov, B., Richardson, D.C., Roth-Berghofer, T.R., Vieu, L. (eds.) CONTEXT 2007. LNCS (LNAI), vol. 4635, pp. 178–191. Springer, Heidelberg (2007)",
		"6. Garlan, D., Cheng, S.W., Huang, A.C., Schmerl, B., Steenkiste, P.: Rainbow: Architecture-based self-adaptation with reusable infrastructure. Computer 37(10), 46–54 (2004)",
		"7. Gonz´ alez, S., Denker, M., Mens, K.: Transactional contexts: Harnessing the power of context-oriented reflection. In: International Workshop on Context-Oriented Pro- gramming, July 7, pp. 1–6. ACM Press, New York (2009)",
		"8. Gonz´ alez, S., Mens, K., C´ adiz, A.: Context-Oriented Programming with the Am- bient Object System. Journal of Universal Computer Science 14(20), 3307–3332 (2008)",
		"9. Gonz´ alez, S., Mens, K., Heymans, P.: Highly dynamic behaviour adaptability through prototypes with subjective multimethods. In: Proceedings of the Dynamic Languages Symposium, pp. 77–88. ACM Press, New York (2007)",
		"10. Hirschfeld, R., Costanza, P., Haupt, M.: An introduction to context-oriented pro- gramming with contextS. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) GTTSE 2007. LNCS, vol. 5235, pp. 396–407. Springer, Heidelberg (2008)",
		"11. Kang, K.C., Cohen, S.G., Hess, J.A., Novak, W.E., Peterson, A.S.: Feature-oriented domain analysis (foda) feasibility study. Tech. Rep. CMU/SEI-90-TR-21, Carnegie- Mellon University Software Engineering Institute (November 1990)",
		"12. Lee, J., Kang, K.C.: A feature-oriented approach to developing dynamically recon- figurable products in product line engineering. In: Proceedings of the International Software Product Line Conference, pp. 131–140. IEEE Computer Society Press, Los Alamitos (2006)",
		"13. Libbrecht, J.C., Goffaux, J.: Subjective-C: Enabling Context-Aware Programming on iPhones. Master’s thesis, Ecole Polytechnique de Louvain, UCLouvain (June 2010)",
		"14. von Löwis, M., Denker, M., Nierstrasz, O.: Context-oriented programming: Beyond layers. In: Proceedings of the 2007 International Conference on Dynamic languages, pp. 143–156. ACM Press, New York (2007)",
		"15. Pohl, K., Böckle, G., van der Linden, F.: Software Product Line Engineering: Foun- dations, Principles and Techniques. Springer, Heidelberg (2005)",
		"16. Popovici, A., Gross, T., Alonso, G.: Dynamic weaving for aspect-oriented program- ming. In: Proceedings of the International Conference on Aspect-Oriented Software Development, pp. 141–147. ACM Press, New York (2002)",
		"17. Smith, R.B., Ungar, D.: A simple and unifying approach to subjective objects. Theory and Practice of Object Systems 2(3), 161–178 (1996)",
		"18. Vallejos, J., Gonz´ alez, S., Costanza, P., De Meuter, W., D’Hondt, T., Mens, K.: Predicated generic functions. In: Baudry, B., Wohlstadter, E. (eds.) SC 2010. LNCS, vol. 6144, pp. 66–81. Springer, Heidelberg (2010)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["subject", "c", "bring", "context", "to", "mobil", "platform", "program"],
	"tag": ["framework", "mobile", "named", "programming"],
	"title": "Subjective-C — Bringing Context to Mobile Platform Programming",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}