{
	"author": ["Christoff Bürger", "Sven Karol", "Christian Wende", "Uwe Aßmann"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/BurgerKWA10",
	"doi": "10.1007/978-3-642-19440-5_3",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_3",
	"isbn": "978-3-642-19439-9",
	"pages": "22-41",
	"past": [
		"1. Selic, B.: The Theory and Practice of Modeling Language Design for Model-Based Software Engineering – A Personal Perspective. In: Lämmel, R. (ed.) GTTSE 2009. LNCS, vol. 6491, pp. 290–321. Springer, Heidelberg (2011)",
		"2. Steinberg, D., Budinsky, F., Paternostro, M., Merks, E.: EMF – Eclipse Modeling Frame- work, 2nd edn. Addison-Wesley, Reading (2008)",
		"3. Hedin, G.: Reference Attributed Grammars. Informatica (Slovenia) 24(3), 301–317 (2000)",
		"4. Knuth, D.E.: Semantics of Context-Free Languages. Theory of Computing Systems 2(2), 127–145 (1968)",
		"5. Ekman, T., Hedin, G.: The JastAdd system — modular extensible compiler construction. Science of Computer Programming 69(1-3), 14–26 (2007)",
		"6. ATLAS Group: ATLAS Transformation Language (ATL) User Guide (2006), http://wiki.eclipse.org/ATL/User_Guide",
		"7. Efftinge, S., et al.: openArchitectureWare User Guide v.4.3.1 (2008), http://www.openarchitectureware.org/pub/documentation/4.3.1/",
		"8. Oldevik, J.: MOFScript User Guide v.0.8 (2009), http://www.eclipse.org/gmt/mofscript/doc/ MOFScript-User-Guide-0.8.pdf Reference Attribute Grammars for Metamodel Semantics 41",
		"9. Heidenreich, F., Johannes, J., Karol, S., Seifert, M., Wende, C.: Derivation and Refinement of Textual Syntax for Models. In: Paige, R.F., Hartman, A., Rensink, A. (eds.) ECMDA-FA 2009. LNCS, vol. 5562, pp. 114–129. Springer, Heidelberg (2009)",
		"10. Krahn, H., Rumpe, B., Völkel, S.: MontiCore: Modular Development of Textual Domain Specific Languages. In: TOOLS 2008 (Objects, Components, Models and Patterns). LNBIP, vol. 11, pp. 297–315. Springer, Heidelberg (2008)",
		"11. Efftinge, S., Völter, M.: oAW xText: A framework for textual DSLs. In: Workshop on Mod- eling Symposium at Eclipse Summit (2006)",
		"12. Kolovos, D.S.: Editing EMF models with Exeed (EXtended Emf EDitor) (2007), http://www.eclipse.org/gmt/epsilon/doc/Exeed.pdf",
		"13. Ekman, T.: Extensible Compiler Construction. PhD thesis, University of Lund (2006)",
		"14. Börger, E., Stark, R.F.: Abstract State Machines: A Method for High-Level System Design and Analysis. Springer, Heidelberg (2003)",
		"15. Vogt, H.H., Swierstra, D., Kuiper, M.F.: Higher Order Attribute Grammars. In: PLDI 1989, pp. 131–145. ACM, New York (1989)",
		"16. OMG: Object constraint language, version 2.2 (2010), http://www.omg.org/spec/OCL/2.2/",
		"17. Farrow, R.: Automatic Generation of Fixed-Point-Finding Evaluators for Circular, but Well- defined, Attribute Grammars. In: SIGPLAN 1986, pp. 85–98. ACM, New York (1986)",
		"18. Boyland, J.T.: Remote attribute grammars. Journal of the ACM 52(4), 627–687 (2005)",
		"19. Magnusson, E.: Object-Oriented Declarative Program Analysis. PhD thesis, University of Lund (2007)",
		"20. Kiczales, G., Hilsdale, E., Hugunin, J., Kersten, M., Palm, J., Griswold, W.G.: An Overview of AspectJ. In: Lee, S.H. (ed.) ECOOP 2001. LNCS, vol. 2072, pp. 327–353. Springer, Hei- delberg (2001)",
		"21. Bürger, C., Karol, S.: Towards Attribute Grammars for Metamodel Semantics. Technical report, Technische Universität Dresden (2010) ISSN 1430-211X",
		"22. Hedin, G.: Generating Language Tools with JastAdd. In: Lämmel, R. (ed.) GTTSE 2009. LNCS, vol. 6491. Springer, Heidelberg (2011)",
		"23. Reps, T., Teitelbaum, T., Demers, A.: Incremental Context-Dependent Analysis for Language-Based Editors. ACM (TOPLAS) 5(3), 449–477 (1983)",
		"24. Maddox III, W.H.: Incremental Static Semantic Analysis. PhD thesis, University of Califor- nia at Berkeley (1997)",
		"25. Goldschmidt, T., Becker, S., Uhl, A.: Classification of Concrete Textual Syntax Mapping Approaches. In: Schieferdecker, I., Hartman, A. (eds.) ECMDA-FA 2008. LNCS, vol. 5095, pp. 169–184. Springer, Heidelberg (2008)",
		"26. Nilsson-Nyman, E., Hedin, G., Magnusson, E., Ekman, T.: Declarative Intraprocedural Flow Analysis of Java Source Code. Electron. Notes Theor. Comput. Sci. 238(5), 155–171 (2009)",
		"27. Muller, P., Fleurey, F., Jézéquel, J.: Weaving Executability into Object-Oriented Meta- languages. In: Briand, L.C., Williams, C. (eds.) MoDELS 2005. LNCS, vol. 3713, pp. 264– 278. Springer, Heidelberg (2005)",
		"28. Nagl, M. (ed.): Building Tightly Integrated Software Development Environments: The IPSEN Approach. LNCS, vol. 1170. Springer, Heidelberg (1996)",
		"29. Nickel, U., Niere, J., Zündorf, A.: The FUJABA environment. In: ICSE 2000, pp. 742–745. ACM, New York (2000)",
		"30. Amelunxen, C., Königs, A., Rötschke, T., Schürr, A.: MOFLON: A Standard-Compliant Metamodeling Framework with Graph Transformations. In: Rensink, A., Warmer, J. (eds.) ECMDA-FA 2006. LNCS, vol. 4066, pp. 361–375. Springer, Heidelberg (2006)",
		"31. Chen, K., Sztipanovits, J., Abdelwalhed, S., Jackson, E.K.: Semantic Anchoring with Model Transformations. In: Hartman, A., Kreische, D. (eds.) ECMDA-FA 2005. LNCS, vol. 3748, pp. 115–129. Springer, Heidelberg (2005)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["refer", "attribut", "grammar", "for", "metamodel", "semant"],
	"tag": ["attribute grammar", "metamodelling", "semantics"],
	"title": "Reference Attribute Grammars for Metamodel Semantics",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}