{
	"author": ["Vadim Zaytsev", "Ralf Lämmel"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/ZaytsevL10",
	"doi": "10.1007/978-3-642-19440-5_13",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_13",
	"isbn": "978-3-642-19439-9",
	"pages": "206-225",
	"past": [
		"[ABC + 01] Ausbrooks, R., Buswell, S., Carlisle, D., Dalmas, S., Devitt, S., Diaz, A., Froumentin, M., Hunter, R., Ion, P., Kohlhase, M., Miner, R., Pop- pelier, N., Smith, B., Soiffer, N., Sutor, R., Watt, S.: Mathematical Markup Language (MathML) Version 2.0. W3C Recommendation, 2nd edn (2001) A Unified Format for Language Documents 223",
		"[Bac60] Backus, J.W.: The Syntax and Semantics of the Proposed International Algebraic Language of the Zurich ACM-GAMM Conference. In: de Pic- ciotto, S. (ed.) Proceedings of the International Conference on Informa- tion Processing, Unesco, Paris, pp. 125–131 (1960)",
		"[BBC + 07] Berglund, A., Boag, S., Chamberlin, D., Fern´ andez, M., Kay, M., Robie, J., Sim´ eon, J.: XML Path Language (XPath) 2.0. W3C Recommendation (January 23, 2007), www.w3.org/TR/2007/REC-xpath20-20070123",
		"[BBG + 63] Backus, J.W., Bauer, F.L., Green, J., Katz, C., McCarthy, J., Naur, P., Perlis, A.J., Rutishauser, H., Samelson, K., Vauquois, B., Wegstein, J.H., van Wijngaarden, A., Woodger, M.: Revised Report on the Algorithmic Language ALGOL 60. Numerische Mathematik 4, 420–453 (1963)",
		"[Bru05] Brukardt, R.: ISO/IEC JTC1/SC22/WG9 Document N465—Report on “Grammar Engineering” (2005)",
		"[CD99] Clark, J., DeRose, S.: XML Path Language (XPath) 1.0. W3C Recom- mendation (November 16, 1999), http://www.w3.org/TR/1999/REC-xpath-19991116",
		"[ECM06] ECMA-334 Standard. C# Language Specification, 4th edn. (June 2006), http://www.ecma-international.org/publications/standards/ Ecma-334.htm",
		"[GHJV95] Gamma, E., Helm, R., Johnson, R., Vlissides, J.: Design Patterns: Ele- ments of Reusable Object-Oriented Software. Addison-Wesley, Reading (1995)",
		"[IBM03] IBM. Informix 4GL Reference Manual, 7.32 edn. (March 2003)",
		"[ISO02] ISO/IEC 1989:2002. Information Technology—Programming Languages—COBOL (2002)",
		"[ISO05] ISO/IEC 9899:TC2. Information Technology—Programming Languages—C, Committee Draft WG14/N1124 (2005)",
		"[ISO07] ISO/IEC 14882. Information Technology—Programming Languages— C++, Committee Draft WG21/N2315, 2007. Accessed in (Septem- ber 2010), http://www.open-std.org/JTC1/SC22/WG21/docs/papers/ 2007/n2315.pdf",
		"[ISO08] ISO/IEC N2723=08-0233. Working Draft, Standard for Programming Language C++ (2008)",
		"[KDM09] Object Management Group. Knowledge Discovery Metamodel (KDM), 1.1 edn. (January 2009), http://www.omg.org/spec/KDM/1.1",
		"[Mic03] Microsoft .NET Framework Developer Center. ECMA and ISO/IEC C# and Common Language Infrastructure Standards and mirror sites (2003), http://msdn.microsoft.com/netframework/ecma",
		"[MIL84] MIL–STD–1589C. Military Standard Jovial (J73) (July 1984)",
		"[MOF06] Object Management Group. Meta-Object Facility (MOF TM ) Core Spec- ification, 2.0 edn. (January 2006), http://omg.org/spec/MOF/2.0",
		"[OAS07] OASIS. DITA Version 1.1 Language Specification Approved as an OASIS Standard. Committee Specification 01 (May 31, 2007), http://docs.oasis-open.org/dita/v1.1/CS01/langspec",
		"[Rag97] Raggett, D.: HTML 3.2 Reference Specification. W3C Recommendation (January 14, 1997), http://www.w3.org/TR/REC-html32",
		"[SBV08] Object Management Group. Semantics of Business Vocabulary and Rules (SBVR), 1.0 edn. (January 2008), http://www.omg.org/spec/SBVR/1.0/ 224 V. Zaytsev and R. L¨ ammel",
		"[Sha97] Shan, Y.-P., et al.: NCITS J20 DRAFT of ANSI Smalltalk Stan- dard, Revision 1.9 (December 1997), http://wiki.squeak.org/squeak/ uploads/172/standard v1 9-indexed.pdf (accessed in June 2007)",
		"[W3C] Software Language Processing Suite: Mapping Spec Schema to LDF, http://slps.sf.net/w3c",
		"[WM99] Walsh, N., Meullner, L.: DocBook: The Definitive Guide. O’Reilly, Se- bastopol (1999)",
		"[Zay09] Zaytsev, V.: XBGF Manual: BGF Transformation Operator Suite v.1.0 (August 2009), http://slps.sf.net/xbgf",
		"[BM06] Bayer, J., Muthig, D.: A View-Based Approach for Improving Software Documentation Practices. In: Proceedings of the 13th Annual IEEE In- ternational Symposium and Workshop on Engineering of Computer Based Systems (ECBS), Washington, DC, USA, 2006, pp. 269–278. IEEE Com- puter Society, Los Alamitos (2006)",
		"[DMW05] Davison, G., Murphy, S., Wong, R.: The use of eBooks and interactive mul- timedia as alternative forms of technical documentation. In: Proceedings of the 23rd Annual International Conference on Design of Communication (SIGDOC), pp. 108–115. ACM, New York (2005)",
		"[Fav05] Favre, J.-M.: Languages Evolve Too! Changing the Software Time Scale. In: IEEE (ed.) 8th Interntational Workshop on Principles of Software Evo- lution, IWPSE (2005)",
		"[HR07] Haramundanis, K., Rowland, L.: Experience Paper: a Content Reuse Docu- mentation Design Experience. In: Proceedings of the 25th Annual ACM In- ternational Conference on Design of Communication (SIGDOC), pp. 229– 233. ACM, New York (2007)",
		"[Knu84] Knuth, D.E.: Literate Programming. The Computer Journal 27(2), 97–111 (1984)",
		"[KZ05] Klusener, S., Zaytsev, V.: ISO/IEC JTC1/SC22 Document N3977— Language Standardization Needs Grammarware (2005), http://www.open-std.org/jtc1/sc22/open/n3977.pdf",
		"[L¨ am05] L¨ ammel, R.: The Amsterdam Toolkit for Language Archaeology. Electronic Notes in Theoretical Computer Science (ENTCS) 137(3), 43–55 (2005); Workshop on Metamodels, Schemas and Grammars for Reverse Engineer- ing (ATEM 2004)",
		"[LZ09] L¨ ammel, R., Zaytsev, V.: An introduction to grammar convergence. In: Leuschel, M., Wehrheim, H. (eds.) IFM 2009. LNCS, vol. 5423, pp. 246– 260. Springer, Heidelberg (2009), http://dx.doi.org/10.1007/978-3-642-00255-7_17",
		"[LZ10] L¨ ammel, R., Zaytsev, V.: Recovering Grammar Relationships for the Java Language Specification. Software Quality Journal, SCAM Special Issue (November 2010), http://dx.doi.org/10.1007/s11219-010-9116-5",
		"[RML98] Reiter, E., Mellish, C., Levine, J.: Automatic Generation of Technical Doc- umentation. Readings in Intelligent User Interfaces, 141–156 (1998)",
		"[SWJF09] Sch¨ onberg, C., Weitl, F., Jakˇ si´ c, M., Freitag, B.: Logic-based Verification of Technical Documentation. In: Proceedings of the 9th ACM Symposium on Document Engineering, pp. 251–252. ACM, New York (2009) A Unified Format for Language Documents 225",
		"[TL08] Tombre, K., Lamiroy, B.: Pattern Recognition Methods for Querying and Browsing Technical Documentation. In: Ruiz-Shulcloper, J., Kropatsch, W.G. (eds.) CIARP 2008. LNCS, vol. 5197, pp. 504–518. Springer, Heidelberg (2008)",
		"[Wai02] Waite, B.: Consequences of the Engineering Approach to Technical Writ- ing. ACM Journal of Computer Documentation (JCD) 26(1), 22–26 (2002)",
		"[Wei02] Weiss, E.H.: Egoless Writing: Improving Quality by Replacing Artistic Im- pulse with Engineering Discipline. ACM Journal of Computer Documen- tation (JCD) 26(1), 3–10 (2002)",
		"[Zay10a] Zaytsev, V.: Recovery, Convergence and Documentation of Languages. PhD thesis, Vrije Universiteit, Amsterdam, The Netherlands (October 2010), http://grammarware.net/text/2010/zaytsev-thesis.pdf",
		"[Zay10b] Zaytsev, V.: Language convergence infrastructure. In: L¨ ammel, R. (ed.) GTTSE 2009. LNCS, vol. 6491, pp. 481–497. Springer, Heidelberg (2011)"
	],
	"present": [
		"keyword:language documentation",
		"keyword:language document engineering",
		"keyword:grammar engineering",
		"keyword:software language engineering"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["a", "unifi", "format", "for", "languag", "document"],
	"tag": ["documentation"],
	"title": "A Unified Format for Language Documents",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}