{
	"author": ["Markus Herrmannsdörfer", "Sander Vermolen", "Guido Wachsmuth"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/HerrmannsdoerferVW10",
	"doi": "10.1007/978-3-642-19440-5_10",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_10",
	"isbn": "978-3-642-19439-9",
	"pages": "163-182",
	"past": [
		"1. Banerjee, J., Kim, W., Kim, H.J., Korth, H.F.: Semantics and implementation of schema evolution in object-oriented databases. SIGMOD Rec. 16(3), 311–322 (1987)",
		"2. Becker, S., Goldschmidt, T., Gruschko, B., Koziolek, H.: A process model and clas- sification scheme for semi-automatic meta-model evolution. In: Proc. 1st Workshop MDD, SOA und IT-Management (MSI 2007), pp. 35–46. GiTO-Verlag (2007)",
		"3. Br` eche, P.: Advanced primitives for changing schemas of object databases. In: Con- stantopoulos, P., Vassiliou, Y., Mylopoulos, J. (eds.) CAiSE 1996. LNCS, vol. 1080, pp. 476–495. Springer, Heidelberg (1996)",
		"4. Burger, E., Gruschko, B.: A Change Metamodel for the Evolution of MOF-Based Metamodels. In: Modellierung 2010. GI-LNI, vol. P-161 (2010)",
		"5. Casais, E.: Managing class evolution in object-oriented systems. In: Object- Oriented Software Composition, pp. 201–244. Prentice Hall, Englewood Cliffs (1995)",
		"6. Cicchetti, A., Ruscio, D.D., Eramo, R., Pierantonio, A.: Automating co-evolution in model-driven engineering. In: EDOC 2008: 12th International Enterprise Dis- tributed Object Computing Conference. IEEE, Los Alamitos (2008) 182 M. Herrmannsdoerfer, S.D. Vermolen, and G. Wachsmuth",
		"7. Claypool, K.T., Rundensteiner, E.A., Heineman, G.T.: ROVER: A framework for the evolution of relationships. In: Laender, A.H.F., Liddle, S.W., Storey, V.C. (eds.) ER 2000. LNCS, vol. 1920, pp. 893–917. Springer, Heidelberg (2000)",
		"8. Dig, D., Johnson, R.: How do APIs evolve? a story of refactoring. J. Softw. Maint. Evol. 18(2), 83–107 (2006)",
		"9. Favre, J.M.: Languages evolve too! changing the software time scale. In: IWPSE 2005: 8th International Workshop on Principles of Software Evolution, pp. 33–42 (2005)",
		"10. Fowler, M.: Refactoring: improving the design of existing code. Addison-Wesley Longman Publishing Co., Inc., Amsterdam (1999)",
		"11. Garc´ es, K., Jouault, F., Cointe, P., B´ ezivin, J.: Managing model adaptation by precise detection of metamodel changes. In: Paige, R.F., Hartman, A., Rensink, A. (eds.) ECMDA-FA 2009. LNCS, vol. 5562, pp. 34–49. Springer, Heidelberg (2009)",
		"12. Herrmannsdoerfer, M., Benz, S., Juergens, E.: Automatability of coupled evolution of metamodels and models in practice. In: Busch, C., Ober, I., Bruel, J.-M., Uhl, A., V¨ olter, M. (eds.) MODELS 2008. LNCS, vol. 5301, pp. 645–659. Springer, Heidelberg (2008)",
		"13. Herrmannsdoerfer, M., Benz, S., Juergens, E.: COPE - automating coupled evolu- tion of metamodels and models. In: Drossopoulou, S. (ed.) ECOOP 2009. LNCS, vol. 5653, pp. 52–76. Springer, Heidelberg (2009)",
		"14. Herrmannsdoerfer, M., Ratiu, D., Wachsmuth, G.: Language evolution in practice: The history of GMF. In: van den Brand, M., Gaˇ sevi´ c, D., Gray, J. (eds.) SLE 2009. LNCS, vol. 5969, pp. 3–22. Springer, Heidelberg (2010)",
		"15. L¨ ammel, R.: Grammar adaptation. In: Oliveira, J.N., Zave, P. (eds.) FME 2001. LNCS, vol. 2021, pp. 550–570. Springer, Heidelberg (2001)",
		"16. Lammel, R., Zaytsev, V.: Recovering grammar relationships for the Java language specification. In: SCAM 2009: Ninth IEEE International Working Conference on Source Code Analysis and Manipulation, pp. 178–186. IEEE, Los Alamitos (2009)",
		"17. Narayanan, A., Levendovszky, T., Balasubramanian, D., Karsai, G.: Automatic domain model migration to manage metamodel evolution. In: Schürr, A., Selic, B. (eds.) MODELS 2009. LNCS, vol. 5795, pp. 706–711. Springer, Heidelberg (2009)",
		"18. Object Management Group: Meta Object Facility (MOF) core specification version 2.0 (2006), http://www.omg.org/spec/MOF/2.0/",
		"19. Pons, A., Keller, R.: Schema evolution in object databases by catalogs. In: IDEAS 1997: International Database Engineering and Applications Symposium, pp. 368– 376 (1997)",
		"20. Rose, L.M., Paige, R.F., Kolovos, D.S., Polack, F.A.: An analysis of approaches to model migration. In: Models and Evolution (MoDSE-MCCM) Workshop (2009)",
		"21. Steinberg, D., Budinsky, F., Paternostro, M., Merks, E.: EMF: Eclipse Modeling Framework 2.0. Addison-Wesley, Reading (2009)",
		"22. Vermolen, S.D., Visser, E.: Heterogeneous coupled evolution of software languages. In: Busch, C., Ober, I., Bruel, J.-M., Uhl, A., V¨ olter, M. (eds.) MODELS 2008. LNCS, vol. 5301, pp. 630–644. Springer, Heidelberg (2008)",
		"23. Wachsmuth, G.: An adaptation browser for MOF. In: WRT 2001: First Workshop on Refactoring Tools, pp. 65–66 (2007)",
		"24. Wachsmuth, G.: Metamodel adaptation and model co-adaptation. In: Bateni, M. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 600–624. Springer, Heidelberg (2007)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["an", "extens", "catalog", "of", "oper", "for", "the", "coupl", "evolut", "of", "metamodel", "and", "model"],
	"tag": ["co-evolution", "evolution", "metamodelling", "modelling"],
	"title": "An Extensive Catalog of Operators for the Coupled Evolution of Metamodels and Models",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}