{
	"author": ["Arnaud Hubaux", "Quentin Boucher", "Herman Hartmann", "Raphaël Michel", "Patrick Heymans"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/HubauxBHMH10",
	"doi": "10.1007/978-3-642-19440-5_23",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_23",
	"isbn": "978-3-642-19439-9",
	"pages": "337-356",
	"past": [
		"1. Kang, K., Cohen, S., Hess, J., Novak, W., Peterson, S.: Feature-oriented domain analysis (foda) feasibility study. Technical Report CMU/SEI-90-TR-21, SEI, Carnegie Mellon Uni- versity (November 1990)",
		"2. Pohl, K., Bockle, G., van der Linden, F.: Software Product Line Engineering: Foundations, Principles and Techniques. Springer, Heidelberg (2005)",
		"3. Czarnecki, K., Helsen, S., Eisenecker, U.W.: Formalizing cardinality-based feature models and their specialization. Software Process: Improvement and Practice 10(1), 7–29 (2005)",
		"4. Schobbens, P.Y., Heymans, P., Trigaux, J.C., Bontemps, Y.: Generic semantics of feature di- agrams. Computer Networks, Special Issue on Feature Interactions in Emerging Application Domains, 38 (2006) Evaluating a Textual Feature Modelling Language 355",
		"5. pure-systems GmbH: Variant management with pure: variants. Technical White Paper (2006), http://www.pure-systems.com/fileadmin/downloads/ pv-whitepaper-en-04.pdf",
		"6. van Deursen, A., Klint, P.: Domain-specific language design requires feature descriptions. Journal of Computing and Information Technology 10, 2002 (2002)",
		"7. Batory, D.S.: Feature models, grammars, and propositional formulas. In: Obbink, H., Pohl, K. (eds.) SPLC 2005. LNCS, vol. 3714, pp. 7–20. Springer, Heidelberg (2005)",
		"8. Boucher, Q., Classen, A., Faber, P., Heymans, P.:Introducing TVL,a text-based feature mod- ellinglanguage. In: VaMoS 2010, Universityof Duisburg-Essen, pp. 159–162 (January 2010)",
		"9. Czarnecki, K.: From feature to concept modeling. In: VaMoS 2010, University of Duisburg- Essen, 11 Keynote (January 2010)",
		"10. Nestor, D., O’Malley, L., Sikora, E., Thiel, S.: Visualisationof variability in software product line engineering. In: VaMoS 2007 (2007)",
		"11. Cawley, C., Healy, P., Botterweck, G., Thiel, S.: Research tool to support feature configura- tion in software product lines. In: VaMoS 2010, University of Duisburg-Essen, pp. 179–182 (January 2010)",
		"12. Dordowsky, F., Hipp, W.: Adopting software product line principles to manage software variants in a complex avionics system. In: SPLC 2009, San Francisco, CA, USA, pp. 265– 274 (2009)",
		"13. Classen, A., Boucher, Q., Faber, P., Heymans, P.: The TVL Specification. Technical report, PReCISE Research Centre, Univ. of Namur (2009)",
		"14. Shull, F., Singer, J., Sjøberg, D.I.K.: Guide to Advanced Empirical Software Engineering. Springer-Verlag New York, Inc., Secaucus (2007)",
		"15. Schobbens, P.Y., Heymans, P., Trigaux, J.C., Bontemps, Y.: Feature Diagrams: A Survey and A Formal Semantics. In: RE 2006, pp. 139–148 (September 2006)",
		"16. Antkiewicz,M., Czarnecki, K.:Featureplugin: featuremodelingplug-in foreclipse. In:OOP- SLA 2004, pp. 67–72 (2004)",
		"17. Beuche, D.: Modeling and building software product lines with pure::variants. In: SPLC 2008: Proceedings of the 2008 12th International Software Product Line Conference, Wash- ington, DC, USA, p. 358. IEEE Computer Society, Los Alamitos (2008)",
		"18. Kästner, C., Thüm, T., Saake, G., Feigenspan, J., Leich, T., Wielgorz, F., Apel, S.: Fea- tureIDE: A tool framework for feature-oriented software development. In: Proceedings of ICSE 2009, pp. 311–320 (2009)",
		"19. Krueger, C.W.:Biglever software gearsand the 3-tieredspl methodology. In: OOPSLA2007: Companion to the 22nd ACM SIGPLAN Conference on Object-Oriented Programming Sys- tems and Applications Companion, pp. 844–845. ACM, New York (2007)",
		"20. Mendonca, M., Branco, M., Cowan, D.: S.p.l.o.t. - software product lines online tools. In: Proceedings of OOPSLA 2009, pp. 761–762 (2009)",
		"21. Mendonc ¸a, M.: Efficient Reasoning Techniques for Large Scale Feature Models. PhD thesis, University of Waterloo (2009)",
		"22. Reiser, M.O.: Core concepts of the compositional variability management framework (cvm). Technical report, Technische Universität Berlin (2009)",
		"23. Abele, A., Johansson, R., Lo, H., Papadopoulos, Y., Reiser, M.O., Servat, D., Torngren, M., Weber, M.: The cvm framework - a prototype tool for compositional variability man- agement. In: Proceedings of the Fourth International Workshop on Variability Modelling of Software-intensive Systems (VaMoS 2010), University of Duisburg-Essen, pp. 101–105 (January 2010)",
		"24. Benavides, D., Segura, S., Trinidad, P., Cortés, A.R.: Fama: Tooling a framework for the automated analysis of feature models. In: Proceedings of VaMoS 2007, pp. 129–134 (2007)",
		"25. Riebisch, M., Böllert, K., Streitferdt, D., Philippow, I.: Extending feature diagrams with uml multiplicities. In: IDPT 2002 (2002) 356 A. Hubaux et al.",
		"26. Czarnecki, K., Bednasch, T., Unger, P., Eisenecker, U.W.: Generative programming for em- bedded software: An industrial experience report. In: Batory, D., Blum, A., Taha, W. (eds.) GPCE 2002. LNCS, vol. 2487, pp. 156–172. Springer, Heidelberg (2002)",
		"27. Pratt, T.W.: Programming Languages: Design and Implementation, 2nd edn., 604 pages. Prentice-Hall, Englewood Cliffs (1984)",
		"28. Holtz, N., Rasdorf, W.: An evaluation of programming languages and language features for engineering software development. Engineering with Computers 3, 183–199 (1988)",
		"29. PloneGov. (June 2010), http://www.plonegov.org/",
		"30. Delannay, G., Mens, K., Heymans, P., Schobbens, P.Y., Zeippen, J.M.: Plonegov as an open source product line. In: OSSPL 2007, collocated with SPLC 2007 (2007)",
		"31. Hubaux, A., Heymans, P., Benavides, D.: Variability modelling challenges from the trenches of an open source product line re-engineering project. In: SPLC 2008, Limerick, Ireland, pp. 55–64 (2008)",
		"32. Unphon, H., Dittrich, Y., Hubaux, A.: Taking care of cooperation when evolving socially embedded systems: The plonemeeting case. In: CHASE 2009, collocated with ICSE 2009 (May 2009)",
		"33. Océ Software Laboratories, S.A (June 2010), http://www.osl.be/",
		"34. NXP Semiconductors (June 2010), http://www.nxp.com/",
		"35. Virage Logic (June 2010), http://www.viragelogic.com/",
		"36. Yin, R.K.: Case Study Research: Design and Methods, 3rd edn. Applied Social Research Methods, vol. 5. Sage Publications, Inc., Thousand Oaks (2002)",
		"37. Sangwan, S., Hian, C.K.: User-centered design: marketing implications from initial expe- rience in technology supported products. In: Press, I.C.S. (ed.) Engineering Management Conference, vol. 3, pp. 1042–1046 (2004)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["evalu", "a", "textual", "featur", "model", "languag", "four", "industri", "case", "studi"],
	"tag": ["case study", "feature model", "industrial", "modelling"],
	"title": "Evaluating a Textual Feature Modelling Language: Four Industrial Case Studies",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}