{
	"author": ["Antonio Cicchetti", "Davide Di Ruscio", "Romina Eramo", "Alfonso Pierantonio"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/CicchettiREP10",
	"doi": "10.1007/978-3-642-19440-5_11",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_11",
	"isbn": "978-3-642-19439-9",
	"pages": "183-202",
	"past": [
		"1. Schmidt, D.: Guest Editor’s Introduction: Model-Driven Engineering. Computer 39(2), 25– 31 (2006)",
		"2. Bézivin, J.: On the Unification Power of Models. Jour. on Software and Systems Modeling (SoSyM) 4(2), 171–188 (2005)",
		"3. Sendall, S., Kozaczynski, W.: Model Transformation: The Heart and Soul of Model-Driven Software Development. IEEE Software 20(5), 42–45 (2003)",
		"4. Stevens, P.: A Landscape of Bidirectional Model Transformations. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) GTTSE 2007. LNCS, vol. 5235, pp. 408–424. Springer, Heidelberg (2008)",
		"5. Xiong, Y., Song, H., Hu, Z., Takeichi, M.: Supporting parallel updates with bidirectional model transformations. In: Paige, R.F. (ed.) ICMT 2009. LNCS, vol. 5563, pp. 213–228. Springer, Heidelberg (2009)",
		"6. Object Management Group (OMG): MOF QVT Final Adopted Specification, OMG Adopted Specification ptc/05-11-01 (2005)",
		"7. Stevens, P.: Bidirectional model transformations in qvt: semantic issues and open questions. Software and Systems Modeling 8 (2009)",
		"8. Steven Witkop: MDA users’ requirements for QVT transformations. OMG document 05-02- 04 (2005)",
		"9. Czarnecki, K., Helsen, S.: Feature-based Survey of Model Transformation Approaches. IBM Systems J. 45(3) (June 2006)",
		"10. Czarnecki, K., Foster, J.N., Hu, Z., Lämmel, R., Schürr, A., Terwilliger, J.F.: Bidirectional Transformations: A Cross-Discipline Perspective. In: Paige, R.F. (ed.) ICMT 2009. LNCS, vol. 5563, pp. 260–283. Springer, Heidelberg (2009)",
		"11. Gelfond, M., Lifschitz, V.: The Stable Model Semantics for Logic Programming. In: Kowal- ski, R.A., Bowen, K. (eds.) Proceedings of the Fifth Int. Conf. on Logic Programming, pp. 1070–1080. The MIT Press, Cambridge (1988) 7 http://www.di.univaq.it/romina.eramo/JTL 202 A. Cicchetti et al.",
		"12. Chen, K., Sztipanovits, J., Abdelwalhed, S., Jackson, E.: Semantic Anchoring with Model Transformations. In: Hartman, A., Kreische, D. (eds.) ECMDA-FA 2005. LNCS, vol. 3748, pp. 115–129. Springer, Heidelberg (2005)",
		"13. Leone, N.,Pfeifer, G., Faber, W.,Eiter, T., Gottlob, G., Perri,S., Scarcello, F.: Thedlv system for knowledge representation and reasoning (2004)",
		"14. Hettel, T., Lawley, M., Raymond, K.: Model Synchronisation: Definitions for Round-Trip Engineering. In: Vallecillo, A., Gray, J., Pierantonio, A. (eds.) ICMT 2008. LNCS, vol. 5063, pp. 31–45. Springer, Heidelberg (2008)",
		"15. Konigs, A., Schurr, A.: Tool Integration with Triple Graph Grammars - A Survey. Electronic Notes in Theoretical Computer Science 148, 113–150 (2006)",
		"16. Tratt, L.: A change propagating model transformation language. Journal of Object Technol- ogy 7(3), 107–126 (2008)",
		"17. Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"18. Budinsky, F.,Steinberg,D.,Merks, E.,Ellersick,R.,Grose,T.:EclipseModeling Framework. Addison-Wesley, Reading (2003)",
		"19. Bézivin, J., Jouault, F., Rosenthal, P., Valduriez, P.: Modeling in the Large and Modeling in the Small. In: Aßmann, U., Liu, Y., Rensink, A. (eds.) MDAFA 2003. LNCS, vol. 3599, pp. 33–46. Springer, Heidelberg (2005)",
		"20. Van Paesschen, E., Kantarcioglu, M., D’Hondt, M.: SelfSync: A Dynamic Round-Trip Engi- neering Environment. In: Briand, L.C.,Williams,C. (eds.) MoDELS 2005. LNCS,vol. 3713, pp. 633–647. Springer, Heidelberg (2005)",
		"21. Giese, H., Wagner, R.: Incremental Model Synchronization with Triple Graph Grammars. In: Wang, J., Whittle, J., Harel, D., Reggio, G. (eds.) MoDELS 2006. LNCS, vol. 4199, pp. 543–557. Springer, Heidelberg (2006)",
		"22. Mu, S.-C., Hu, Z., Takeichi, M.: An Injective Language for Reversible Computation. In: Kozen, D., Shankland, C. (eds.) MPC 2004. LNCS, vol. 3125, pp. 289–313. Springer, Hei- delberg (2004)",
		"23. Foster, J., Greenwald, M., Moore, J., Pierce, B., Schmitt, A.: Combinators for bidirectional tree transformations: A linguistic approach to the view-update problem. ACM Trans. Pro- gram. Lang. Syst. 29(3) (2007)",
		"24. Mens, T., Gorp, P.V.: A Taxonomy of Model Transformation. Electr. Notes Theor. Comput. Sci. 152, 125–142 (2006)",
		"25. Hearnden, D., Lawley, M., Raymond, K.: Incremental Model Transformation for the Evolu- tion of Model-Driven Systems. In: Wang, J., Whittle, J., Harel, D., Reggio, G. (eds.) MoD- ELS 2006. LNCS, vol. 4199, pp. 321–335. Springer, Heidelberg (2006)",
		"26. Balogh, Z., Varró, D.: Model transformation by example using inductive logic programming. Software and Systems Modeling (2009)",
		"27. Compuware and Sun: XMOF queries, views and transformations on models using MOF, OCL and patterns, OMG Document ad/2003-08-07 (2003)",
		"28. Cicchetti, A., Di Ruscio, D., Eramo, R.: Towards Propagation of Changes by Model Ap- proximations. In: 10th IEEE Int. Enterprise Distributed Object Computing Conf. Workshops (EDOCW 2006), vol. 0, p. 24 (2006)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["jtl", "a", "bidirect", "and", "chang", "propag", "transform", "languag"],
	"tag": ["bidirectional", "model transformation", "named"],
	"title": "JTL: A Bidirectional and Change Propagating Transformation Language",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}