{
	"author": ["Markus Herrmannsdörfer", "Daniel Ratiu", "Maximilian Koegel"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/HerrmannsdoerferRK10",
	"doi": "10.1007/978-3-642-19440-5_5",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_5",
	"isbn": "978-3-642-19439-9",
	"pages": "62-81",
	"past": [
		"1. Atkinson, C., Kühne, T.: A tour of language customization concepts. Advances in Computers 70, 105–161 (2007)",
		"2. Bosch, J.: Design patterns as language constructs. JOOP - Journal of Object- Oriented Programming 11(2), 18–32 (1998)",
		"3. Gil, J., Maman, I.: Micro patterns in Java code. In: OOPSLA 2005: Conference on Object-Oriented Programming, Systems, Languages, and Applications, pp. 97–116. ACM, New York (2005)",
		"4. Gronback, R.C.: Eclipse Modeling Project: A Domain-Specific Language (DSL) Toolkit. Addison-Wesley, Reading (2009)",
		"5. Hage, J., van Keeken, P.: Neon: A library for language usage analysis. In: Gaˇ sevi´ c, D., L¨ ammel, R., Van Wyk, E. (eds.) SLE 2008. LNCS, vol. 5452, pp. 35–53. Springer, Heidelberg (2009)",
		"6. Henderson-Sellers, B., Gonzalez-Perez, C.: Uses and abuses of the stereotype mech- anism in UML 1.x and 2.0. In: Wang, J., Whittle, J., Harel, D., Reggio, G. (eds.) MoDELS 2006. LNCS, vol. 4199, pp. 16–26. Springer, Heidelberg (2006)",
		"7. Herrmannsdoerfer, M., Benz, S., Juergens, E.: COPE - automating coupled evolu- tion of metamodels and models. In: Drossopoulou, S. (ed.) ECOOP 2009. LNCS, vol. 5653, pp. 52–76. Springer, Heidelberg (2009)",
		"8. Karsai, G., Krahn, H., Pinkernell, C., Rumpe, B., Schindler, M., V¨ olkl, S.: De- sign guidelines for domain specific languages. In: The 9th OOPSLA Workshop on Domain-Specific Modeling (2009)",
		"9. Kelly, S., Pohjonen, R.: Worst practices for domain-specific modeling. IEEE Soft- ware 26(4), 22–29 (2009)",
		"10. L¨ ammel, R., Kitsis, S., Remy, D.: Analysis of XML schema usage. In: Conference Proceedings XML 2005 (November 2005)",
		"11. L¨ ammel, R., Pek, E.: Vivisection of a non-executable, domain-specific language; understanding (the usage of) the P3P language. In: ICPC 2010: 18th International Conference on Program Comprehension. IEEE, Los Alamitos (2010)",
		"12. Lange, C.F.J., DuBois, B., Chaudron, M.R.V., Demeyer, S.: An experimental inves- tigation of UML modeling conventions. In: Wang, J., Whittle, J., Harel, D., Reggio, G. (eds.) MoDELS 2006. LNCS, vol. 4199, pp. 27–41. Springer, Heidelberg (2006)",
		"13. Li, X., Shannon, D., Walker, J., Khurshid, S., Marinov, D.: Analyzing the uses of a software modeling tool. In: LDTA 2006: 6th Workshop on Language Descriptions, Tools, and Applications, pp. 3–18. Elsevier, Amsterdam (2006)",
		"14. Object Management Group: Meta Object Facility (MOF) core specification version 2.0 (2006), http://www.omg.org/spec/MOF/2.0/",
		"15. Paige, R.F., Ostroff, J.S., Brooke, P.J.: Principles for modeling language design. Information and Software Technology 42(10), 665–675 (2000)",
		"16. Sen, S., Moha, N., Baudry, B., J´ ez´ equel, J.-M.: Meta-model pruning. In: Schürr, A., Selic, B. (eds.) MODELS 2009. LNCS, vol. 5795, pp. 32–46. Springer, Heidelberg (2009)",
		"17. Singer, J., Brown, G., Lujan, M., Pocock, A., Yiapanis, P.: Fundamental nano- patterns to characterize and classify java methods. In: LDTA 2009: 9th Workshop on Language Descriptions, Tools and Applications, pp. 204–218 (2009)",
		"18. Steinberg, D., Budinsky, F., Paternostro, M., Merks, E.: EMF: Eclipse Modeling Framework 2.0. Addison-Wesley, Reading (2009)",
		"19. Tolvanen, J.P.: Incremental Method Engineering with Modeling Tools: Theoretical Principles and Empirical Evidence. Ph.D. thesis, University of Jyv¨ askyl¨ a (1998)",
		"20. Wachsmuth, G.: Metamodel adaptation and model co-adaptation. In: Bateni, M. (ed.) ECOOP 2007. LNCS, vol. 4609, pp. 600–624. Springer, Heidelberg (2007)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["metamodel", "usag", "analysi", "for", "identifi", "metamodel", "improv"],
	"tag": ["analysis", "identification", "metamodelling"],
	"title": "Metamodel Usage Analysis for Identifying Metamodel Improvements",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}