{
	"author": ["Kacper Bak", "Krzysztof Czarnecki", "Andrzej Wasowski"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/BakCW10",
	"doi": "10.1007/978-3-642-19440-5_7",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_7",
	"isbn": "978-3-642-19439-9",
	"pages": "102-122",
	"past": [
		"1. Anastasakis, K., Bordbar, B., Georg, G., Ray, I.: On challenges of model transfor- mation from UML to Alloy. Software and Systems Modeling 9(1) (2008)",
		"2. Antkiewicz, M., Czarnecki, K., Stephan, M.: Engineering of framework-specific modeling languages. IEEE TSE 35(6) (2009)",
		"3. Asikainen, T., Männistö, T.: Nivel: a metamodelling language with a formal se- mantics. Software and Systems Modeling 8(4) (2009)",
		"4. Asikainen, T., Männistö, T., Soininen, T.: A unified conceptual foundation for feature modelling. In: SPLC 2006 (2006)",
		"5. Asikainen, T., Männistö, T., Soininen, T.: Kumbang: A domain ontology for mod- elling variability in software product families. Adv. Eng. Inform. 21(1) (2007) Feature and Meta-Models in Clafer: Mixed, Specialized, and Coupled 121",
		"6. Bart Veer, J.D.: The eCos Component Writer’s Guide (2000)",
		"7. Benavides, D., Segura, S., Ruiz-Cortés, A.: Automated analysis of feature models 20 years later: a literature review. Information Systems 35(6) (2010)",
		"8. Boucher, Q., Classen, A., Faber, P., Heymans, P.: Introducing TVL, a text-based feature modelling language. In: VaMoS 2010 (2010)",
		"9. Cabot, J., Clarisó, R., Riera, D.: Verification of UML/OCL Class Diagrams Using Constraint Programming. In: MoDeVVA 2008 (2008)",
		"10. Cariou, E., Belloir, N., Barbier, F., Djemam, N.: Ocl contracts for the verification of model transformations. In: Schürr, A., Selic, B. (eds.) MODELS 2009. LNCS, vol. 5795. Springer, Heidelberg (2009)",
		"11. Clauß, M., Jena, I.: Modeling variability with UML. In: Dannenberg, R.B. (ed.) GCSE 2001. LNCS, vol. 2186. Springer, Heidelberg (2001)",
		"12. Czarnecki, K., Pietroszek, K.: Verifying feature-based model templates against well-formedness ocl constraints. In: GPCE 2006 (2006)",
		"13. Czarnecki, K., Antkiewicz, M.: Mapping features to models: A template approach based on superimposed variants. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 422–437. Springer, Heidelberg (2005)",
		"14. Czarnecki, K., Bednasch, T., Unger, P., Eisenecker, U.: Generative programming for embedded software: An industrial experience report. In: Batory, D., Blum, A., Taha, W. (eds.) GPCE 2002. LNCS, vol. 2487. Springer, Heidelberg (2002)",
		"15. Czarnecki, K., Helsen, S., Eisenecker, U.: Formalizing cardinality-based feature models and their specialization. SPIP 10(1) (2005)",
		"16. Czarnecki, K., Kim, C.H.: Cardinality-based feature modeling and constraints: A progress report. In: OOPSLA 2005 Workshop on Software Factories (2005)",
		"17. Gheyi, R., Massoni, T., Borba, P.: A theory for feature models in Alloy. In: First Alloy Workshop (2006)",
		"18. Heidenreich, F., Kopcsek, J., Wende, C.: FeatureMapper: Mapping Features to Models. In: ICSE 2008 (2008)",
		"19. Jackson, D.: Software Abstractions: Logic, Language, and Analysis. The MIT Press, Cambridge (2006)",
		"20. Janota, M., Botterweck, G.: Formal approach to integrating feature and architec- ture models. In: Fiadeiro, J.L., Inverardi, P. (eds.) FASE 2008. LNCS, vol. 4961, pp. 31–45. Springer, Heidelberg (2008)",
		"21. Jouault, F., Bézivin, J.: KM3: a DSL for Metamodel Specification. In: IFIP 2006 (2006)",
		"22. Kang, K., Cohen, S., Hess, J., Nowak, W., Peterson, S.: Feature-oriented domain analysis (FODA) feasibility study. Tech. Rep. CMU/SEI-90-TR-21, CMU (1990)",
		"23. Kang, K.C.: FODA: Twenty years of perspective on feature modeling. In: VaMoS 2010 (2010)",
		"24. Kästner, C.: Virtual Separation of Concerns: Toward Preprocessors 2.0. Ph.D. the- sis, University of Magdeburg (2010)",
		"25. Lau, S.Q.: Domain Analysis of E-Commerce Systems Using Feature-Based Model Templates. Master’s thesis, University of Waterloo (2006)",
		"26. Le Berre, D., Rapicault, P.: Dependency management for the Eclipse ecosystem: Eclipse p2, metadata and resolution. In: IWOCE 2009 (2009)",
		"27. Mendonça, M., Branco, M., Cowan, D.: S.P.L.O.T. - Software Product Lines Online Tools. In: OOPSLA 2009 (2009)",
		"28. OMG: Meta Object Facility (MOF) Core Specification (2006)",
		"29. OMG: OMG Unified Modeling Language (2009)",
		"30. Shaikh, A., Clarisó, R., Wiil, U.K., Memon, N.: Verification-Driven Slicing of UML/OCL Models. In: ASE 2010 (2010) 122 K. Bąk, K. Czarnecki, and A. Wąsowski",
		"31. She, S., Lotufo, R., Berger, T., Wasowski, A., Czarnecki, K.: Variability model of the linux kernel. In: VaMoS 2010 (2010)",
		"32. Stephan, M., Antkiewicz, M.: Ecore.fmp: A tool for editing and instantiating class models as feature models. Tech. Rep. 2008-08, Univeristy of Waterloo (2008)",
		"33. Tartler, R., Sincero, J., Lohmann, D.: Dead or Alive: Finding Zombie Features in the Linux Kernel. In: FOSD 2009 (2009)",
		"34. Torlak, E., Jackson, D.: Kodkod: A relational model finder. In: Grumberg, O., Huth, M. (eds.) TACAS 2007. LNCS, vol. 4424, pp. 632–647. Springer, Heidelberg (2007)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["featur", "and", "meta", "model", "in", "clafer", "mix", "special", "and", "coupl"],
	"tag": ["metamodelling"],
	"title": "Feature and Meta-Models in Clafer: Mixed, Specialized, and Coupled",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}