{
	"author": ["Lennart C. L. Kats", "Karl Trygve Kalleberg", "Eelco Visser"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/KatsKV10",
	"doi": "10.1007/978-3-642-19440-5_22",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_22",
	"isbn": "978-3-642-19439-9",
	"pages": "327-336",
	"past": [
		"1. The interactive disambiguation project (2010), http://strategoxt.org/Spoofax/InteractiveDisambiguation",
		"2. Arnoldus, J., Bijpost, J., van den Brand, M.: Repleo: a syntax-safe template engine. In: GPCE, pp. 25–32 (2007)",
		"3. Batory, D., Lofaso, B., Smaragdakis, Y.: JTS: Tools for Implementing Domain-Specific Lan- guages. In: Conference on Software Reuse, p. 143 (1998)",
		"4. Bravenboer, M., Kalleberg, K.T., Vermaas, R., Visser, E.: Stratego/XT 0.17. A language and toolset for program transformation. SCP 72(1-2), 52–70 (2008)",
		"5. Bravenboer, M., Vermaas, R., Vinju, J.J., Visser, E.: Generalized type-based disambiguation of meta programs with concrete object syntax. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 157–172. Springer, Heidelberg (2005)",
		"6. Bravenboer, M., Visser, E.: Concrete syntax for objects: domain-specific language embed- ding and assimilation without restrictions. In: OOPSLA, pp. 365–383 (2004)",
		"7. Cordy, J.R., Halpern-Hamu, C.D., Promislow, E.: TXL: A rapid prototyping system for pro- gramming language dialects. Comp. Lang., Syst. & Struct. 16(1), 97–107 (1991)",
		"8. Huang, S.S., Zook, D., Smaragdakis, Y.: Domain-specific languages and program generation with Meta-AspectJ. Transactions on Software Engineering Methodology 18(2) (2008)",
		"9. Kats, L.C.L.,Bravenboer, M., Visser, E.: Mixing source and bytecode: a case for compilation by normalization. In: OOPSLA, pp. 91–108 (2008)",
		"10. Kats, L.C.L., Visser, E.: The Spoofax language workbench. Rules for declarative specifica- tion of languages and IDEs. In: OOPSLA, pp. 444–463 (2010)",
		"11. Lämmel, R.: Typed generic traversal with term rewriting strategies. Journal of Logic and Algebraic Programming 54(1), 1–64 (2003)",
		"12. van Deursen, A., Heering, J., Klint, P. (eds.): Language Prototyping. An Algebraic Specifi- cation Approach. AMAST Series in Computing, vol. 5. World Scientific, Singapore (1996)",
		"13. Vinju, J.J.: Type-driven automatic quotation of concrete object code in meta programs. In: Guelfi, N., Savidis, A. (eds.) RISE 2005. LNCS, vol. 3943, pp. 97–112. Springer, Heidelberg (2006)",
		"14. Visser, E.: Syntax Definition for Language Prototyping. PhD thesis, University of Amster- dam (September 1997)",
		"15. Visser, E.: Meta-programming with concrete object syntax. In: Batory, D., Blum, A., Taha, W. (eds.) GPCE 2002. LNCS, vol. 2487, pp. 299–315. Springer, Heidelberg (2002)",
		"16. Visser, E.: WebDSL: A case study in domain-specific language engineering. In: Lämmel, R., Visser, J., Saraiva, J. (eds.) Generative and Transformational Techniques in Software Engineering II. LNCS, vol. 5235, pp. 291–373. Springer, Heidelberg (2008)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["interact", "disambigu", "of", "meta", "program", "with", "concret", "object", "syntax"],
	"tag": ["ambiguity", "interactive", "metaprogramming", "source code", "syntax"],
	"title": "Interactive Disambiguation of Meta Programs with Concrete Object Syntax",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}