{
	"author": ["Benjamin Braatz", "Christoph Brandt"],
	"back": "SLE-2010",
	"booktitle": "Revised Selected Papers of the Third International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2010",
	"dblpkey": "conf/sle/BraatzB10",
	"doi": "10.1007/978-3-642-19440-5_6",
	"editor": ["Brian A. Malloy", "Steffen Staab", "Mark van den Brand"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-19440-5_6",
	"isbn": "978-3-642-19439-9",
	"pages": "82-101",
	"past": [
		"1. Klyne, G., Carroll, J.J.: Resource Description Framework (RDF): Concepts and Abstract Syntax. World Wide Web Consortium (W3C) (February 2004), http://www.w3.org/TR/2004/REC-rdf-concepts-20040210/",
		"2. Braatz, B., Brandt, C.: Graph transformations for the Resource Description Frame- work. In: Ermel, C., Heckel, R., de Lara, J. (eds.) Proc. GT-VMT 2008. Electronic Communications of the EASST, vol. 10 (2008), http://eceasst.cs.tu-berlin.de/index.php/eceasst/article/view/158",
		"3. Braatz, B.: Formal Modelling and Application of Graph Transformations in the Resource Description Framework. PhD thesis, Technische Universität Berlin (2009)",
		"4. Brickley, D., Guha, R.V.: RDF Vocabulary Description Language 1.0: RDF Schema. World Wide Web Consortium (W3C) (February 2004), http://www.w3.org/TR/2004/REC-rdf-schema-20040210/",
		"5. W3C OWL Working Group: OWL 2 Web Ontology Language. Document Overview. World Wide Web Consortium (W3C) (October 2009), http://www.w3.org/TR/2009/REC-owl2-overview-20091027/",
		"6. Object Management Group (OMG): Meta Object Facility (MOF) Core Specifica- tion (January 2006), http://www.omg.org/spec/MOF/2.0/",
		"7. Object Management Group (OMG): Request for Proposal. MOF to RDF Struc- tural Mapping in support of Linked Open Data (December 2009), http://www.omg.org/cgi-bin/doc?ad/2009-12-09",
		"8. Ehrig, H., Ehrig, K., Prange, U., Taentzer, G.: Fundamentals of Algebraic Graph Transformation. Monographs in Theoretical Computer Science. Springer, Heidel- berg (2006), doi:10.1007/3-540-31188-2 DSMLs with Algebraic Graph Transformations on RDF 101",
		"9. Kärnä, J., Tolvanen, J.P., Kelly, S.: Evaluating the use of domain-specific modeling in practice. In: Rossi, M., Sprinkle, J., Gray, J., Tolvanen, J.P. (eds.) Proceedings of the 9th OOPSLA Workshop on Domain-Specific Modeling, DSM 2009, Number B-108 in HSE Print (2009), http://www.dsmforum.org/events/DSM09/Papers/Karna.pdf",
		"10. Sprinkle, J., Mernik, M., Tolvanen, J.P., Spinellis, D.: What kinds of nails need a domain-specific hammer? IEEE Software 26(4), 15–18 (2009), doi:10.1109/MS.2009.92",
		"11. Kelly, S., Pohjonen, R.: Worst practices for domain-specific modeling. IEEE Soft- ware 26(4), 22–29 (2009), doi:10.1109/MS.2009.109",
		"12. Herrmannsdoerfer, M., Ratiu, D., Wachsmuth, G.: Language evolution in practice: The history of GMF. In: van den Brand, M., Gašević, D., Gray, J. (eds.) SLE 2009. LNCS, vol. 5969, pp. 3–22. Springer, Heidelberg (2010), doi:10.1007/978-3-642- 12107-4_3",
		"13. Bagge, A.H.: Yet another language extension scheme. In: van den Brand, M., Gaše- vić, D., Gray, J. (eds.) SLE 2009. LNCS, vol. 5969, pp. 123–132. Springer, Heidel- berg (2010), doi:10.1007/978-3-642-12107-4_9",
		"14. Wende, C., Thieme, N., Zschaler, S.: A role-based approach towards modular lan- guage engineering. In: van den Brand, M., Gašević, D., Gray, J. (eds.) SLE 2009. LNCS, vol. 5969, pp. 254–273. Springer, Heidelberg (2010), doi:10.1007/978-3-642- 12107-4_19",
		"15. Zschaler, S., Kolovos, D.S., Drivalos, N., Paige, R.F., Rashid, A.: Domain-specific metamodelling languages for software language engineering. In: van den Brand, M., Gašević, D., Gray, J. (eds.) SLE 2009. LNCS, vol. 5969, pp. 334–353. Springer, Heidelberg (2010), doi:10.1007/978-3-642-12107-4_23"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["domain", "specif", "model", "languag", "with", "algebra", "graph", "transform", "on", "rdf"],
	"tag": ["algebra", "domain-specific language", "graph transformation", "modelling", "rdf"],
	"title": "Domain-Specific Modelling Languages with Algebraic Graph Transformations on RDF",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 6563,
	"year": 2010
}