{
	"author": ["Tiago L. Alves", "Joost Visser"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/AlvesV08",
	"doi": "10.1007/978-3-642-00434-6_18",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_18",
	"isbn": "978-3-642-00433-9",
	"pages": "285-304",
	"past": [
		"1. Klint, P., L¨ ammel, R., Verhoef, C.: Towards an engineering discipline for gram- marware. Transaction on Software Engineering and Methodology, 331–380 (2005)",
		"2. Malloy, B.A., Power, J.F., Waldron, J.T.: Applying software engineering techniques to parser design: the development of a c# parser. In: Proc. of the 2002 Conf. of the South African Institute of Computer Scientists and Information Technologists, pp. 75–82. In cooperation with ACM, Press, New York (2002)",
		"3. L¨ ammel, R., Verhoef, C.: Semi-automatic Grammar Recovery. Software—Practice & Experience 31(15), 1395–1438 (2001)",
		"4. van der Brand, M., Sellink, A., Verhoef, C.: Current parsing techniques in soft- ware renovation considered harmful. In: IWPC 1998: Proceedings of the 6th In- ternational Workshop on Program Comprehension, pp. 108–117. IEEE Computer Society, Los Alamitos (1998)",
		"5. de Jonge, M., Visser, J.: Grammers as contracts. In: Butler, G., Jarzabek, S. (eds.) GCSE 2000. LNCS, vol. 2177, pp. 85–99. Springer, Heidelberg (2001)",
		"6. Heering, J., Hendriks, P.R.H., Klint, P., Rekers, J.: The syntax definition formalism SDF — Reference manual. SIGPLAN Notices 24(11), 43–75 (1989)",
		"7. Visser, E.: Syntax Definition for Language Prototyping. PhD thesis, University of Amsterdam (1997)",
		"8. den van Brand, M.G.J., van Deursen, A., Heering, J., de Jong, H.A., de Jonge, M., Kuipers, T., Klint, P., Moonen, L., Olivier, P.A., Scheerder, J., Vinju, J.J., Visser, E., Visser, J.: The ASF+SDF meta-environment: A component-based language development environment. In: Wilhelm, R. (ed.) CC 2001. LNCS, vol. 2027, p. 365. Springer, Heidelberg (2001)",
		"9. Visser, E., Benaissa, Z.: A Core Language for Rewriting. In: Kirchner, C., Kirchner, H. (eds.) Proc. of the Int. Workshop on Rewriting Logic and its Applications (WRLA 1998), France. ENTCS, vol. 15. Elsevier Science, Amsterdam (1998)",
		"10. L¨ ammel, R., Visser, J.: A Strafunski Application Letter. In: Dahl, V., Wadler, P. (eds.) PADL 2003. LNCS, vol. 2562, pp. 357–375. Springer, Heidelberg (2002)",
		"11. Kuipers, T., Visser, J.: Object-oriented tree traversal with JJForester. In: Brand, M.v.d., Parigot, D. (eds.) Proceedings of the Workshop on Language Descriptions, Tools and Applications (LDTA). Electronic Notes in Theoretical Computer Sci- ence, vol. 44. Elsevier, Amsterdam (2001)",
		"12. de Jonge, M.: A pretty-printer for every occasion. In: Ferguson, I., Gray, J., Scott, L. (eds.) Proceedings of the 2nd International Symposium on Constructing Software Engineering Tools (CoSET 2000), University of Wollongong, Australia (2000)",
		"13. Fogel, K.: Open Source Development with CVS. Coriolis Group Books (1999)",
		"14. Kort, J., L¨ ammel, R., Verhoef, C.: The grammar deployment kit. In: van den Brand, M., L¨ ammel, R. (eds.) ENTCS, vol. 65. Elsevier, Amsterdam (2002)",
		"15. Power, J., Malloy, B.: A metrics suite for grammar-based software. Journal of Software Maintenance and Evolution 16, 405–426 (2004)",
		"16. Alves, T., Visser, J.: Metrication of SDF grammars. Technical Report DI-PURe- 05.05.01, Universidade do Minho (May 2005) 304 T.L. Alves and J. Visser",
		"17. Halstead, M.: Elements of Software Science. Operating, and Programming Systems Series, vol. 7. Elsevier, New York (1977)",
		"18. Fenton, N., Pfleeger, S.L.: Software metrics: a rigorous and practical approach, 2nd edn. PWS Publishing Co., Boston (revised printing, 1997)",
		"19. Bravenboer, M.: Parse Unit home page, http://www.program-transformation.org/Tools/ParseUnit",
		"20. Purdom, P.: Erratum: A Sentence Generator for Testing Parsers [BIT 12(3), 1972, p. 372]. BIT 12(4), 595–595 (1972)",
		"21. L¨ ammel, R.: Grammar testing. In: Hussmann, H. (ed.) FASE 2001. LNCS, vol. 2029, pp. 201–216. Springer, Heidelberg (2001)",
		"22. Alves, T., Silva, P., Visser, J., Oliveira, J.: Strategic term rewriting and its appli- cation to a vdmsl to sql conversion. In: Fitzgerald, J.S., Hayes, I.J., Tarlecki, A. (eds.) FM 2005. LNCS, vol. 3582, pp. 399–414. Springer, Heidelberg (2005)",
		"23. International Organisation for Standardization: Information technology— Programming languages, their environments and system software interfaces— Vienna Development Method—Specification Language—Part 1: Base language, ISO/IEC 13817-1 (December 1996)",
		"24. den van Brand, M., Scheerder, J., Vinju, J., Visser, E.: Disambiguation filters for scannerless generalized LR parsers. In: Horspool, R.N. (ed.) CC 2002. LNCS, vol. 2304, p. 143. Springer, Heidelberg (2002)",
		"25. L¨ ammel, R.: The Amsterdam toolkit for language archaeology (Extended Ab- stract). In: Proceedings of the 2nd International Workshop on Meta-Models, Schemas and Grammars for Reverse Engineering (ATEM 2004) (October 2004)",
		"26. Erbach, G.: Tools for grammar engineering (March 15 (2000)",
		"27. Volk, M.: The role of testing in grammar engineering. In: Proc. of the 3rd Conf. on Applied Natural Language Processing, Assoc. for Computational Linguistics, pp. 257–258 (1992)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["a", "case", "studi", "in", "grammar", "engin"],
	"tag": ["case study", "grammarware"],
	"title": "A Case Study in Grammar Engineering",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}