{
	"author": ["Nikolaos Drivalos", "Dimitris S. Kolovos", "Richard F. Paige", "Kiran Jude Fernandes"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/DrivalosKPF08",
	"doi": "10.1007/978-3-642-00434-6_10",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_10",
	"isbn": "978-3-642-00433-9",
	"pages": "151-167",
	"past": [
		"1. Kolovos, S.D., Paige, R.F., Polack, F.A.C.: On-Demand Merging of Traceability Links with Models. In: Proc. 2nd EC-MDA Workshop on Traceability, Bilbao, Spain (July 2006)",
		"2. Drivalos, N., Paige, R.F., Fernandes, K.J., Kolovos, D.S.: Towards Rigorously De- fined Model-to-Model Traceability. In: Proc. 4th Traceability Workshop, ECMDA, Berlin, Germany (June 2008) Engineering a DSL for Software Traceability 167",
		"3. Eclipse.org. Eclipse Modelling Framework, http://www.eclipse.org/emf",
		"4. IEEE Std 610.12-1990. IEEE Standard Glossary of Software Engineering Termi- nology. IEEE, New York",
		"5. Aizenbud-Reshef, N., Nolan, B.T., Rubin, J., Shaham-Gafini, Y.: Model Traceabil- ity. IBM Systems Journal (2006)",
		"6. Limon, A.E., Garbajosa, J.: The Need for a Unifying Traceability Scheme. In: Proc. Traceability Workshop, European Conference in Model Driven Architecture (EC-MDA), pp. 47–55 (2005)",
		"7. Jouault, F., Bez´ıvin, J.: Using ATL for Checking Models. In: Proc. Interna- tional Workshop on Graph and Model Transformation (GraMoT), Tallinn, Estonia (September 2005)",
		"8. Kleppe, A.: A Language Description is More than a Metamodel. In: Proc. 4th Inter- national Workshop on Software Language Engineering, Nashville, USA (October 2007)",
		"9. Kolovos, D.S., Paige, R.F., Polack, F.A.C.: On the Evolution of OCL for Capturing Structural Constraints in Modelling Languages. In: Proc. Dagstuhl Workshop on Rigorous Methods for Software Construction and Analysis (2007)",
		"10. Kolovos, D.S., Paige, R.F., Polack, F.A.C.: The epsilon transformation language. In: Vallecillo, A., Gray, J., Pierantonio, A. (eds.) ICMT 2008. LNCS, vol. 5063, pp. 46–60. Springer, Heidelberg (2008)",
		"11. Jouault, F., Kurtev, I.: Transforming models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"12. Object Management Group. MOF QVT Final Adopted Specification, http://www.omg.org/cgi-bin/doc?ptc/05-11-01.pdf",
		"13. Chauvel, F., Fleurey, F.: Kermeta Language Overview, http://www.kermeta.org",
		"14. Rose, L.M.: The Epsilon Generation Language (EGL). MEng. Thesis, Department of Computer Science, The University of York (2008)",
		"15. Oldevik, J.: MOFScript User Guide, http://www.eclipse.org/gmt/mofscript/doc/MOFScript-User- Guide.pdf",
		"16. Java Emitter Templates (JET), http://www.eclipse.org/modeling/m2t/",
		"17. Sven Efftinge. XPand Language Reference, http://www.eclipse.org/gmt/oaw/doc/4.1/r20_xPandReference.pdf",
		"18. Maedche, A., Motik, B., Silva, N., Volz, R.: MAFRA – A mapping framework for distributed ontologies. In: G´ omez-P´ erez, A., Benjamins, V.R. (eds.) EKAW 2002. LNCS, vol. 2473, p. 235. Springer, Heidelberg (2002)",
		"19. B´ ezivin, J., Bruneli` ere, H., Jouault, F., Kurtev, I.: Model engineering support for tool interoperability. In: WISME 2005 - 4th Workshop in Software Model Engi- neering (2005)",
		"20. Kolovos, D.S., Paige, R.F., Polack, F.A.C.: Detecting and Repairing Inconsisten- cies Across Heterogeneous Models. In: Proc. 1st IEEE Internationa Conference on Software Testing, Verification and Validation, Lillehammer, Norway (April 2008)",
		"21. Fabro, M.D.D., Bezivin, J., Jouault, F., Breton, E., Gueltas, G.: AMW: A Generic Model Weaver. In: Proceedings of IDM 2005 (2005)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["engin", "a", "dsl", "for", "softwar", "traceabl"],
	"tag": ["domain-specific language", "traceability"],
	"title": "Engineering a DSL for Software Traceability",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}