{
	"author": ["Jeffrey L. Overbey", "Ralph E. Johnson"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/OverbeyJ08",
	"doi": "10.1007/978-3-642-00434-6_8",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_8",
	"isbn": "978-3-642-00433-9",
	"pages": "114-133",
	"past": [
		"1. ASC Center for Astrophysical Thermonuclear Flashes, http://www.flash.uchicago.edu",
		"2. Beˇ ciˇ cka, J., Hˇ rebejk, P., Zajac, P.: (Sun Microsystems): Using Java 6 compiler as a refac- toring and an anaysis engine. In: 1st Workshop on Refactoring Tools (2007)",
		"3. Bowdidge, R.: (Apple Computer): Personal communication",
		"4. Celentano, A.: Incremental LR parsers. Acta Inf. 10, 307–321 (1978)",
		"5. Cordy, J.: The TXL source transformation language. Sci. Comp. Prog. 61, 190–210 (2006)",
		"6. Cormen, T., Leiserson, C., Rivest, R., Stein, C.: Introduction to Algorithms. 2/e. MIT Press, Cambridge (2001)",
		"7. De Jonge, M., Visser, E., Visser, J.: XT: A bundle of program transformation tools. In: Proc. Lang. Descriptions, Tools and Applications 2001. Elec. Notes in Theoretical Comp. Sci, vol. 44, pp. 211–218 (2001)",
		"8. DeRemer, F.: Practical translators for LR(k) languages. PhD thesis, MIT (1969)",
		"9. Eclipse C/C++ Development Tools, http://www.eclipse.org/cdt",
		"10. Eclipse Java Development Tools, http://www.eclipse.org/jdt",
		"11. Ernst, M., Badros, G., Notkin, D.: An empirical analysis of C preprocessor use. IEEE Trans. on Software Eng. 28, 1146–1170 (2002)",
		"12. Gamma, E., Helm, R., Johnson, R., Vlissides, J.: Design patterns: Elements of reusable object-oriented software. Addison-Wesley, Reading (1994)",
		"13. Garrido, A., Johnson, R.: Challenges of refactoring C programs. In: Proc. Intl. Workshop on Principles of Software Evolution, pp. 6–14 (2002)",
		"14. Garrido, A.: Program refactoring in the presence of preprocessor directives. PhD thesis, University of Illinois at Urbana-Champaign (2005)",
		"15. Garrido, A., Johnson, R.: Refactoring C with conditional compilation. In: Proc. 18th IEEE Intl. Conf. on Automated Software Eng., pp. 323–326 (2003)",
		"16. Hopcroft, J., Motwani, R., Ulman, J.: Introduction to automata theory, languages, and com- putation. 2/e. Addison-Wesley, Reading (2001) Generating Rewritable Abstract Syntax Trees 133",
		"17. IBEAM, http://www.ibeam.org",
		"18. ISO/IEC 9899:1999: Programming Languages – C",
		"19. ISO/IEC 14882:2003: Programming Languages – C++",
		"20. JJTree, https://javacc.dev.java.net/doc/JJTree.html",
		"21. Kort, J., Lämmel, R.: Parse-tree annotations meet re-engineering concerns. In: Proc. Source Code Analysis and Manipulation, pp. 161–172 (2003)",
		"22. Lämmel, R.: Towards generic refactoring. In: Proc. ACM SIGPLAN Workshop on Rule- Based Prog., pp. 15–28 (2002)",
		"23. LPG, http://sourceforge.net/projects/lpg/",
		"24. Ludwig, http://jeff.over.bz/software/ludwig",
		"25. McCloskey, B., Brewer, E.: ASTEC: A new approach to refactoring C. In: Proc. 13th ACM SIGSOFT Intl. Symp. Found. Software Eng., pp. 21–30 (2005)",
		"26. Mens, T., Van Eetvelde, N., Demeyer, S., Janssens, D.: Formalizing refactorings with graph transformations. J. Software Maint. and Evolution 17, 247–276 (2005)",
		"27. Parr, T.: The definitive ANTLR reference: Building domain-specific languages. Pragmatic Bookshelf, Raleigh (2007)",
		"28. Photran, http://www.eclipse.org/photran",
		"29. Platoff, M., Wagner, M., Camaratta, J.: An integrated program representation and toolkit for the maintenance of C programs. In: Proc. Conf. Software Maint., pp. 129–137 (1991)",
		"30. Sellink, M., Verhoef, C.: Scaffolding for software renovation. In: Proc. Conf. Software Maint. Reeng., pp. 161–172 (2000)",
		"31. Stallman, R., Weinberg, Z.: The C preprocessor, http://gcc.gnu.org/onlinedocs/ cpp.pdf",
		"32. Tomita, M.: Generalized LR parsing. Springer, Heidelberg (1991)",
		"33. van den Brand, M.G.J., van Deursen, A., Heering, J., de Jong, H.A., de Jonge, M., Kuipers, T., Klint, P., Moonen, L., Olivier, P.A., Scheerder, J., Vinju, J.J., Visser, E., Visser, J.: The ASF+SDFmeta-environment: A component-based language development environment. In: Wilhelm, R. (ed.) CC 2001. LNCS, vol. 2027, pp. 365–370. Springer, Heidelberg (2001)",
		"34. Visser, E.: Stratego: A language for program transformation based on rewriting strategies. In: Middeldorp, A. (ed.) RTA 2001. LNCS, vol. 2051, pp. 357–361. Springer, Heidelberg (2001)",
		"35. Vlissides, J.: Pattern hatching: Design patterns applied. Addison-Wesley, Reading (1998)",
		"36. Wang, D., Appel, A., Korn, J., Serra, C.: The Zephyr abstract syntax description language. In: USENIX Workshop on Domain-Specific Langauges (1997)",
		"37. Wile, D.: Abstract syntax from concrete syntax. In: Proc. 19th Intl. Conf. on Software Eng., pp. 472–480 (1997)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["generat", "rewrit", "abstract", "syntax", "tree"],
	"tag": ["abstract syntax tree", "generative", "syntax"],
	"title": "Generating Rewritable Abstract Syntax Trees",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}