{
	"author": ["Emma Nilsson-Nyman", "Torbjörn Ekman", "Görel Hedin"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/Nilsson-NymanEH08",
	"doi": "10.1007/978-3-642-00434-6_7",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_7",
	"isbn": "978-3-642-00433-9",
	"pages": "95-113",
	"past": [
		"1. Bridge Parsing Test Suite (2008), http://www.cs.lth.se/home/Emma.Nilsson_Nyman",
		"2. Avgustinov, P.,Ekman, T.,Tibble, J.: Modularity First: A Case for Mixing AOP and Attribute Grammars. In: AOSD. ACM Press, New York (2008)",
		"3. Burke, M.G., Fisher, G.A.: A practical method for LR and LL syntactic error diagnosis and recovery. ACM Trans. Program. Lang. Syst. 9(2), 164–197 (1987)",
		"4. Charles, P.: A practical method for constructing efficient LALR(K) parsers with automatic error recovery. PhD thesis, New York, NY, USA (1991)",
		"5. Degano, P., Priami, C.: Comparison of syntactic error handling in LR parsers, New York, NY, USA, vol. 25, pp. 657–679. John Wiley & Sons, Inc., Chichester (1995)",
		"6. Earley, J.: An efficient context-free parsing algorithm. Commun. ACM 13(2), 94–102 (1970) Practical Scope Recovery Using Bridge Parsing 113",
		"7. Ekman, T., Hedin, G.: The JastAdd Extensible Java Compiler. In: Gabriel, R.P. (ed.) 22nd Annual ACM SIGPLANConference on Object-Oriented Programming Systems, Languages, and Applications (OOPSLA 2007). ACM Press, New York (2007)",
		"8. Ford, B.: Parsing expression grammars: a recognition-based syntactic foundation, vol. 39, pp. 111–122. ACM, New York (2004)",
		"9. Graham, S.L., Haley, C.B., Joy, W.N.: Practical LR error recovery. In: SIGPLAN 1979: Pro- ceedings of the 1979 SIGPLAN symposium on Compiler construction, pp. 168–175. ACM, New York (1979)",
		"10. Huang, S.S., Hormati, A., Bacon, D.F., Rabbah, R.M.: Liquid Metal: Object-Oriented Pro- gramming Across the Hardware/Software Boundary. In: Vitek, J. (ed.) ECOOP 2008. LNCS, vol. 5142, pp. 76–103. Springer, Heidelberg (2008)",
		"11. Jianga,T.,Wang, L.,Zhang, K.:Alignment of trees- analternativetotreeedit.In:Theoretical Computer Science, vol. 143, pp. 137–148. Elsevier Science B.V., Amsterdam (1995)",
		"12. Klusener, S., Lämmel, R.: Deriving tolerant grammars from a base-line grammar. In: ICSM 2003: Proceedings of the International Conference on Software Maintenance, Washington, DC, USA, p. 179. IEEE Computer Society, Los Alamitos (2003)",
		"13. Moonen, L.:Generatingrobust parsersusingislandgrammars. In:Proceedings. EighthWork- ing Conference on Reverse Engineering, pp. 13–22. IEEE Computer Society Press, Los Alamitos (2001)",
		"14. Moonen, L.: Lightweight impact analysis using island grammars. In: Proceedings of the 10th IEEE International Workshop of Program Comprehension, pp. 219–228. IEEE Computer Society, Los Alamitos (2002)",
		"15. Nilsson-Nyman, E., Ekman, T., Hedin, G., Magnusson, E.: Declarative Intraprocedural Flow Analysis of Java Source Code. In: 8th Workshop on Language Description, Tools and Ap- plications. Electronic Notes in Theoretical Computer Science (ENTCS). Elsevier Science, Amsterdam (2008)",
		"16. Pennello, T.J., DeRemer, F.: A forward move algorithm for LR error recovery. In: POPL 1978: Proceedings of the 5th ACM SIGACT-SIGPLAN symposium on Principles of pro- gramming languages, pp. 241–254. ACM, New York (1978)",
		"17. Schäfer, M., Ekman, T., de Moor, O.: Sound and Extensible Renaming for Java. In: Kicza- les, G. (ed.) 23rd Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications (OOPSLA 2008). ACM Press, New York (2008)",
		"18. Tomita, M.: An efficient context-free parsing algorithm for natural languages and its appli- cations. PhD thesis, Pittsburgh, PA, USA (1985)",
		"19. van Deursen, A., Kuipers, T.: Building documentation generators. In: IEEE International Conference on Software Maintenance, pp. 40–49 (August 1999)",
		"20. Wagner, T.A.: Practical Algorithms for Incremental Software Development Environments. PhD thesis, Berkeley, CA, USA (1998)",
		"21. Wagner, T.A., Graham, S.L.: Efficient and flexible incremental parsing. ACM Trans. Pro- gram. Lang. Syst. 20(5), 980–1013 (1998)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["practic", "scope", "recoveri", "use", "bridg", "pars"],
	"tag": ["semiparsing", "using"],
	"title": "Practical Scope Recovery Using Bridge Parsing",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}