{
	"author": ["Yu Sun", "Zekai Demirezen", "Frédéric Jouault", "Robert Tairas", "Jeff Gray"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/SunDJTG08",
	"doi": "10.1007/978-3-642-00434-6_12",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_12",
	"isbn": "978-3-642-00433-9",
	"pages": "178-187",
	"past": [
		"[1] Baxter, I., Yahin, A., Moura, L., Sant’Anna, M., Bier, L.: Clone Detection using Abstract Syntax Trees. In: International Conference on Software Maintenance, Bethesda, Mary- land, pp. 368–377 (1998)",
		"[2] Benguria, G., Larrucea, X.: Data Model Transformation for Supporting Interoperability. In: International Conference on Commercial-off-the-Shelf (COTS)-Based Software Sys- tems, Alberta, Canada, pp. 172–181 (2007)",
		"[3] Budinsky, F., Steinberg, D., Ellersick, R., Merks, E., Steinberg, D., Grose, T.: Eclipse Modeling Framework. Addison-Wesley, Reading (2003)",
		"[4] Jouault, F., Bézivin, J.: KM3: A DSL for metamodel specification. In: Gorrieri, R., Wehrheim, H. (eds.) FMOODS 2006. LNCS, vol. 4037, pp. 171–185. Springer, Heidel- berg (2006)",
		"[5] Jouault, F., Bézivin, J., Kurtev, I.: TCS: A DSL for the Specification of Textual Concrete Syntaxes in Model Engineering. In: International Conference on Generative Program- ming and Component Engineering, Portland, Oregon, pp. 249–254 (2006) A Model Engineering Approach to Tool Interoperability  187",
		"[6] Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Model Transformations in Practice Workshop, International Conference on Model-Driven Engineering, Languages, and Systems, Montego Bay, Jamaica (2005)",
		"[7] Karsai, G., Gray, J.: Component Generation Technology for Semantic Tool Integration. In: IEEE Aerospace Conference, Big Sky, Montana, pp. 491–499 (2000)",
		"[8] Kurtev, I., Bézivin, J., Jouault, F., Valduriez, P.: Model-based DSL Frameworks. In: In- ternational Conference on Object-Oriented Programming, Systems, Languages, and Ap- plications, Portland, Oregon, pp. 602–616 (2006)",
		"[9] Scalable Vector Graphics (SVG), http://www.w3.org/Graphics/SVG/",
		"[10] Simian, http://www.redhillconsulting.com.au/products/simian/",
		"[11] SimScan, http://www.blue-edge.bg/simscan/simscan_help_r1.htm",
		"[12] Kamiya, T., Kusumoto, S., Inoue, K.: CCFinder: A Multi-Linguistic Token-Based Code Clone Detection System for Large Scale Source Code. IEEE Transactions on Software Engineering 28, 654–670 (2002)",
		"[13] Tairas, R., Gray, J.: Phoenix-Based Clone Detection Using Suffix Trees. In: ACM South- east Conference, Melbourne, Florida, pp. 679–684 (2006)",
		"[14] Tratt, L.: Model Transformations and Tool Integration. Software and Systems Model- ing 4, 112–122 (2005)",
		"[15] Representation for Clone Tools (Eclipse ATL Use Case), http://www.eclipse.org/m2m/atl/usecases/VisualRepCodeClone",
		"[16] Aho, A., Lam, M., Sethi, R., Ullman, J.: Compilers: Principles, Techniques, and Tools. Addison-Wesley, Boston (2007)",
		"[17] Lämmel, R., Verhoef, C.: Cracking the 500-Language Problem. IEEE Software 18, 78–88 (2001)",
		"[18] Apache Ant, http://ant.apache.org",
		"[19] Khoumbati, K., Themistocleous, M., Irani, Z.: Investigating Enterprise Application Inte- gration Benefits and Barriers in Healthcare Organisations: An Exploratory Case Study. International Journal of Electronic Healthcare 2, 66–78 (2006)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["a", "model", "engin", "approach", "to", "tool", "interoper"],
	"tag": ["approach"],
	"title": "A Model Engineering Approach to Tool Interoperability",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}