{
	"author": ["Pieter Van Gorp", "Anne Keller", "Dirk Janssens"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/GorpKJ08",
	"doi": "10.1007/978-3-642-00434-6_14",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_14",
	"isbn": "978-3-642-00433-9",
	"pages": "208-226",
	"past": [
		"1. Nagl, M., Schürr, A.: Summary and specification lessons learned. In: Nagl, M. (ed.) IPSEN 1996. LNCS, vol. 1170, pp. 370–377. Springer, Heidelberg (1996)",
		"2. Fischer, T., Niere, J., Torunski, L., Zündorf, A.: Story diagrams: A new graph rewrite language based on the unified modeling language and java. In: Ehrig, H., Engels, G., Kreowski, H.-J., Rozenberg, G. (eds.) TAGT 1998. LNCS, vol. 1764, pp. 296–309. Springer, Heidelberg (2000)",
		"3. Jahnke, J.H., Schäfer, W., Wadsack, J.P., Zündorf, A.: Supporting iterations in exploratory database reengineering processes. Sci. Comput. Program. 45(2-3), 99– 136 (2002)",
		"4. University of Paderborn. Fujaba Tool Suite (2007), http://www.fujaba.de/",
		"5. Agrawal, A.: Graph Rewriting And Transformation (GReAT): A solution for the Model Integrated Computing (MIC) bottleneck. In: ASE, p. 364 (2003) Transformation Language Integration 225",
		"6. Kalnins, A., Celms, E., Sostaks, A.: Simple and efficient implementation of pattern matching in MOLA tool. In: 2006 7th International Baltic Conference on Databases and Information Systems, 3-6 July, pp. 159–167 (2006)",
		"7. Levendovszky, T., Lengyel, L., Mezei, G., Charaf, H.: A systematic approach to metamodeling environments and model transformation systems in VMTS. Elec- tronic Notes in Theoretical Computer Science 127, 65–75 (2005)",
		"8. Lambers, L.: A new version of GTXL: An exchange format for graph transformation systems. Electronic Notes in Theoretical Computer Science 127, 51–63 (2005)",
		"9. Object Management Group. MOF 2.0 QVT final adopted specifications (November 2005), http://www.omg.org/cgi-bin/doc?ptc/05-11-01",
		"10. Van Gorp, P.: Model-driven Development of Model Transformations. PhD thesis, University of Antwerp (April 2008)",
		"11. Green, T.R.G.: Cognitive dimensions of notations. In: Sutcliffe, A., Macaulay, L. (eds.) People and Computers V, New York, NY, USA, pp. 443–460. Cambridge University Press, Cambridge (1989)",
		"12. Muliawan, O., Schippers, H., Van Gorp, P.: Model driven, Template based, Model Transformer (MoTMoT) (2007), http://motmot.sourceforge.net/",
		"13. Bernstein, P.A.: Generic model management: A database infrastructure for schema manipulation. In: Batini, C., Giunchiglia, F., Giorgini, P., Mecella, M. (eds.) CoopIS 2001. LNCS, vol. 2172, pp. 1–6. Springer, Heidelberg (2001)",
		"14. Van Gorp, P., Schippers, H., Janssens, D.: Copying Subgraphs within Model Repositories. In: Bruni, R., Varró, D. (eds.) Fifth International Workshop on Graph Transformation and Visual Modeling Techniques, Vienna, Austria. Elec- tronic Notes in Theoretical Computer Science, pp. 127–139. Elsevier, Amsterdam (2006)",
		"15. Gogolla, M., Richters, M.: Transformation rules for UML class diagrams. In: Bézivin, J., Muller, P.-A. (eds.) UML 1998. LNCS, vol. 1618, pp. 92–106. Springer, Heidelberg (1999)",
		"16. Narayanan, A.: UML-to-CSP transformation using GReAT. In: AGTiVE 2007 Tool Contest Solutions (2007)",
		"17. Van Gorp, P., Muliawan, O., Keller, A., Janssens, D.: Executing a platform inde- pendent model of the UML-to-CSP transformation on a commercial platform. In: Täntzer, G., Rensink, A. (eds.) AGTIVE 2007 Tool Contest (January 2008)",
		"18. Schürr, A.: Specification of graph translators with triple graph grammars. In: Mayr, E.W., Schmidt, G., Tinhofer, G. (eds.) WG 1994. LNCS, vol. 903, pp. 151–163. Springer, Heidelberg (1995)",
		"19. Königs, A., Schürr, A.: Tool integration with Triple Graph Grammars - a survey. In: Heckel, R. (ed.) Proceedings of the SegraVis School on Foundations of Visual Modelling Techniques. Electronic Notes in Theoretical Computer Science, vol. 148, pp. 113–150. Elsevier, Amsterdam (2006)",
		"20. Burmester, S., Giese, H., Niere, J., Tichy, M., Wadsack, J.P., Wagner, R., Wen- dehals, L., Zündorf, A.: Tool integration at the meta-model level: the Fujaba ap- proach. International Journal on STTT 6(3), 203–218 (2004)",
		"21. Wagner, R.: Consistency Management System for the Fujaba Tool Suite – MoTE/- MoRTEn Plugins (January 2008), https://dsd-serv.uni-paderborn.de/projects/cms/",
		"22. Amelunxen, C., Königs, A., Rötschke, T., Schürr, A.: MOFLON: A Standard- Compliant Metamodeling Framework with Graph Transformations. In: Rensink, A., Warmer, J. (eds.) ECMDA-FA 2006. LNCS, vol. 4066, pp. 361–375. Springer, Heidelberg (2006) 226 P. Van Gorp, A. Keller, and D. Janssens",
		"23. Horváth, Á., Varró, D., Varró, G.: Automatic generation of platform-specific trans- formation. Info-Communications-Technology LXI(7), 40–45 (2006)",
		"24. Van Wyk, E., de Moor, O., Backhouse, K., Kwiatkowski, P.: Forwarding in attribute grammars for modular language design. In: Horspool, R.N. (ed.) CC 2002. LNCS, vol. 2304, pp. 128–142. Springer, Heidelberg (2002)",
		"25. Van Wyk, E., Per Erik Heimdahl, M.: Flexibility in modeling languages and tools: A call to arms. International Journal on STTT (2009)",
		"26. Meyers, B., Van Gorp, P.: Towards a hybrid transformation language: Implicit and explicit rule scheduling in Story Diagrams. In: Proc. of the 6th International Fujaba Days 2008, Dresden, Germany (September 2008)",
		"27. Ermel, C., Rudolf, M., Taentzer, G.: The AGG approach: language and environ- ment. In: Handbook of graph grammars and computing by graph transformation. Applications, Languages, and Tools, vol. II, pp. 551–603. World Scientific Publish- ing Co., Inc., River Edge (1999)",
		"28. The Apache Software Foundation. Maven (2007), http://maven.apache.org/"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["transform", "languag", "integr", "base", "on", "profil", "and", "higher", "order", "transform"],
	"tag": ["higher-order", "integration", "model transformation"],
	"title": "Transformation Language Integration Based on Profiles and Higher Order Transformations",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}