{
	"author": ["Daniel L. Moody", "Jos van Hillegersberg"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/MoodyH08",
	"doi": "10.1007/978-3-642-00434-6_3",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_3",
	"isbn": "978-3-642-00433-9",
	"pages": "16-34",
	"past": [
		"1. Bertin, J.: Semiology of Graphics: Diagrams, Networks, Maps. University of Wisconsin Press, Madison (1983)",
		"2. Biederman, I.: Recognition-by-Components: A Theory of Human Image Understanding. Psychological Review 94(2), 115-147 (1987)",
		"3. Britton, C., Jones, S.: The Untrained Eye: How Languages for Software Specification Support Understanding by Untrained Users. Human Computer Interaction 14, 191-244 (1999)",
		"4. Britton, C., Jones, S., Kutar, M., Loomes, M., Robinson, B.: Evaluating the intelligibility of diagrammatic languages used in the specification of software. In: Anderson, M., Cheng, P., Haarslev, V. (eds.) Diagrams 2000. LNCS, vol. 1889, pp. 376-391. Springer, Heidel- berg (2000)",
		"5. Cheng, P.C.-H., Lowe, R.K., Scaife, M.: Cognitive Science Approaches To Understanding Diagrammatic Representations. Artificial Intelligence Review 15(1/2), 79-94 (2001)",
		"6. Dobing, B., Parsons, J.: How UML is Used. Communications of the ACM 49(5), 109-114 (2006)",
		"7. Gehlert, A., Esswein, W.: Towards a Formal Research Framework for Ontological Analy- ses. Advanced Engineering Informatics 21, 119-131 (2007)",
		"8. Glinz, M., Berner, S., Joos, S.: Object-oriented modeling with ADORA. Information Sys- tems 27, 425-444 (2002)",
		"9. Goodman, N.: Languages of Art: An Approach to a Theory of Symbols. Bobbs-Merrill Co., Indianapolis (1968) Evaluating the Visual Syntax of UML  33",
		"10. Green, D.M., Swets, J.A.: Signal Detection Theory and Psychophysics. Wiley, New York (1966)",
		"11. Gurr, C.A.: Effective Diagrammatic Communication: Syntactic, Semantic and Pragmatic Issues. Journal of Visual Languages and Computing 10, 317-342 (1999)",
		"12. Harel, D.: On Visual Formalisms. Communications of the ACM 31(5), 514-530 (1988)",
		"13. Jonkers, H., van Buuren, R., Hoppenbrouwers, S., Lankhorst, M., Veldhuijzen van Zanten, G.: ArchiMate Language Reference Manual (Version 4.1). Archimate Consortium, 73 (2007)",
		"14. Larkin, J.H., Simon, H.A.: Why a Diagram is (Sometimes) Worth Ten Thousand Words. Cognitive Science 11(1) (1987)",
		"15. Lee, J.: Design Rationale Systems: Understanding the Issues. IEEE Expert 12(3), 78-85 (1997)",
		"16. Lohse, G.L.: The Role of Working Memory in Graphical Information Processing. Behav- iour and Information Technology 16(6), 297-308 (1997)",
		"17. Marr, D.C.: Vision: A Computational Investigation into the Human Representation and Processing of Visual Information. W.H. Freeman and Company, New York (1982)",
		"18. Miller, G.A.: The Magical Number Seven, Plus Or Minus Two: Some Limits On Our Ca- pacity For Processing Information. The Psychological Review 63, 81-97 (1956)",
		"19. Moody, D.L.: Evidence-based Notation Design: Towards a Scientific Basis for Construct- ing Visual Notations in Software Engineering. IEEE Transactions on Software Engineer- ing (under review, 2009)",
		"20. Moody, D.L.: Review of ArchiMate: The Road to International Standardisation, Report commissioned by the ArchiMate Foundation and BiZZDesign B.V., Enschede, The Neth- erlands, 77 pages (2007)",
		"21. Moody, D.L., Mueller, R.M., Amrit, C.: Review of ORES Methodology, Notation and Toolset, Report commissioned by Egon-Sparenberg B.V., Amsterdam, The Netherlands, 53 pages (2007)",
		"22. Niemela, M., Saarinen, J.: Visual Search for Grouped versus Ungrouped Icons in a Com- puter Interface. Human Factors 42(4), 630-635 (2000)",
		"23. Nordbotten, J.C., Crosby, M.E.: The Effect of Graphic Style on Data Model Interpretation. Information Systems Journal 9(2), 139-156 (1999)",
		"24. Oberlander, J.: Grice for Graphics: Pragmatic Implicature in Network Diagrams. Informa- tion Design Journal 8(2), 163-179 (1996)",
		"25. OMG Unified Modeling Language Version 2.0: Superstructure. Object Management Group, OMG (2005)",
		"26. Opdahl, A.L., Henderson-Sellers, B.: Ontological Evaluation of the UML Using the Bunge-Wand-Weber Model. Software and Systems Modelling 1(1), 43-67 (2002)",
		"27. Peirce, C.S.: Charles S. Peirce: The Essential Writings (Great Books in Philosophy). Pro- metheus Books, Amherst (1998)",
		"28. Petre, M.: Why Looking Isn't Always Seeing: Readership Skills and Graphical Program- ming. Communications of the ACM 38(6), 33-44 (1995)",
		"29. Quinlan, P.T.: Visual Feature Integration Theory: Past, Present and Future. Psychological Bulletin 129(5), 643-673 (2003)",
		"30. Rossion, B., Pourtois, G.: Revisiting Snodgrass and Vanderwart's object pictorial set: The role of surface detail in basic-level object recognition. Perception 33, 217-236 (2004)",
		"31. Rubin, E.: Synsoplerede Figuren. Gyldendalske, Copenhagen (1915)",
		"32. Shanks, G.G., Tansley, E., Weber, R.A.: Using Ontology to Validate Conceptual Models. Communications of the ACM 46(10), 85-89 (2003) 34  D. Moody and J. van Hillegersberg",
		"33. Shannon, C.E., Weaver, W.: The Mathematical Theory of Communication. University of Illinois Press, Urbana (1963)",
		"34. Siau, K.: Informational and Computational Equivalence in Comparing Information Model- ling Methods. Journal of Database Management 15(1), 73-86 (2004)",
		"35. Siau, K., Cao, Q.: Unified Modeling Language: A Complexity Analysis. Journal of Data- base Management 12(1), 26-34 (2001)",
		"36. Tasker, D.: Worth 1,000 Words? Ha! Business Rules Journal 3(11) (2002)",
		"37. Treisman, A.: Perceptual Grouping and Attention in Visual Search for Features and for Objects. Journal of Experimental Psychology: Human Perception and Performance 8, 194- 214 (1982)",
		"38. Treisman, A., Gelade, G.A.: A Feature Integration Theory of Attention. Cognitive Psy- chology 12, 97-136 (1980)",
		"39. Treisman, A., Gormican, S.: Feature Analysis in Early Vision: Evidence from Search Asymmetries. Psychological Review 95(1), 15-48 (1988)",
		"40. Wheildon, C.: Type and Layout: Are You Communicating or Just Making Pretty Shapes? Worsley Press, Hastings (2005)",
		"41. White, A.W.: The Elements of Graphic Design: Space, Unity, Page Architecture and Type. Allworth Press, New York (2002)",
		"42. Winn, W.D.: An Account of How Readers Search for Information in Diagrams. Contem- porary Educational Psychology 18, 162-185 (1993)",
		"43. Winn, W.D.: Encoding and Retrieval of Information in Maps and Diagrams. IEEE Trans- actions on Professional Communication 33(3), 103-107 (1990)",
		"44. Yeh, M., Wickens, C.D.: Attention Filtering in the Design of Electronic Map Displays: A Comparison of Colour Coding, Intensity Coding and Decluttering Techniques. Human Factors 43(4), 543-562 (2001)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["evalu", "the", "visual", "syntax", "of", "uml", "an", "analysi", "of", "the", "cognit", "effect", "of", "the", "uml", "famili", "of", "diagram"],
	"tag": ["analysis", "diagrams", "effectiveness", "syntax", "uml", "visual notation"],
	"title": "Evaluating the Visual Syntax of UML: An Analysis of the Cognitive Effectiveness of the UMLFamily of Diagrams",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}