{
	"author": ["Mathias Fritzsche", "Jendrik Johannes", "Uwe Aßmann", "Simon Mitschke", "Wasif Gilani", "Ivor T. A. Spence", "T. John Brown", "Peter Kilpatrick"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/FritzscheJAMGSBK08",
	"doi": "10.1007/978-3-642-00434-6_9",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_9",
	"isbn": "978-3-642-00433-9",
	"pages": "134-150",
	"past": [
		"1. Hudak, P.: Building domain-specific embedded languages. ACM Computing Sur- veys 28(4), 196–196 (1996)",
		"2. Bravenboer, M., Visser, E.: Concrete syntax for objects: domain-specific language embedding and assimilation without restrictions. In: OOPSLA 2004: Proceedings of the 19th annual ACM SIGPLAN conference on Object-oriented programming, systems, languages, and applications, pp. 365–383. ACM, New York (2004)",
		"3. OMG: MetaObject Facility (MOF) specification version 2.0 (January 2006), http://www.omg.org/cgi-bin/doc?formal/2006-01-01",
		"4. OMG: Mda guide version 1.0.1 (2003)",
		"5. Parnas, D.L.: On the criteria to be used in decomposing systems into modules. Communication of the ACM 15(12) (1972)",
		"6. Fritzsche, M., Johannes, J.: Putting performance engineering into model-driven engineering: Model-driven performance engineering. In: Giese, H. (ed.) MODELS 2008. LNCS, vol. 5002, pp. 164–175. Springer, Heidelberg (2008)",
		"7. Fritzsche, M., Gilani, W., Spence, I., Brown, T.J., Kilpatrick, P., Bashroush, R.: Towards performance related decision support for model driven engineering of en- terprise soa applications, pp. 57–65. IEEE Computer Society, Los Alamitos (2008)",
		"8. Fritzsche, M., Johannes, J., Zschaler, S., Zherebtsov, A., Terekhov, A.: Application of tracing techniques in model-driven performance engineering. In: 4th ECMDA Traceability Workshop (ECMDA-TW) Proceedings, pp. 111–120 (2008)",
		"9. OMG: Business Process Modeling Notation Specification, Final Adopted Specifi- cation (2006)",
		"10. SAP AG: Review: SAPPHIRE 2008 - A new star is born in the BPM Galaxy",
		"11. Fritzsche, M., Gilani, W., Fritzsche, C., Spence, I.T.A., Kilpatrick, P., Brown, J.: Towards utilizing model-driven engineering of composite applications for business performance analysis. In: Schieferdecker, I., Hartman, A. (eds.) ECMDA-FA 2008. LNCS, vol. 5095, pp. 369–380. Springer, Heidelberg (2008)",
		"12. Altenhofen, M., Hettel, T., Kusterer, S.: OCL support in an industrial environ- ment. In: Kühne, T. (ed.) MoDELS 2006. LNCS, vol. 4364, pp. 169–178. Springer, Heidelberg (2007)",
		"13. XJ Technologies: AnyLogic — multi-paradigm simulation software, http://www.xjtek.com/anylogic/",
		"14. Kn¨ opfel, A., Gr¨ one, B., Tabeling, P.: Fundamental Modeling Concepts: Effective Communication of IT Systems. John Wiley & Sons, Chichester (2006)",
		"15. ATLAS Group: AMW Use Case - Model annotations in Java 1.4 (2007), http://www.eclipse.org/gmt/amw/usecases/annotation",
		"16. Hillairet, G.: AMW Use Case - Metamodel Annotation for Ontology Design (2007), http://www.eclipse.org/gmt/amw/usecases/oamusecase",
		"17. Vanhooff, B., Van Baelen, S., Joosen, W., Berbers, Y.: Traceability as input for model transformations. In: ECMDA-FA 3th workshop on traceability (2007)",
		"18. Jouault, F.: Loosely Coupled Traceability for ATL. In: ECMDA-FA workshop on traceability (2005)",
		"19. Kolovos, D.S., Paige, R.F., Polack, F.A.C.: On-demand merging of traceability links with models. In: Proceedings: 2. ECMDA-FA workshop on traceability (2006)",
		"20. Barbero, Jouault, F., B´ ezivin, J.: Model driven management of complex systems: Implementing the macroscope’s vision. In: 15th ECBS 2008, pp. 277–286. IEEE, Los Alamitos (2008) 150 M. Fritzsche et al.",
		"21. The AMW Project Team: Atlas Model Weaver (June 2007), http://eclipse.org/gmt/amw/",
		"22. Sabetta, A., Petriu, D.C., Grassi, V., Mirandola, R.: Abstraction-raising transfor- mation for generating analysis models. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 217–226. Springer, Heidelberg (2006)",
		"23. ATLAS Group: ATLAS transformation language (June 2007), http://www.eclipse.org/m2m/atl/",
		"24. Br¨ auer, M., Lochmann, H.: An ontology for software models and its practical im- plications for semantic web reasoning. In: Bechhofer, S., Hauswirth, M., Hoffmann, J., Koubarakis, M. (eds.) ESWC 2008. LNCS, vol. 5021, pp. 34–48. Springer, Hei- delberg (2008)",
		"25. Chen, K., Sztipanovits, J., Neema, S.: Toward a semantic anchoring infrastructure for domain-specific modeling languages. In: EMSOFT 2005: Proceedings of the 5th ACM international conference on Embedded software, pp. 35–43. ACM, New York (2005)",
		"26. Be´ zivin, J., Pierantonio, A., Tratt, L. (eds.): Intl. Workshop on Coordination of DSLs, L’Aquila, Italy (September 2008)",
		"27. Atkinson, C., Kühne, T., Henderson-Sellers, B.: Systematic stereotype usage. Soft- ware and System Modeling 2(3), 153–163 (2003)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["systemat", "usag", "of", "embed", "model", "languag", "in", "autom", "model", "transform", "chain"],
	"tag": ["automation", "embedded", "model transformation", "modelling"],
	"title": "Systematic Usage of Embedded Modelling Languages in Automated Model Transformation Chains",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}