{
	"author": ["Bas Basten", "Paul Klint"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/BastenK08",
	"doi": "10.1007/978-3-642-00434-6_17",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_17",
	"isbn": "978-3-642-00433-9",
	"pages": "265-284",
	"past": [
		"1. Aho, A.V., Kernighan, B.W., Weinberger, P.J.: Awk - a pattern scanning and processing language. Software–Practice and Experience 9(4), 267–279 (1979)",
		"2. Aiken, A.: Set constraints: Results, applications, and future directions. In: Born- ing, A. (ed.) PPCP 1994. LNCS, vol. 874, Springer, Heidelberg (1994) DeFacto: Language-Parametric Fact Extraction from Source Code 283",
		"3. Beyer, D., Noack, A., Lewerentz, C.: Efficient relational calculation for software analysis. IEEE Transactions on Software Engineering 31(2), 137 (2005)",
		"4. den van Brand, M.G.J., van Deursen, A., Heering, J., de Jong, H.A., de Jonge, M., Kuipers, T., Klint, P., Moonen, L., Olivier, P.A., Scheerder, J., Vinju, J.J., Visser, E., Visser, J.: The ASF+SDF meta-environment: A component-based language development environment. In: Wilhelm, R. (ed.) CC 2001. LNCS, vol. 2027, pp. 365–370. Springer, Heidelberg (2001)",
		"5. The CPPX home page (visited July 2008), http://swag.uwaterloo.ca/ ~ cppx/aboutCPPX.html",
		"6. de Moor, O., Lacey, D., van Wyk, E.: Universal regular path queries. Higher-order and symbolic computation 16, 15–35 (2003)",
		"7. de Moor, O., Verbaere, M., Hajiyev, E., Avgustinov, P., Ekman, T., Ongkingco, N., Sereni, D., Tibble, J.: Keynote address:ql for source code analysis. In: SCAM 2007: Proceedings of the Seventh IEEE International Working Conference on Source Code Analysis and Manipulation, Washington, DC, USA, pp. 3–16. IEEE Computer Society, Los Alamitos (2007)",
		"8. Dueck, G.D.P., Cormack, G.V.: Modular attribute grammars. The Computer Journal 33(2), 164–172 (1990)",
		"9. Ebert, J., Kullbach, B., Riediger, V., Winter, A.: GUPRO - generic understanding of programs. Electronic Notes in Theoretical Computer Science 72(2) (2002)",
		"10. Ekman, T., Hedin, G.: The JastAdd system - modular extensible compiler con- struction. Science of Computer Programming 69(1–3), 14–26 (2007)",
		"11. Feijs, L.M.G., Krikhaar, R., Ommering, R.C.: A relational approach to support software architecture analysis. Software Practice and Experience 28(4), 371–400 (1998)",
		"12. Ferenc, R., Siket, I., Gyim´ othy, T.: Extracting Facts from Open Source Software. In: Proceedings of the 20th International Conference on Software Maintenance (ICSM 2004), pp. 60–69. IEEE Computer Society, Los Alamitos (2004)",
		"13. The GCC home page (visited July 2008), http://gcc.gnu.org/",
		"14. GrammaTech. Codesurfer (visited July 2008), http://www.grammatech.com/products/codesurfer/",
		"15. Hajiyev, E., Verbaere, M., de Moor, O.: Codequest: Scalable source code queries with datalog. In: Thomas, D. (ed.) Proceedings of the European Conference on Object-Oriented Programming (2006)",
		"16. Heering, J., Hendriks, P.R.H., Klint, P., Rekers, J.: The syntax definition formal- ism SDF - reference manual. SIGPLAN Notices 24(11), 43–75 (1989)",
		"17. Holt, R.C.: Binary relational algebra applied to software architecture. CSRI 345, University of Toronto (March 1996)",
		"18. Holt, R.C., Winter, A., Schürr, A.: GXL: Toward a standard exchange format. In: Proceedings of the 7th Working Conference on Reverse Engineering, pp. 162–171. IEEE Computer Society, Los Alamitos (2000)",
		"19. Jackson, D., Rollins, E.: A new model of program dependences for reverse engi- neering. In: Proc. SIGSOFT Conf. on Foundations of Software Engineering, pp. 2–10 (1994)",
		"20. Jourdan, M., Parigot, D., Juli´ e, C., Durin, O., Le Bellec, C.: Design, implemen- tation and evaluation of the FNC-2 attribute grammar system. In: Proceedings of the ACM SIGPLAN 1990 Conference on Programming Language Design and Implementation (PLDI), pp. 209–222 (1990)",
		"21. Klint, P.: A meta-environment for generating programming environments. ACM Transactions on Software Engineering and Methodology 2(2), 176–201 (1993) 284 H.J.S. Basten and P. Klint",
		"22. Klint, P.: How understanding and restructuring differ from compiling—a rewrit- ing perspective. In: Proceedings of the 11th International Workshop on Program Comprehension (IWPC 2003), pp. 2–12. IEEE Computer Society, Los Alamitos (2003)",
		"23. Klint, P.: Using rscript for software analysis. In: Proceedings of Query Technolo- gies and Applications for Program Comprehension (QTAPC 2008) (June 2008) (to appear)",
		"24. Lamb, D.A.: Relations in software manufacture. Technical Report 1990-292, Queen’s University School of Computing, Kingston Ontario (1991)",
		"25. Lesk, M.E.: Lex - a lexical analyzer generator. Technical Report CS TR 39, Bell Labs (1975)",
		"26. Lin, Y., Holt, R.C.: Formalizing fact extraction. In: ATEM 2003: First Interna- tional Workshop on Meta-Models and Schemas for Reverse Engineering, Victoria, BC, November 13 (2003)",
		"27. Linton, M.A.: Implementing relational views of programs. In: Proceedings of the first ACM SIGSOFT/SIGPLAN software engineering symposium on Practical software development environments, pp. 132–140 (1984)",
		"28. Meyer, B.: The software knowledge base. In: Proceedings of the 8th international conference on Software engineering, pp. 158–165. IEEE Computer Society Press, Los Alamitos (1985)",
		"29. Müller, H., Klashinsky, K.: Rigi – a system for programming-in-the-large. In: Proceedings of the 10th International Conference on Software Engineering (ICSE 10, pp. 80–86 (April 1988)",
		"30. Murphy, G.C., Notkin, D.: Lightweight source model extraction. In: SIGSOFT 1995: Proceedings of the 3rd ACM SIGSOFT symposium on Foundations of soft- ware engineering, pp. 116–127. ACM Press, New York (1995)",
		"31. Murphy, G.C., Notkin, D., Griswold, W.G., Lan, E.S.: An empirical study of static call graph extractors. ACM Transactions on Software Engineering and Method- ology 7(2), 158–191 (1998)",
		"32. Nilsson-Nyman, E., Ekman, T., Hedin, G., Magnusson, E.: Declarative intrapro- cedural flow analysis of java source code. In: Proceedings of 8th Workshop on Language Descriptions, Tools and Applications (LDTA 2008) (2008)",
		"33. Paakki, J.: Attribute grammar paradigms - a high-level methodology in language implementation. ACM Computing Surveys 27(2), 196–255 (1995)",
		"34. Paige, R.: Viewing a program transformation system at work. In: Hermenegildo, M., Penjam, J. (eds.) PLILP 1994. LNCS, vol. 844, pp. 5–24. Springer, Heidelberg (1994)",
		"35. Paul, S., Prakash, A.: Supporting queries on source code: A formal framework. International Journal of Software Engineering and Knowledge Engineering 4(3), 325–348 (1994)",
		"36. Strein, D., Lincke, R., Lundberg, J., L¨ owe, W.: An extensible meta-model for pro- gram analysis. In: ICSM 2006: Proceedings of the 22nd IEEE International Confer- ence on Software Maintenance, Philadelphia, USA, pp. 380–390. IEEE Computer Society, Los Alamitos (2006)",
		"37. van der Storm, T.: Variability and component composition. In: Bosch, J., Krueger, C. (eds.) ICOIN 2004 and ICSR 2004. LNCS, vol. 3107, pp. 157–166. Springer, Heidelberg (2004)",
		"38. Vankov, I.: Relational approach to program slicing. Master’s thesis, University of Amsterdam (2005), http://www.cwi.nl/ ~ paulk/theses/Vankov.pdf"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["de", "facto", "languag", "parametr", "fact", "extract", "from", "sourc", "code"],
	"tag": ["fact extraction", "named", "parametricity", "source code"],
	"title": "DeFacto: Language-Parametric Fact Extraction from Source Code",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}