{
	"author": ["Einar W. Høst", "Bjarte M. Østvold"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/HostO08",
	"doi": "10.1007/978-3-642-00434-6_20",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_20",
	"isbn": "978-3-642-00433-9",
	"pages": "322-341",
	"past": [
		"1. Edwards, J.: Subtext: uncovering the simplicity of programming. In: [18], pp. 505– 518",
		"2. Frege, G.: On sense and reference. In: Geach, P., Black, M. (eds.) Translations from the Philosophical Writings of Gottlob Frege, pp. 56–78. Blackwell, Malden (1952)",
		"3. Høst, E.W., Østvold, B.M.: The programmer’s lexicon, volume I: The verbs. In: SCAM 2007: Proceedings of the Seventh IEEE International Working Conference on Source Code Analysis and Manipulation, Washington, DC, USA, pp. 193–202. IEEE Computer Society, Los Alamitos (2007)",
		"4. Wittgenstein, L.: Philosophical Investigations. Prentice Hall, Englewood Cliffs (1973)",
		"5. Cover, T.M., Thomas, J.A.: Elements of Information Theory, 2nd edn. Wiley Series in Telecommunications. Wiley, Chichester (2006)",
		"6. Manning, C.D., Schuetze, H.: Foundations of Statistical Natural Language Pro- cessing. MIT Press, Cambridge (1999)",
		"7. Fellbaum, C.: WordNet: An Electronic Lexical Database. MIT Press, Cambridge (1998)",
		"8. Collberg, C., Myles, G., Stepp, M.: An empirical study of Java bytecode programs. Software Practice and Experience 37(6), 581–641 (2007)",
		"9. Baxter, G., Frean, M., Noble, J., Rickerby, M., Smith, H., Visser, M., Melton, H., Tempero, E.: Understanding the shape of Java software. In: Proceedings of the 21th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2006, Portland, Oregon, USA, pp. 397–412. ACM, New York (2006) The Java Programmer’s Phrase Book 341",
		"10. Lawrie, D., Morrell, C., Feild, H., Binkley, D.: What’s in a name? A study of identifiers. In: Proceedings of the 14th International Conference on Program Com- prehension (ICPC 2006), Athens, Greece, pp. 3–12. IEEE Computer Society, Los Alamitos (2006)",
		"11. Caprile, B., Tonella, P.: Nomen est omen: Analyzing the language of function iden- tifiers. In: Proceedings of the Sixth Working Conference on Reverse Engineering (WCRE 1999), Atlanta, Georgia, USA, pp. 112–122. IEEE Computer Society, Los Alamitos (1999)",
		"12. Antonial, G., Gu´ eh´ eneuc, Y.G., Merlo, E., Tonella, P.: Mining the lexicon used by programmers during sofware [sic] evolution. In: Proceedings of the International Conference on Software Maintenance (ICSM), pp. 14–23 (2007)",
		"13. Singer, J., Kirkham, C.: Exploiting the correspondence between micro patterns and class names. In: SCAM 2008: Proceedings of the Eight IEEE International Working Conference on Source Code Analysis and Manipulation, pp. 67–76. IEEE Computer Society, Los Alamitos (2008)",
		"14. Gil, J., Maman, I.: Micro patterns in Java code. In: [18], pp. 97–116",
		"15. Pollock, L.L., Vijay-Shanker, K., Shepherd, D., Hill, E., Fry, Z.P., Maloor, K.: Introducing natural language program analysis, pp. 15–16. ACM, New York (2007)",
		"16. Shepherd, D., Pollock, L.L., Vijay-Shanker, K.: Towards supporting on-demand virtual remodularization using program graphs. In: Filman, R.E. (ed.) AOSD, pp. 3–14. ACM, New York (2006)",
		"17. Ma, H., Amor, R., Tempero, E.D.: Indexing the Java API using source code. In: Australian Software Engineering Conference, pp. 451–460. IEEE Computer Society, Los Alamitos (2008)",
		"18. OOPSLA 2005. Proceedings of the 20th Annual ACM SIGPLAN Conference on Object-Oriented Programming, Systems, Languages, and Applications, OOPSLA 2005, October 16-20, 2005, San Diego, CA, USA. ACM, New York (2005)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["the", "java", "programm", "s", "phrase", "book"],
	"tag": ["java"],
	"title": "The Java Programmer’s Phrase Book",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}