{
	"author": ["Hongzhi Liang", "Jürgen Dingel"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/LiangD08",
	"doi": "10.1007/978-3-642-00434-6_16",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_16",
	"isbn": "978-3-642-00433-9",
	"pages": "245-264",
	"past": [
		"1. Cordy, J.: The TXL Source Transformation Language. Science of Computer Pro- gramming 61(3) (2006)",
		"2. Czarnecki, K., Helsen, S.: Classification of model transformation approaches. In: Proceedings of the 2nd OOPSLA Workshop on Generative Techniques in the Context of Model-Driven Architecture, Anaheim, CA, USA (October 2003)",
		"3. Dean, T.R., Cordy, J.R., Malton, A.J., Schneider, K.A.: Grammar program- ming in TXL. In: 2nd Int. Workshop on Source Code Analysis and Manipulation (SCAM 2002) (2002)",
		"4. Diskin, Z., Dingel, J.: A metamodel-independent framework for model transfor- mation: Towards generic model management patterns in reverse engineering. In: 3rd Int. Workshop on Metamodels, Schemas, Grammars, and Ontologies (2006)",
		"5. Eclipse Fundation. Eclipse Graphical Modeling Framework (GMF), http://www.eclipse.org/gmf/",
		"6. Eclipse Fundation. Eclipse Modeling Framework Project (EMF), http://www.eclipse.org/modeling/emf/",
		"7. Eclipse Fundation. Eclipse UML2, http://www.eclipse.org/modeling/mdt/?project=uml2",
		"8. Grønmo, R., Oldevik, J.: An empirical study of the UML model transformation tool (UMT). In: First Interoperability of Enterprise Software and Applications, Geneva, Switzerland (February 2005)",
		"9. ATLAS Group. Atlas transformation language, http://www.eclipse.org/m2m/atl/",
		"10. Object Management Group. MDA guide version 1.0.1, http://www.omg.org/docs/omg/03-06-01.pdf",
		"11. Object Management Group. Meta-Object Facility (MOF), version 2.0, http://www.omg.org/mof/",
		"12. Object Management Group. Unified Modeling Language, version 2.1.1, http://www.omg.org/technology/documents/formal/uml.htm",
		"13. Object Management Group. XML Metadata Interchange (XMI), version 2.1.1, http://www.omg.org/cgi-bin/doc?formal/2007-12-01 264 H. Liang and J. Dingel",
		"14. Object Management Group. OMG/RFP/QVT MOF 2.0 Query/Views/ Transfor- mations RFP (2003), http://www.omg.org/docs/ad/02-04-10.pdf",
		"15. Object Management Group. Object Constraint Language Specification Version 2.0 (2006), http://www.omg.org/technology/documents/formal/ocl.htm",
		"16. IBM. Rational Software Architect, http://www-306.ibm.com/software/awdtools/architect/swarchitect/",
		"17. Jouault, F., B´ ezivin, J., Kurtev, I.: TCS: a DSL for the Specification of Textual Concrete Syntaxes in Model Engineering. In: 5th International Conference on Generative programming and Component Engineering (GPCE 2006) (2006)",
		"18. Kolovos, D., Paige, R., Polack, F.: Eclipse Development Tools for Epsilon. In: Eclipse Summit Europe, Eclipse Modeling Symposium (2006)",
		"19. Lawley, M., Steel, J.: Practical declarative model transformation with tefkat. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 139–150. Springer, Hei- delberg (2006)",
		"20. Liang, H., Diskin, Z., Posse, J.D.E.: A general approach for scenario integration. In: ACM/IEEE 11th International Conference on Model Driven Engineering Lan- guages and Systems (MoDELS 2008) (October 2008)",
		"21. Malton, A.J.: The denotational semantics of a functional tree-manipulation lan- guage. Computer Languages 19(3), 157–168 (1993)",
		"22. Paige, R.F., Radjenovic, A.: Towards model transformation with TXL. In: Proc. Metamodelling for MDA Workshop, York, UK (November 2003)",
		"23. Peltier, M., B´ ezivin, J., Guillaume, G.: MTRANS: A general framework, based on XSLT, for model transformations. In: Proceedings of the Workshop on Trans- formations in UML (WTUML 2001), Genova, Italy (April 2001)",
		"24. AGG project. AGG system, http://tfs.cs.tu-berlin.de/agg/",
		"25. AToM 3 project. AToM 3 A Tool for Multi-formalism Meta-Modelling, http://atom3.cs.mcgill.ca/",
		"26. GReAT project. GReAT: Graph Rewriting And Transformation, http://www.isis.vanderbilt.edu/Projects/mobies/downloads.asp",
		"27. VIATRA2 project, http://dev.eclipse.org/viewcvs/indextech.cgi/gmt- home/subprojects/VIATRA2/index.html/",
		"28. Schürr, A., Winter, A.J., Zündorf, A.: The Progres approach: Language and envi- ronment. In: Handbook of Graph Grammars and Computing by Graph Transfor- mation: Applications, Languages and Tools. World Scientific, Singapore (1997)",
		"29. Thurston, A.D., Cordy, J.R.: Evolving TXL. In: 6th Int. Workshop on Source Code Analysis and Manipulation (SCAM 2006) (2006)",
		"30. Tratt, L.: The MT model transformation language. In: Proceedings of the 2006 ACM Symposium on Applied Computing (SAC 2006), Dijon, France (2006)",
		"31. Varró, G., Schürr, A., Varr´ o, D.: Benchmarking for graph transformation. In: Symposium on Visual Languages and Human-Centric Computing (2005)",
		"32. W3C. XSL Transformations Version 1.0, http://www.w3.org/TR/xslt",
		"33. Willink, E.: UMLX: A graphical transformation language for MDA. In: Workshop on Model Driven Architecture: Foundations and Applications (June 2003)",
		"34. Winkelmann, J., Taentzer, G., Ehrig, K., Küster, J.M.: Translation of restricted OCL constraints into graph constraints for generating meta model instances by graph grammars. Electron. Notes Theor. Comput. Sci. 211, 159–170 (2008)",
		"35. Zhang, H., Cordy, J.: XML 1.0. Grammar and Well-formedness Checker, 2nd edn., http://www.txl.ca/nresources.html"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["a", "practic", "evalu", "of", "use", "txl", "for", "model", "transform"],
	"tag": ["evaluation", "model transformation", "txl", "using"],
	"title": "A Practical Evaluation of Using TXL for Model Transformation",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}