{
	"author": ["Bernhard Schätz"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/Schatz08",
	"doi": "10.1007/978-3-642-00434-6_15",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_15",
	"isbn": "978-3-642-00433-9",
	"pages": "227-244",
	"past": [
		"[1] Fowler, M., Scott, K.: UML Distilled. Addison-Wesley, Reading (1997)",
		"[2] Klar, F., Königs, A., Schürr, A.: Model transformation in the large. In: ESEC/FSE 2007. ACM Press, New York (2007)",
		"[3] Varró, D., Pataricza, A.: Generic and meta-transformations for model transformation engi- neering. In: Baar, T., Strohmeier, A., Moreira, A., Mellor, S.J. (eds.) UML 2004. LNCS, vol. 3273, pp. 290–304. Springer, Heidelberg (2004)",
		"[4] Grunske, L., Geiger, L., Lawley, M.: A graphical specification of model transformations withtriplegraph grammars. In: Hartman, A.,Kreische, D. (eds.) ECMDA-FA 2005. LNCS, vol. 3748, pp. 284–298. Springer, Heidelberg (2005)",
		"[5] Sprinkle, J., Agrawal, A., Levendovszky, T.: Domain Model Translation Using Graph Transformations. In: ECBS 2003 - Engineering of Computer-Based Systems (2003)",
		"[6] Rozenberg, G. (ed.): Handbook on Graph Grammars and Computing by Graph Transfor- mation: Foundations. World Scientific, Singapore (1997)",
		"[7] OMG:Initialsubmisison totheMOF 2.0Q/V/TRFP.TechnicalReport ad/03-03-27, Object Management Group (OMG) (2003), http://www.omg.org",
		"[8] Jouault, F., Allilaire, F., Bézivin, J., Kurtev, I., Valduriez, P.: ATL: a QVT-like transforma- tion language. In: OOPSLA 2006, pp. 719–720. ACM Press, New York (2006)",
		"[9] Gerber, A., Lawley, M., Raymond, K., Steel, J., Wood, A.: Transformation: The Missing Link of MDA. In: Corradini, A., Ehrig, H., Kreowski, H.-J., Rozenberg, G. (eds.) ICGT 2002. LNCS, vol. 2505. Springer, Heidelberg (2002)",
		"[10] Lawley, M., Steel, J.: Practical declarative model transformation with tefkat. In: Bruel, J.- M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 139–150. Springer, Heidelberg (2006)",
		"[11] White, J., Schmidt, D.C., Nechypurenko, A., Wuchner, E.: Introduction to the generic eclipse modelling system",
		"[12] Varró, G., Friedl, K., Varró, D.: Implementing a graph transformation engine in relational databases. Software and Systems Modeling 5 (2006)",
		"[13] Schätz, B., Huber, F.: Integrating formal description techniques. In: Woodcock, J.C.P., Davies, J., Wing, J.M. (eds.) FM 1999. LNCS, vol. 1709, p. 1206. Springer, Heidelberg (1999)",
		"[14] Steinberg, D., Budinsky, F., Paternostro, M., Merks, E.: EMF: Eclipse Modeling Frame- work, 2nd edn. Addison Wesley Professional, Reading (2007)",
		"[15] Jones, S.P.: Haskell 98 language and libraries: the Revised Report. Cambridge University Press, Cambridge (2003)",
		"[16] Denti, E., Omicini, A., Ricci, A.: Multi-paradigm Java-Prolog integration in tu Prolog. Sci- ence of Computer Programming 57(2), 217–250 (2005)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["formal", "and", "rule", "base", "transform", "of", "emf", "ecor", "base", "model"],
	"tag": ["emf", "formal method", "modelling", "rule-based"],
	"title": "Formalization and Rule-Based Transformation of EMF Ecore-Based Models",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}