{
	"author": ["Thomas Goldschmidt"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/Goldschmidt08",
	"doi": "10.1007/978-3-642-00434-6_11",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_11",
	"isbn": "978-3-642-00433-9",
	"pages": "168-177",
	"past": [
		"1. Object Management Group: Object Constraint Language (OCL) Specification Version 2.0. OMG Document No 05-06-06",
		"2. Uhl, A.: Model-driven development in the enterprise (2007) (Last retrieved 2008-07-06), http://www.sdn.sap.com/irj/sdn/weblogs?blog=/pub/wlg/7237",
		"3. Uhl, A.: Model-driven development in the enterprise. IEEE Software 25(1), 46–49 (2008)",
		"4. Wagner, T.A.: Practical Algorithms for Incremental Software Development Environments. PhD thesis, University of California, Berkeley (1998)",
		"5. Nagl, M. (ed.): Building tightly integrated software development environments: the IPSEN approach. Springer, New York (1996) Towards an Incremental Update Approach for CTSs 177",
		"6. Teitelbaum, T., Reps, T.: The cornell program synthesizer: a syntax-directed programming environment. Commun. ACM 24(9), 563–573 (1981)",
		"7. Bahlke, R., Snelting, G.: The psg - programming system generator. SIGPLAN Not. 20(7), 28–33 (1985)",
		"8. Wimmer, M., Kramler, G.: Bridging grammarware and modelware. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 159–168. Springer, Heidelberg (2006)",
		"9. Karlsch, M.: A model-driven framework for domain specific languages. Master’s thesis, Uni- versity of Potsdam, Hasso Plattner Insitute (2007)",
		"10. Garcia, M., Sentosa, P.: Generation of Eclipse-based IDEs for Custom DSLs. Technical re- port, Software Systems Institute (STS), Technische Universität Hamburg-Harburg, Germany (2007)",
		"11. Krahn, H., Rumpe, B., Völkel, S.: Efficient editor generation for compositional dsls in eclipse. In: Proc. of the 7th OOPSLA Workshop on Domain-Specific Modeling (DSM 2007), Montreal, Quebec, Canada (2007)",
		"12. Jouault, F., Bézivin, J., Kurtev, I.: TCS: a DSL for the specification of textual concrete syn- taxes in model engineering. In: GPCE 2006, pp. 249–254. ACM Press, New York (2006)",
		"13. Scheidgen, M.: Textual editing framework (2007) (Last retrieved 2008-07-06), http://www2.informatik.hu-berlin.de/sam/meta-tools/tef/ tool.html",
		"14. Efftinge, S.: Xtext reference documentation (2006) (Last retrieved 2008-07-06), http://www.eclipse.org/gmt/oaw/doc/4.1/r80_xtextReference.pdf",
		"15. Eclipse Foundation: The Eclipse Modelling Project (2006) (Last retrieved 2008-07-06), http://www.eclipse.org/modeling/",
		"16. Goldschmidt, T., Becker, S., Uhl, A.: Classification of Concrete Textual Syntax Mapping Approaches. In: Proc. of the 4th European Conference on Model Driven Architecture - Foun- dations and Applications (ECMDA 2008), pp. 169–184 (2008)",
		"17. Fondement, F.: Concrete syntax definition for modeling languages. PhD thesis, Ecole Poly- technique Fédérale de Lausanne (2007)",
		"18. Eclipse Foundation: Eclipse Java Development Tools (JDT) Subproject (2008) (last visited 24.01.2008), http://www.eclipse.org/jdt/"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["toward", "an", "increment", "updat", "approach", "for", "concret", "textual", "syntax", "for", "uuid", "base", "model", "repositori"],
	"tag": ["approach", "incremental", "repository", "towards"],
	"title": "Towards an Incremental Update Approach for Concrete Textual Syntaxes for UUID-Based Model Repositories",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}