{
	"author": ["Pablo Sánchez", "Neil Loughran", "Lidia Fuentes", "Alessandro Garcia"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/SanchezLFG08",
	"doi": "10.1007/978-3-642-00434-6_13",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_13",
	"isbn": "978-3-642-00433-9",
	"pages": "188-207",
	"past": [
		"1. Pohl, K., Bockle, G., van der Linden, F.: Software Product Line Engineering: Foun- dations, Principles and Techniques. Springer, Heidelberg (2005)",
		"2. K¨ ak¨ ol¨ a, T., Due˜ nas, J.C.: Software Product Lines: Research Issues in Engineering and Management. Springer, Heidelberg (2006)",
		"3. Beuche, D.: Variant Management with pure:variants. Technical report, pure- systems GmbH (2003)",
		"4. Krueger, C.W.: BigLever Software Gears and the 3-tiered SPL Methodology. In: Companion to the 22nd Int. Conference on Object-Oriented Programming, Sys- tems, Languages, and Applications (OOPSLA), Montreal, Quebec, Canada, pp. 844–845 (October 2007)",
		"5. Beydeda, S., Book, M., Gruhn, V.: Model-Driven Development. Springer, Heidel- berg (2005)",
		"6. Jouault, F., Kurtev, I.: Transforming Models with ATL. In: Bruel, J.-M. (ed.) MoDELS 2005. LNCS, vol. 3844, pp. 128–138. Springer, Heidelberg (2006)",
		"7. (April 2008), http://www.openarchitectureware.org/",
		"8. V¨ olter, M., Groher, I.: Product Line Implementation using Aspect-Oriented and Model-Driven Software Development. In: Proc. of the 11th Int. Software Product Line Conference (SPLC), Kyoto, Japan, pp. 233–242 (September 2007)",
		"9. Czarnecki, K., Helsen, S., Eisenecker, U.W.: Staged Configuration through Spe- cialization and Multilevel Configuration of Feature Models. Software Process: Im- provement and Practice 10(2), 143–169 (2005)",
		"10. Ziadi, T., J´ ez´ equel, J.M.: Software Product Line Engineering with the UML: De- riving Products. In: [2], pp. 557–588 2 AMPLE project: http://www.ample-project.net Engineering Languages for Specifying Product-Derivation Processes 207",
		"11. Botterweck, G., O’Brien, L., Thiel, S.: Model-Driven Derivation of Product Archi- tectures. In: Proc. of the 22nd Int. Conference on Automated Software Engineering (ASE), Atlanta, Georgia, USA, pp. 469–472 (2007)",
		"12. Jayaraman, P., Whittle, J., Elkhodary, A.M., Gomaa, H.: Model Composition in Product Lines and Feature Interaction Detection Using Critical Pair Analysis. In: Engels, G., Opdyke, B., Schmidt, D.C., Weil, F. (eds.) MODELS 2007. LNCS, vol. 4735, pp. 151–165. Springer, Heidelberg (2007)",
		"13. Czarnecki, K., Helsen, S.: Feature-based survey of model transformation ap- proaches. IBM Systems Journal 45(3), 621–645 (2006)",
		"14. Taentzer, G.: AGG: A Graph Transformation Environment for Modeling and Val- idation of Software. In: Pfaltz, J.L., Nagl, M., B¨ ohlen, B. (eds.) AGTIVE 2003. LNCS, vol. 3062, pp. 446–453. Springer, Heidelberg (2004)",
		"15. Loughran, N., S´ anchez, P., Garcia, A., Fuentes, L.: Language Support for Managing Variability in Architectural Models. In: Pautasso, C., Tanter, ´ E. (eds.) SC 2008. LNCS, vol. 4954, pp. 36–51. Springer, Heidelberg (2008)",
		"16. Kolovos, D.S., Paige, R.F., Polack, F.A.: Novel Features in Languages of the Ep- silon Model Management Platform. In: Proc. of the Int. Workshop on Models in Software Engineering (MiSE), 30th Int. Conference on software Engineering (ICSE), Leipzig (Germany), pp. 69–73 (May 2008)",
		"17. Oldevik, J., Haugen, Ø.: Higher-Order Transformations for Product Lines. In: Proc. of the 11th Int. Conference on Software Product Lines (SPLC), Kyoto, Japan, pp. 243–254 (September 2007)",
		"18. Tolvanen, J.-P., Kelly, S.: Defining domain-specific modeling languages to automate product derivation: Collected experiences. In: Obbink, H., Pohl, K. (eds.) SPLC 2005. LNCS, vol. 3714, pp. 198–209. Springer, Heidelberg (2005)",
		"19. Stephan, M., Antkiewicz, M.: Ecore.fmp: A tool for editing and instantiating class models as feature models. Technical Report Tech. Rep. 2008-08, ECE, University of Waterloo (May 2008)",
		"20. Heidenreich, F., Kopcsek, J., Wende, C.: Featuremapper: mapping features to mod- els. In: Companion of the 30th International Conference on Software Engineering (ICSE), Leipzig, Germany, pp. 943–944 (May 2008)",
		"21. Czarnecki, K., Antkiewicz, M.: Mapping Features to Models: A Template Approach Based on Superimposed Variants. In: Glück, R., Lowry, M. (eds.) GPCE 2005. LNCS, vol. 3676, pp. 422–437. Springer, Heidelberg (2005)",
		"22. Hendrickson, S.A., van der Hoek, A.: Modeling Product Line Architectures through Change Sets and Relationships. In: Proc. of the 29th Int. Conference on Software Engineering (ICSE), Minneapolis, Minnessota, USA, pp. 189–198 (May 2007)",
		"23. Alf´ erez, M., Kulesza, U., Sousa, A., Santos, J., Moreira, A., Araújo, J., Amaral, V.: A Model-driven Approach for Software Product Lines Requirements Engineering. In: Proc. of the 20th Int. Conference on Software Engineering and Knowledge Engineering (SEKE), San Francisco Bay, California, USA (July 2008)",
		"24. Bravenboer, M., Kalleberg, K.T., Vermaas, R., Visser, E.: Stratego/XT 0.17. A Language and Toolset for Program Transformation. Science of Computer Program- ming 72(1-2), 52–70 (2008)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["engin", "languag", "for", "specifi", "product", "deriv", "process", "in", "softwar", "product", "line"],
	"tag": ["process", "product line", "specification"],
	"title": "Engineering Languages for Specifying Product-Derivation Processes in Software Product Lines",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}