{
	"author": ["José Eduardo Rivera", "Esther Guerra", "Juan de Lara", "Antonio Vallecillo"],
	"back": "SLE-2008",
	"booktitle": "Revised Selected Papers of the First International Conference on Software Language Engineering",
	"booktitleshort": "SLE",
	"crossref": "conf/sle/2008",
	"dblpkey": "conf/sle/RiveraGLV08",
	"doi": "10.1007/978-3-642-00434-6_5",
	"editor": ["Dragan Gašević", "Ralf Lämmel", "Eric Van Wyk"],
	"ee": "http://dx.doi.org/10.1007/978-3-642-00434-6_5",
	"isbn": "978-3-642-00433-9",
	"pages": "54-73",
	"past": [
		"1. Ehrig, H., Ehrig, K., Prange, U., Taentzer, G.: Fundamentals of algebraic graph transformation. Springer, Heidelberg (2006)",
		"2. Rozenberg, G. (ed.): Handbook of Graph Grammars and Computing by Graph Transformations. Foundations, vol. 1. World Scientific, Singapore (1997)",
		"3. de Lara, J., Vangheluwe, H.: Defining visual notations and their manipulation through meta-modelling and graph transformation. Journal of Visual Languages and Computing 15(3–4), 309–330 (2006)",
		"4. Heckel, R., Küster, J.M., Taentzer, G.: Confluence of typed attributed graph trans- formation systems. In: Corradini, A., Ehrig, H., Kreowski, H.-J., Rozenberg, G. (eds.) ICGT 2002. LNCS, vol. 2505, pp. 161–176. Springer, Heidelberg (2002)",
		"5. Vallecillo, A.: A journey through the secret life of models. In: Model Engineering of Complex Systems (MECS). Number 08331 in Dagstuhl Seminar Proceedings, Dagstuhl, Germany (2008), http://drops.dagstuhl.de/opus/volltexte/2008/1601",
		"6. Baldan, P., Corradini, A., K¨ onig, B.: A static analysis technique for graph trans- formation systems. In: Larsen, K.G., Nielsen, M. (eds.) CONCUR 2001. LNCS, vol. 2154, pp. 381–395. Springer, Heidelberg (2001) 72 J.E. Rivera et al.",
		"7. Baresi, L., Spoletini, P.: On the use of alloy to analyze graph transformation sys- tems. In: Corradini, A., Ehrig, H., Montanari, U., Ribeiro, L., Rozenberg, G. (eds.) ICGT 2006. LNCS, vol. 4178, pp. 306–320. Springer, Heidelberg (2006)",
		"8. Cabot, J., Claris´ o, R., Guerra, E., de Lara, J.: Analysing graph transformation rules through OCL. In: Vallecillo, A., Gray, J., Pierantonio, A. (eds.) ICMT 2008. LNCS, vol. 5063, pp. 229–244. Springer, Heidelberg (2008)",
		"9. de Lara, J., Vangheluwe, H.: Translating model simulators to analysis models. In: Fiadeiro, J.L., Inverardi, P. (eds.) FASE 2008. LNCS, vol. 4961, pp. 77–92. Springer, Heidelberg (2008)",
		"10. Varró, D.: Automated formal verification of visual modeling languages by model checking. Software and System Modeling 3(2), 85–113 (2004)",
		"11. Clavel, M., Dur´ an, F., Eker, S., Lincoln, P., Mart´ı-Oliet, N., Meseguer, J., Talcott, C.: All About Maude - A High-Performance Logical Framework. LNCS, vol. 4350. Springer, Heidelberg (2007)",
		"12. Rivera, J.E., Vallecillo, A.: Adding behavioral semantics to models. In: Proc. of EDOC 2007, pp. 169–180. IEEE Computer Society, Los Alamitos (2007)",
		"13. Romero, J.R., Rivera, J.E., Dur´ an, F., Vallecillo, A.: Formal and tool support for model driven engineering with Maude. Journal of Object Technology 6(9), 187–207 (2007)",
		"14. Boronat, A., Meseguer, J.: An algebraic semantics for MOF. In: Fiadeiro, J.L., Inverardi, P. (eds.) FASE 2008. LNCS, vol. 4961, pp. 377–391. Springer, Heidelberg (2008)",
		"15. Habel, A., Pennemann, K.: Satisfiability of high-level conditions. In: Corradini, A., Ehrig, H., Montanari, U., Ribeiro, L., Rozenberg, G. (eds.) ICGT 2006. LNCS, vol. 4178, pp. 430–444. Springer, Heidelberg (2006)",
		"16. de Lara, J., Bardohl, R., Ehrig, H., Ehrig, K., Prange, U., Taentzer, G.: At- tributed graph transformation with node type inheritance. Theoretical Computer Science 376(3), 139–163 (2007)",
		"17. Mart´ı-Oliet, N., Meseguer, J.: Rewriting logic: roadmap and bibliography. Theo- retical Computer Science 285(2), 121–154 (2002)",
		"18. Rivera, J.E., Vallecillo, A., Dur´ an, F.: Formal specification and analysis of Domain Specific Languages using Maude. Technical report, Universidad de M´ alaga (2008), http://atenea.lcc.uma.es/images/e/eb/AnalysingModels.pdf",
		"19. Eker, S., Meseguer, J., Sridharanarayanan, A.: The Maude LTL model checker. In: Proc. WRLA 2002, Pisa, Italy. ENTCS, vol. 71, pp. 115–142. Elsevier, Amsterdam (2002)",
		"20. Meseguer, J., Palomino, M., Mart´ı-Oliet, N.: Equational abstractions. In: Baader, F. (ed.) CADE 2003. LNCS, vol. 2741, pp. 2–16. Springer, Heidelberg (2003)",
		"21. Harel, D., Rumpe, B.: Meaningful modeling: What’s the semantics of “semantics”? Computer 37(10), 64–72 (2004)",
		"22. Engels, G., Hausmann, J.H., Heckel, R., Sauer, S.: Dynamic meta modeling: A graphical approach to the operational semantics of behavioral diagrams in UML. In: Evans, A., Kent, S., Selic, B. (eds.) UML 2000. LNCS, vol. 1939, pp. 323–337. Springer, Heidelberg (2000)",
		"23. Rensink, A.: Explicit state model checking for graph grammars. In: Degano, P., De Nicola, R., Meseguer, J. (eds.) Concurrency, Graphs and Models. LNCS, vol. 5065, pp. 114–132. Springer, Heidelberg (2008)",
		"24. S´ aez, J., Toval, A., Fernández Alem´ an, J.L.: Tool support for transforming UML models to a formal language. In: Proc. of WTUML 2001, pp. 111–115 (2001)",
		"25. The MOVA Group: The MOVA tool: a validation tool for UML (2006), http://maude.sip.ucm.es/mova/ Analyzing Rule-Based Behavioral Semantics of Visual Modeling Languages 73",
		"26. Boronat, A., Cars´ı, J. ´ A., Ramos, I.: Automatic support for traceability in a generic model management framework. In: Hartman, A., Kreische, D. (eds.) ECMDA-FA 2005. LNCS, vol. 3748, pp. 316–330. Springer, Heidelberg (2005)",
		"27. The ISSI Research Group: MOMENT (2008), http://moment.dsic.upv.es",
		"28. Ruscio, D.D., Jouault, F., Kurtev, I., B´ ezivin, J., Pierantonio, A.: Extending AMMA for supporting dynamic semantics specifications of DSLs. Technical Report 06.02, Laboratoire d’Informatique de Nantes-Atlantique (LINA), Nantes, France (2006)",
		"29. Poernomo, I.: Proofs-as-model-transformations. In: Vallecillo, A., Gray, J., Pieran- tonio, A. (eds.) ICMT 2008. LNCS, vol. 5063, pp. 214–228. Springer, Heidelberg (2008)",
		"30. Clavel, M., Dur´ an, F., Hendrix, J., Lucas, S., Meseguer, J., ¨ Olveczky, P.C.: The maude formal tool environment. In: Mossakowski, T., Montanari, U., Haveraaen, M. (eds.) CALCO 2007. LNCS, vol. 4624, pp. 173–178. Springer, Heidelberg (2007)"
	],
	"publisher": "Springer International Publishing",
	"publishershort": "Springer",
	"series": "Lecture Notes in Computer Science",
	"seriesshort": "LNCS",
	"stemmed": ["analyz", "rule", "base", "behavior", "semant", "of", "visual", "model", "languag", "with", "maud"],
	"tag": ["behaviour", "maude", "modelling", "rule-based", "semantics", "visual notation"],
	"title": "Analyzing Rule-Based Behavioral Semantics of Visual Modeling Languages with Maude",
	"type": "inproceedings",
	"venue": "SLE",
	"volume": 5452,
	"year": 2008
}